bcv_parser::regexps.space = "[\\s\\xa0]"
bcv_parser::regexps.escaped_passage = ///
	(?:^ | [^\x1f\x1e\dA-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ] )	# Beginning of string or not in the middle of a word or immediately following another book. Only count a book if it's part of a sequence: `Matt5John3` is OK, but not `1Matt5John3`
		(
			# Start inverted book/chapter (cb)
			(?:
				  (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s* (?: [\u2013\u2014\-] | through | thru | to) \s* \d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: \d+ (?: th | nd | st ) \s*
					ch (?: apter | a?pt\.? | a?p?\.? )? \s* #no plurals here since it's a single chapter
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )? \s* )
			)? # End inverted book/chapter (cb)
			\x1f(\d+)(?:/\d+)?\x1f		#book
				(?:
				    /\d+\x1f				#special Psalm chapters
				  | [\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014]
				  | надписаниях (?! [a-z] )		#could be followed by a number
				  | и#{bcv_parser::regexps.space}+далее | главы | стихи | глав | стих | гл | — | и
				  | [аб] (?! \w )			#a-e allows 1:1a
				  | $						#or the end of the string
				 )+
		)
	///gi
# These are the only valid ways to end a potential passage match. The closing parenthesis allows for fully capturing parentheses surrounding translations (ESV**)**.
bcv_parser::regexps.match_end_split = ///
	  \d+ \W* надписаниях
	| \d+ \W* и#{bcv_parser::regexps.space}+далее (?: [\s\xa0*]* \.)?
	| \d+ [\s\xa0*]* [аб] (?! \w )
	| \x1e (?: [\s\xa0*]* [)\]\uff09] )? #ff09 is a full-width closing parenthesis
	| [\d\x1f]+
	///gi
bcv_parser::regexps.control = /[\x1e\x1f]/g
bcv_parser::regexps.pre_book = "[^A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ]"

bcv_parser::regexps.first = "(?:1-?я|1-?е|1)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.second = "(?:2-?я|2-?е|2)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.third = "(?:3-?я|3-?е|3)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.range_and = "(?:[&\u2013\u2014-]|и|—)"
bcv_parser::regexps.range_only = "(?:[\u2013\u2014-]|—)"
# Each book regexp should return two parenthesized objects: an optional preliminary character and the book itself.
bcv_parser::regexps.get_books = (include_apocrypha, case_sensitive) ->
	books = [
		osis: ["Ps"]
		apocrypha: true
		extra: "2"
		regexp: ///(\b)( # Don't match a preceding \d like usual because we only want to match a valid OSIS, which will never have a preceding digit.
			Ps151
			# Always follwed by ".1"; the regular Psalms parser can handle `Ps151` on its own.
			)(?=\.1)///g # Case-sensitive because we only want to match a valid OSIS.
	,
		osis: ["Gen"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Бытия|Быт(?:ие)?|Gen)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Exod"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Exod|Книга[\s\xa0]*Исход|Исх(?:од)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bel"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Бел(?:[\s\xa0]*и[\s\xa0]*Дракон|е)?|Bel|Виле[\s\xa0]*и[\s\xa0]*драконе)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Левит|Lev|Лев(?:ит)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Num"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Чис(?:ла)?|Num|Книга[\s\xa0]*Чисел)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sir"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премудрост(?:ь[\s\xa0]*Сираха|и[\s\xa0]*Иисуса,[\s\xa0]*сына[\s\xa0]*Сирахова)|Ekkleziastik|Сир(?:ахова)?|Sir)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Wis"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Wis|Прем(?:удрости[\s\xa0]*Соломона)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lam"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Плач(?:[\s\xa0]*Иеремии)?|Lam)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["EpJer"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*Иеремии|EpJer)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Отк(?:р(?:овение)?)?|Rev)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrMan"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:PrMan|Молитва[\s\xa0]*Манассии)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Deut"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Втор(?:озаконие)?|Deut)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Josh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иисус(?:[\s\xa0]*Навин|а[\s\xa0]*Навина)|Josh|Нав|Книга[\s\xa0]*Иисуса[\s\xa0]*Навина)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Judg"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Суде(?:[ий](?:[\s\xa0]*Израилевых)?)|Суд(?:е[ий])?|Judg)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ruth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Руфи|Ruth|Руфь?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:1Esd|2(?:(?:[ея](?:[\s\xa0]*Ездры|\.[\s\xa0]*Ездры))|-?(?:[яе](?:[\s\xa0]*Ездры|\.[\s\xa0]*Ездры))|[\s\xa0]*Езд(?:ры)?|\.[\s\xa0]*Ездры))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:2Esd|3(?:(?:[яе](?:[\s\xa0]*Ездры|\.[\s\xa0]*Ездры))|-?(?:[ея](?:[\s\xa0]*Ездры|\.[\s\xa0]*Ездры))|[\s\xa0]*Езд(?:ры)?|\.[\s\xa0]*Ездры))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Isa"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Исаии|Isa|Ис(?:аи[яи]?)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Sam"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|-?(?:[яе](?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)))|(?:[ея](?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)))|[\s\xa0]*(?:Цар(?:ств)?|Самуила|Книга[\s\xa0]*Царств)|Sam)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Sam"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|-?(?:[яе](?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)))|(?:[яе](?:\.[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)|[\s\xa0]*(?:Самуила|Царств|Книга[\s\xa0]*Царств)))|[\s\xa0]*(?:Цар(?:ств)?|Самуила|Книга[\s\xa0]*Царств)|Sam)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Kgs"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:4(?:-?(?:[яе](?:[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)))|[\s\xa0]*(?:Цар(?:ств)?|Книга[\s\xa0]*Царств)|(?:[ея](?:[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)))|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств))|2(?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[йи]|(?:[ея](?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[ий]))|Kgs|-?(?:[ея](?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[ий]))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Kgs"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:3(?:-?(?:[яе](?:[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)))|[\s\xa0]*(?:Цар(?:ств)?|Книга[\s\xa0]*Царств)|(?:[ея](?:[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств)))|\.[\s\xa0]*(?:Царств|Книга[\s\xa0]*Царств))|1(?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[йи]|(?:[ея](?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[йи]))|Kgs|-?(?:[яе](?:[\s\xa0]*Царе[ий]|\.[\s\xa0]*Царе[йи]))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Chr"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:[\s\xa0]*(?:Пар(?:алипоменон)?|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник)|Chr|(?:[яе](?:[\s\xa0]*(?:Паралипоменон|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник)))|-?(?:[ея](?:[\s\xa0]*(?:Паралипоменон|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Chr"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:[\s\xa0]*(?:Пар(?:алипоменон)?|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник)|Chr|(?:[яе](?:[\s\xa0]*(?:Паралипоменон|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник)))|-?(?:[ея](?:[\s\xa0]*(?:Паралипоменон|Хроник)|\.[\s\xa0]*(?:Паралипоменон|Хроник))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezra"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:Езд(?:р[аы])?|Первая[\s\xa0]*Ездры|Книга[\s\xa0]*Ездры|Ezra|1[\s\xa0]*Езд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Neh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Неем(?:и[яи])?|Книга[\s\xa0]*Неемии|Neh)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["GkEsth"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Дополнения[\s\xa0]*к[\s\xa0]*Есфири|GkEsth)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Esth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Есфири|Esth|Есф(?:ирь)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Job"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Job|Книга[\s\xa0]*Иова|Иова?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ps"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пс(?:ал(?:мы|ом|тирь)?)?|Ps)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrAzar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Молитва[\s\xa0]*Азария|PrAzar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Prov"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*притче[йи][\s\xa0]*Соломоновых|Prov|Пр(?:ит(?:чи)?)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eccl"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Екклесиаста|Екк(?:лесиаст)?|Eccl)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["SgThree"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Благодарственная[\s\xa0]*песнь[\s\xa0]*отроков|SgThree|Песнь[\s\xa0]*тр[её]х[\s\xa0]*отроков|Молитва[\s\xa0]*святых[\s\xa0]*трех[\s\xa0]*отроков)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Song"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Song|Песн(?:ь[\s\xa0]*песне[йи][\s\xa0]*Соломона|и[\s\xa0]*Песне[ий])?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jer"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иер(?:еми[яи])?|Книга[\s\xa0]*пророка[\s\xa0]*Иеремии|Jer)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иез(?:екиил[ья])?|Ezek|Книга[\s\xa0]*пророка[\s\xa0]*Иезекииля)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Dan"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Дан(?:иила?)?|Dan|Книга[\s\xa0]*пророка[\s\xa0]*Даниила)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ос(?:и[яи])?|Книга[\s\xa0]*пророка[\s\xa0]*Осии|Hos)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Joel"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иоил[ья]?|Книга[\s\xa0]*пророка[\s\xa0]*Иоиля|Joel)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Amos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Amos|Амоса?|Книга[\s\xa0]*пророка[\s\xa0]*Амоса)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Авдия|Obad|Авд(?:ия)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jonah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Ионы|Ион[ыа]|Jonah)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mic"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Mic|Мих(?:е[ияй])?|Книга[\s\xa0]*пророка[\s\xa0]*Михея)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Nah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Наума?|Книга[\s\xa0]*пророка[\s\xa0]*Наума|Nah)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Аввакума|Авв(?:акума?)?|Hab)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zeph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Соф(?:они[ия])?|Книга[\s\xa0]*пророка[\s\xa0]*Софонии|Zeph)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hag"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Hag|Агг(?:е[йия])?|Книга[\s\xa0]*пророка[\s\xa0]*Аггея)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zech"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Zech|Книга[\s\xa0]*пророка[\s\xa0]*Захарии|Зах(?:ари[ия])?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Малахии|Mal|Мал(?:ахи[ия])?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Matt"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:М[тф]|От[\s\xa0]*Матфея|Евангелие[\s\xa0]*от[\s\xa0]*Матфея|Matt)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mark"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:От[\s\xa0]*Марка|Mark|М[рк]|Евангелие[\s\xa0]*от[\s\xa0]*Марка)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Luke"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Luke|Лк|Евангелие[\s\xa0]*от[\s\xa0]*Луки|От[\s\xa0]*Луки)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1John"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|John|(?:[ея](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)))|[\s\xa0]*(?:И(?:оанна|н)|послание[\s\xa0]*Иоанна)|-?(?:[ея](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2John"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|John|(?:[ея](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)))|[\s\xa0]*(?:И(?:оанна|н)|послание[\s\xa0]*Иоанна)|-?(?:[яе](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3John"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		3(?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|John|(?:[ея](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)))|[\s\xa0]*(?:И(?:оанна|н)|послание[\s\xa0]*Иоанна)|-?(?:[яе](?:\.[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна)|[\s\xa0]*(?:Иоанна|послание[\s\xa0]*Иоанна))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["John"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*Иоанна|От[\s\xa0]*Иоанна|John|Ин)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Acts"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Деян(?:ия)?|Acts)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rom"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Рим(?:лянам)?|Rom|Послание[\s\xa0]*к[\s\xa0]*Римлянам|К[\s\xa0]*Римлянам)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Cor"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:-?(?:[ея](?:\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)))|\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|(?:[ея](?:\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)))|[\s\xa0]*(?:Кор(?:инфянам)?|к[\s\xa0]*Коринфянам)|Cor)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Cor"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:-?(?:[яе](?:\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)))|\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|(?:[яе](?:\.[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)|[\s\xa0]*(?:Коринфянам|к[\s\xa0]*Коринфянам)))|[\s\xa0]*(?:Кор(?:инфянам)?|к[\s\xa0]*Коринфянам)|Cor)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Gal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Гал(?:атам)?|Gal|К[\s\xa0]*Галатам|Послание[\s\xa0]*к[\s\xa0]*Галатам)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Eph|К[\s\xa0]*Ефесянам|Послание[\s\xa0]*к[\s\xa0]*Ефесянам|Еф(?:есянам)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phil"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Фил(?:иппи[ий]цам)?|Phil|Послание[\s\xa0]*к[\s\xa0]*Филиппи[ий]цам|К[\s\xa0]*Филиппи[йи]цам)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Col"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:К(?:ол(?:оссянам)?|[\s\xa0]*Колоссянам)|Col|Послание[\s\xa0]*к[\s\xa0]*Колоссянам)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Thess"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фес(?:салоники[ий]цам)?)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[ий]цам|Фессалоники[йи]цам)|Thess|[яе](?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[ий]цам|Фессалоники[йи]цам)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам)))|-?[яе](?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[ий]цам|Фессалоники[йи]цам)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам))))|2(?:-?[яе](?:[\s\xa0]*Фессалоники(?:[йи]цам|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам)))|[яе](?:[\s\xa0]*Фессалоники(?:[йи]цам|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам))))|2(?:-?[яе]\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[йи]цам|Фессалоники[ий]цам))|[ея]\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[йи]цам|Фессалоники[ий]цам)))|2(?:[ея]\.[\s\xa0]*Фессалоники(?:[ий]цам)|-?[яе]\.[\s\xa0]*Фессалоники(?:[ий]цам))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Thess"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фес(?:салоники[ий]цам)?)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам)|Thess|[яе](?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[ий]цам|Фессалоники[ий]цам)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам)))|-?[яе](?:[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[йи]цам|Фессалоники[ий]цам)|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам))))|1(?:-?[яе](?:[\s\xa0]*Фессалоники(?:[ий]цам|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам)))|[яе](?:[\s\xa0]*Фессалоники(?:[ий]цам|\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники[йи]цам|Фессалоники[ий]цам))))|1(?:-?[ея]\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[йи]цам|Фессалоники[ий]цам))|[яе]\.[\s\xa0]*(?:к[\s\xa0]*Фессалоники(?:[йи]цам|Фессалоники[ий]цам)))|1(?:[яе]\.[\s\xa0]*Фессалоники(?:[ий]цам)|-?[ея]\.[\s\xa0]*Фессалоники(?:[ий]цам))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Tim"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:Tim|\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тим(?:офею)?)|(?:[яе](?:\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)))|-?(?:[ея](?:\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Tim"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:Tim|\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тим(?:офею)?)|(?:[яе](?:\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)))|-?(?:[яе](?:\.[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею)|[\s\xa0]*(?:к[\s\xa0]*Тимофею|Тимофею))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Titus"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Titus|Послание[\s\xa0]*к[\s\xa0]*Титу|К[\s\xa0]*Титу|Титу?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phlm"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*к[\s\xa0]*Филимону|К[\s\xa0]*Филимону|Ф(?:лм|илимону)|Phlm)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Heb"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Heb|Евр(?:еям)?|К[\s\xa0]*Евреям|Послание[\s\xa0]*к[\s\xa0]*Евреям)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jas"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*Иакова|Jas|Иак(?:ова)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Pet"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		2(?:[\s\xa0]*(?:Пет(?:ра)?|послание[\s\xa0]*Петра)|-?(?:[ея](?:[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)))|(?:[яе](?:[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)))|Pet|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Pet"]
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		1(?:[\s\xa0]*(?:Пет(?:ра)?|послание[\s\xa0]*Петра)|-?(?:[ея](?:[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)))|(?:[ея](?:[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра)))|Pet|\.[\s\xa0]*(?:Петра|послание[\s\xa0]*Петра))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jude"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Jude|Послание[\s\xa0]*Иуды|Иуд[аы]?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Tob"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Tob|Тов(?:ита)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jdt"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Jdt|Юди(?:фь)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Вар(?:уха)?|Bar|Бару́ха|Книга[\s\xa0]*(?:Варуха|пророка[\s\xa0]*Вару́ха))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sus"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Sus|С(?:казанию[\s\xa0]*о[\s\xa0]*Сусанне[\s\xa0]*и[\s\xa0]*Данииле|усанна(?:[\s\xa0]*и[\s\xa0]*старцы)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:2(?:-?(?:[ея](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|(?:[ея](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|\.[\s\xa0]*Маккавеев|Macc|[\s\xa0]*Макк(?:авеев)?)|Вторая[\s\xa0]*книга[\s\xa0]*Маккаве[ий]ская)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:3(?:-?(?:[ея](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|(?:[яе](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|\.[\s\xa0]*Маккавеев|Macc|[\s\xa0]*Макк(?:авеев)?)|Третья[\s\xa0]*книга[\s\xa0]*Маккаве[йи]ская)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["4Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		4(?:-?(?:[ея](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|(?:[яе](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|\.[\s\xa0]*Маккавеев|Macc|[\s\xa0]*Макк(?:авеев)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zЀ-ҁ҃-҇Ҋ-ԧⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟ])(
		(?:1(?:-?(?:[яе](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|(?:[ея](?:\.[\s\xa0]*Маккавеев|[\s\xa0]*Маккавеев))|\.[\s\xa0]*Маккавеев|Macc|[\s\xa0]*Макк(?:авеев)?)|Первая[\s\xa0]*книга[\s\xa0]*Маккаве[ий]ская)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	]
	# Short-circuit the look if we know we want all the books.
	return books if include_apocrypha is true and case_sensitive is "none"
	# Filter out books in the Apocrypha if we don't want them. `Array.map` isn't supported below IE9.
	out = []
	for book in books
		continue if book.apocrypha? and book.apocrypha is true
		if case_sensitive is "books"
			book.regexp = new RegExp book.regexp.source, "g"
		out.push book
	out

# Default to not using the Apocrypha
bcv_parser::regexps.books = bcv_parser::regexps.get_books false, "none"