bcv_parser::regexps.space = "[\\s\\xa0]"
bcv_parser::regexps.escaped_passage = ///
	(?:^ | [^\x1f\x1e\dA-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ] )	# Beginning of string or not in the middle of a word or immediately following another book. Only count a book if it's part of a sequence: `Matt5John3` is OK, but not `1Matt5John3`
		(
			# Start inverted book/chapter (cb)
			(?:
				  (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s* (?: [\u2013\u2014\-] | through | thru | to) \s* \d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: \d+ (?: th | nd | st ) \s*
					ch (?: apter | a?pt\.? | a?p?\.? )? \s* #no plurals here since it's a single chapter
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )? \s* )
			)? # End inverted book/chapter (cb)
			\x1f(\d+)(?:/\d+)?\x1f		#book
				(?:
				    /\d+\x1f				#special Psalm chapters
				  | [\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014]
				  | title (?! [a-z] )		#could be followed by a number
				  | розділ | глави | глава | вірші | розд | вірш | гл | ff | - | і
				  | [aаб] (?! \w )			#a-e allows 1:1a
				  | $						#or the end of the string
				 )+
		)
	///gi
# These are the only valid ways to end a potential passage match. The closing parenthesis allows for fully capturing parentheses surrounding translations (ESV**)**. The last one, `[\d\x1f]` needs not to be +; otherwise `Gen5ff` becomes `\x1f0\x1f5ff`, and `adjust_regexp_end` matches the `\x1f5` and incorrectly dangles the ff.
bcv_parser::regexps.match_end_split = ///
	  \d \W* title
	| \d \W* ff (?: [\s\xa0*]* \.)?
	| \d [\s\xa0*]* [aаб] (?! \w )
	| \x1e (?: [\s\xa0*]* [)\]\uff09] )? #ff09 is a full-width closing parenthesis
	| [\d\x1f]
	///gi
bcv_parser::regexps.control = /[\x1e\x1f]/g
bcv_parser::regexps.pre_book = "[^A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ]"

bcv_parser::regexps.first = "(?:Перша|Перше|1-ше|1-[ае]|1|I)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.second = "(?:Друга|Друге|2-ге|2-[ае]|2|II)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.third = "(?:Третя|Третє|3-тє|3-[ае]|3|III)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.range_and = "(?:[&\u2013\u2014-]|і|-)"
bcv_parser::regexps.range_only = "(?:[\u2013\u2014-]|-)"
# Each book regexp should return two parenthesized objects: an optional preliminary character and the book itself.
bcv_parser::regexps.get_books = (include_apocrypha, case_sensitive) ->
	books = [
		osis: ["Ps"]
		apocrypha: true
		extra: "2"
		regexp: ///(\b)( # Don't match a preceding \d like usual because we only want to match a valid OSIS, which will never have a preceding digit.
			Ps151
			# Always follwed by ".1"; the regular Psalms parser can handle `Ps151` on its own.
			)(?=\.1)///g # Case-sensitive because we only want to match a valid OSIS.
	,
		osis: ["Gen"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|ше(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М)|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева)|Бу(?:ття|г)|Gen|Buttja|Бут|Перш[ае][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|I(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Exod"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|ге(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М)|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева)|Друг[ае][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|Вихід|Exod|Vy[hȟ]id|Вих|II(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bel"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Бел(?:[\s\xa0]*і[\s\xa0]*дракон)?|Bel)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lev"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:3(?:\-?(?:[ае](?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])|тє(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий]))сеева|[\s\xa0]*(?:книга[\s\xa0]*Мо[ий]сеева|М)|\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева)|Трет[яє][\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|Levyt|Левит|Lev|III(?:\.[\s\xa0]*книга[\s\xa0]*Мо[ий]|[\s\xa0]*книга[\s\xa0]*Мо[ий])сеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Num"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:4[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|[CČ]ysla|Num|4[\s\xa0]*М|IV[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|(?:IV|4)\.[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|Ч(?:етверта[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева|ис(?:ла)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sir"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:(?:Книга[\s\xa0]*|Бен[\s\xa0]*)?Сираха|Еклесіаст|Sir|Сир|Премудрість[\s\xa0]*Ісуса,[\s\xa0]*сина[\s\xa0]*Сирахова)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Wis"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премудрість[\s\xa0]*Соломона)|(?:Книга[\s\xa0]*(?:Премудрості[\s\xa0]*Соломона|Мудрости)|Мудрости|Прем|Wis|Муд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lam"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Плач[\s\xa0]*Єремі[ії]|Lam|Плач|Pla[cč][\s\xa0]*Jeremi[i\xEF])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["EpJer"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Лист[\s\xa0]*Єремі[ії]|EpJer|Послання[\s\xa0]*Єремі[ії])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:О(?:б['’]явлення[\s\xa0]*(?:св(?:\.[\s\xa0]*(?:[ИЙ]о|Ів)|[\s\xa0]*(?:[ИЙ]о|Ів))|Ів)ана[\s\xa0]*Богослова|дкр(?:овення[\s\xa0]*Івана[\s\xa0]*Богослова|иттє))|Апок(?:а(?:л[i\xEDі]|́лі)|[a\xE1]лі)псис|Rev|Ob['’]javlennja[\s\xa0]*Ivana[\s\xa0]*Bohoslova|Відкриття[\s\xa0]*Івана)|(?:Об(?:['’]явлення)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrMan"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:PrMan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Deut"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:П(?:овт(?:(?:орення|\.)?[\s\xa0]*Закону)?|['’]ята[\s\xa0]*книга[\s\xa0]*Мо[ий]сеева)|Второзаконня|Deut|5[\s\xa0]*М|Povtorennja[\s\xa0]*Zakonu|Втор)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Josh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:І(?:сус[\s\xa0]*Навин|\.?[\s\xa0]*Нав)|Isus[\s\xa0]*Navyn|Josh|Нав|Єгошу[ії]|Єг|Ісуса[\s\xa0]*Навина|Книга[\s\xa0]*(?:Ісуса[\s\xa0]*Навина|Єгошу[ії]))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Judg"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Суддів|Суддів|Judg|Суд|Knyha[\s\xa0]*Suddiv)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ruth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ruth?|Рут|Книга[\s\xa0]*Рут)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи])|ше(?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи]))|[\s\xa0]*Ездр[аи]|[\s\xa0]*Езд|Esd|\.[\s\xa0]*Ездр[аи])|I(?:\.[\s\xa0]*Ездр[аи]|[\s\xa0]*Ездр[аи])|Перш[ае][\s\xa0]*Ездр[аи])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи]))|ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])))|[\s\xa0]*Ездр[аи]|Esd|[\s\xa0]*Езд|[\s\xa0]*книга[\s\xa0]*Ездри|\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи]))|II(?:\.[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи])|[\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи]))|Друг[ае][\s\xa0]*(?:книга[\s\xa0]*Ездри|Ездр[аи]))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Isa"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*Іса[ії]|Іса[ий][ії])|Іса[яії]|Isaja|Isa|Іс)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|ге(?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії]))|\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|II(?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|Друг[ае][\s\xa0]*Саму[ії])лова)|(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|ге(?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)))|[\s\xa0]*Саму[ії]л|Sam|[\s\xa0]*Samu[i\xEF]l|[\s\xa0]*Сам|[\s\xa0]*книга[\s\xa0]*Саму[ії]лова|\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|II(?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|Друг[ае][\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|ше(?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії]))|\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|I(?:\.[\s\xa0]*Саму[ії]|[\s\xa0]*Саму[ії])|Перш[ае][\s\xa0]*Саму[ії])лова)|(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|ше(?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)))|[\s\xa0]*Саму[ії]л|Sam|[\s\xa0]*Samu[i\xEF]l|[\s\xa0]*Сам|[\s\xa0]*книга[\s\xa0]*Саму[ії]лова|\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|I(?:\.[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова)|[\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))|Перш[ае][\s\xa0]*(?:Samu[i\xEF]l|Саму[ії]л|книга[\s\xa0]*Саму[ії]лова))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2[\s\xa0]*царів)|(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів))|ге(?:\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)))|\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*Цар|Kgs|[\s\xa0]*Cariv|[\s\xa0]*книга[\s\xa0]*царів)|II(?:\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів))|Друг[ае][\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|(?:Четверта|4\.?|IV\.?)[\s\xa0]*Царів)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1[\s\xa0]*царів)|(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів))|ше(?:\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)))|\.[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|[\s\xa0]*Цар|Kgs|[\s\xa0]*Cariv|[\s\xa0]*книга[\s\xa0]*царів)|(?:3\-?(?:[ае]|тє)\.?|Трет[яє]|3\.|3|III\.?)[\s\xa0]*Царів|I[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів)|(?:Перш[ае]|I\.)[\s\xa0]*(?:Cariv|царів|книга[\s\xa0]*царів))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|ге(?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)))|[\s\xa0]*хроніки|Chr|[\s\xa0]*Хроніка|[\s\xa0]*[HȞ]roniky|[\s\xa0]*Літопису|[\s\xa0]*Хр(?:онік)?|[\s\xa0]*книга[\s\xa0]*хроніки?|\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|II(?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|Друг[ае][\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|ше(?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)))|[\s\xa0]*хроніки|Chr|[\s\xa0]*Хроніка|[\s\xa0]*[HȞ]roniky|[\s\xa0]*Літопису|[\s\xa0]*Хр(?:онік)?|[\s\xa0]*книга[\s\xa0]*хроніки?|\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|I(?:\.[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?)|[\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))|Перш[ае][\s\xa0]*(?:Хроніка|хроніки|[HȞ]roniky|Літопису|Хронік|книга[\s\xa0]*хроніки?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Єздри)|(?:Ездр[аи]|Єзд|Ezd?ra|Езд|Книга[\s\xa0]*Ездри)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Neh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Неємі[ії])|(?:Не(?:емі[яії]|єм)|Ne(?:emija|h)|Неем|Книга[\s\xa0]*Неемі[ії])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["GkEsth"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:GkEsth)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Esth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Естер)|(?:Est(?:er|h)|Ест|Есфір|Книга[\s\xa0]*Ес(?:те|фі)р)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Job"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:[ИЙ]ова|Jo[bv]|[ИЙ]ов|Іова|Книга[\s\xa0]*[ІИЙ]ова)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ps"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Псалмів)|(?:Псал(?:ти́р|ми)|Psalmy|Ps|Пс|Книга[\s\xa0]*Псалмів)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrAzar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Молитва[\s\xa0]*Азарі[ії]|PrAzar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Prov"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Приповісте[ий][\s\xa0]*соломонових)|(?:При(?:пові(?:ст(?:е[ий]|і)|док)|каз(?:ки|ок)|тчі[\s\xa0]*Соломона)|Pr(?:ypovisti|ov)|Пр(?:итчі?)?|Книга[\s\xa0]*При(?:повісте[ий]|казок)[\s\xa0]*Соломонових)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eccl"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Екк?лезіястова)|(?:E(?:kklezijast|ccl)|Ек(?:клезіяста|л)|Еккл(?:езіяст)?|Проповідника|К(?:нига[\s\xa0]*Екк?лезіястова|оге́лет))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["SgThree"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пісня[\s\xa0]*трьох[\s\xa0]*отроків|SgThree)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Song"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пісня[\s\xa0]*над[\s\xa0]*піснями[\s\xa0]*Соломона)|(?:П(?:існ(?:я[\s\xa0]*(?:над[\s\xa0]*піснями|Пісне[ий])|і[\s\xa0]*Пісень)|\.?[\s\xa0]*П)|Song|Pisnja[\s\xa0]*nad[\s\xa0]*pisnjamy|Пісн|Книга[\s\xa0]*Пісні[\s\xa0]*Пісень[\s\xa0]*Соломона)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jer"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Єремі[яії]|Jeremija|Jer|Єр|Книга[\s\xa0]*пророка[\s\xa0]*Єремі[ії])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Єзекі[ії]л[аья]|Ezek|Jezeki[i\xEF]l['’]|Єз|Книга[\s\xa0]*пророка[\s\xa0]*Єзекі[ії]ля)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Dan"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Dany[i\xEF]l|Дани[ії]ла|Дан(?:и[ії]л)?|Dan|Книга[\s\xa0]*пророка[\s\xa0]*Дани[ії]ла)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*пророка[\s\xa0]*Осі[ії]|Осі[яії]|Hos|Osija|Ос)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Joel"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:[ИЙ]о(?:і(?:ла|н)|ї[лн])|Jo[ei\xEF]l|[ИЙ]оіл|Книга[\s\xa0]*(?:пророка[\s\xa0]*[ИЙ]|[ИЙ])оіла)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Amos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Амоса|Amos|Ам(?:ос)?|Книга[\s\xa0]*пророка[\s\xa0]*Амоса)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:O(?:vdij|bad)|Овді[ийя]|Овд?|Авдія|Книга[\s\xa0]*пророка[\s\xa0]*[АО]вдія)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jonah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:[ИЙ]он[аи]|Jonah|Jona|Книга[\s\xa0]*пророка[\s\xa0]*[ИЙ]они)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mic"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Міхея)|(?:М(?:ихе[ийя]|іх)|M(?:y[hȟ]ej|ic)|Мих|Книга[\s\xa0]*пророка[\s\xa0]*М[иі]хея)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Nah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Na(?:um|h)|Наума|Наум|Книга[\s\xa0]*пророка[\s\xa0]*Наума)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Avakum|Hab|Авакума|Ав(?:акум)?|Книга[\s\xa0]*пророка[\s\xa0]*Авакума)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zeph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Софоні[яії]|Zeph|Sofonija|Соф|Книга[\s\xa0]*пророка[\s\xa0]*Софоні[ії])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hag"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Огі[ийя]|Hag|Ohij|Ог|Аггея|Книга[\s\xa0]*(?:пророка[\s\xa0]*)?Огія)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zech"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Z(?:a[hȟ]arij|ech)|Захарі[ийяії]|Зах|Книга[\s\xa0]*(?:пророка[\s\xa0]*Захарія|Захарі[ії]))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:пророка[\s\xa0]*Малахі[ії]|Малахі[ії])|Mala[hȟ]ija|Малахі[яії]|Mal|Мал)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Matt"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Матвія)|(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:Мат(?:ві|е)|св\.?[\s\xa0]*Матві)|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Матві)я|Jevanhelije[\s\xa0]*vid[\s\xa0]*Matvija|М(?:ате[ий]|т)|Matt|Мат|Від[\s\xa0]*Матвія)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2[\s\xa0]*Макаве[ії]в)|(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|ге(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Ма?к|Macc)|(?:II(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|Друг[ае][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))в)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:3[\s\xa0]*Макаве[ії]в)|(?:3(?:\-?(?:[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|тє(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Ма?к|Macc)|(?:III(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|Трет[яє][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))в)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["4Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:4[\s\xa0]*Макаве[ії]в)|(?:IV[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|4(?:[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Ма?к|Macc)|(?:IV|4)\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|Четверта[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1[\s\xa0]*Макаве[ії]в)|(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|ше(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])))в|\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])в|[\s\xa0]*книга[\s\xa0]*Макаве[ії]в|[\s\xa0]*Ма?к|Macc)|(?:I(?:\.[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії])|[\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))|Перш[ае][\s\xa0]*(?:книга[\s\xa0]*Макаве[ії]|Макаве[ії]))в)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mark"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:М(?:арк[ао]|[кр])|Mark|Jevanhelije[\s\xa0]*vid[\s\xa0]*Marka|Від[\s\xa0]*Марка|Євангелі[яє][\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Марка)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Luke"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*Лу|Лу[\s\xa0]*?)|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Лу)ки|Jevanhelije[\s\xa0]*vid[\s\xa0]*Luky|Л(?:ук[аи]|к)|Luke|Від[\s\xa0]*Луки)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|ше(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)))|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|John|[\s\xa0]*Ів|[\s\xa0]*Іоанна|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|I(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|Перш[ае][\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|ге(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)))|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|John|[\s\xa0]*Ів|[\s\xa0]*Іоанна|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|II(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|Друг[ае][\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana|Послання[\s\xa0]*до[\s\xa0]*Тита)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:3(?:\-?(?:[ае](?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|тє(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)))|[\s\xa0]*(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[\s\xa0]*[ИЙ]оаново|John|[\s\xa0]*Ів|[\s\xa0]*Іоанна|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна|\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|III(?:\.[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|[\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна))|Трет[яє][\s\xa0]*(?:(?:послання[\s\xa0]*апостола[\s\xa0]*|Послання[\s\xa0]*)?Івана|[ИЙ]оаново|Іоанна|соборне[\s\xa0]*послання[\s\xa0]*св\.?[\s\xa0]*апостола[\s\xa0]*Іоанна)|Tretje[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Ivana)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["John"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Івана)|(?:Євангелі(?:є[\s\xa0]*від[\s\xa0]*(?:св(?:\.[\s\xa0]*[ИЙ]|[\s\xa0]*[ИЙ])о|Ів)|я[\s\xa0]*від[\s\xa0]*(?:св\.?[\s\xa0]*)?Ів)ана|J(?:evanhelije[\s\xa0]*vid[\s\xa0]*Ivana|ohn)|[ИЙ]оана|І[вн]|[ИЙ]оан|Від[\s\xa0]*Івана)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Acts"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ді(?:[ії][\s\xa0]*(?:святих[\s\xa0]*а|А)|яння[\s\xa0]*Святих[\s\xa0]*А)постолів|Acts|Ді(?:ян(?:ня)?|[ії])|Dijannja[\s\xa0]*svjaty[hȟ][\s\xa0]*apostoliv)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rom"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*rymljan|Римляни|Rom|Рим(?:лян)?|До[\s\xa0]*римлян|Послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*римлян)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:2(?:\-?(?:[ае]\.?|ге\.?)|\.)?|Друг[ае]|II\.?)[\s\xa0]*Коринтяни)|(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))|ге(?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)))ян|[\s\xa0]*(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринтян|Cor|[\s\xa0]*Коринфян|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринфян|\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)ян)|(?:II(?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))|Друг[ае][\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))ян|2[\s\xa0]*Кор|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*korynfjan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:1(?:\-?(?:[ае]\.?|ше\.?)|\.)?|Перш[ае]|I\.?)[\s\xa0]*Коринтяни)|(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))|ше(?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)))ян|[\s\xa0]*(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринтян|Cor|[\s\xa0]*Коринфян|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринфян|\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)ян)|(?:I(?:\.[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф)|[\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))|Перш[ае][\s\xa0]*(?:(?:Послання[\s\xa0]*до[\s\xa0]*К|(?:до[\s\xa0]*)?к)оринт|Коринф|послання[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*коринф))ян|1[\s\xa0]*Кор|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*korynfjan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Gal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Галатів)|(?:По(?:слання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*г|[\s\xa0]*слання[\s\xa0]*до[\s\xa0]*Г)алатів|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*halativ|Галатяни|Gal|Гал|До[\s\xa0]*галатів)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:По(?:слання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*|апостола[\s\xa0]*Павла[\s\xa0]*)?до[\s\xa0]*е|[\s\xa0]*слан[\s\xa0]*ня[\s\xa0]*до[\s\xa0]*Є)фесян|Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*efesjan|Ефесяни|Eph|Єф|Еф(?:есян)?|До[\s\xa0]*ефесян)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phil"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:св(?:\.[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’]|[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’])|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*филип['’]|до[\s\xa0]*(?:Філіп['’]|филип['’]))ян|P(?:oslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*fylyp['’]jan|hil)|Ф(?:илип['’]?яни|лп)|Фил)|(?:(?:До[\s\xa0]*филип['’]|Филип['’])ян)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Col"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Колоссян)|(?:Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*kolosjan|Колосяни|Col|Кол(?:осян)?|До[\s\xa0]*колоссян|Послання[\s\xa0]*(?:апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*к|до[\s\xa0]*К|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*к)олосян)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2[\s\xa0]*Солунян)|(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)))|[\s\xa0]*послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|[\s\xa0]*фессалонікі[ий]ців|[\s\xa0]*Солуньці|Thess|[\s\xa0]*Сол|[\s\xa0]*до[\s\xa0]*солунян|\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|Друг[ае][\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*solunjan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1[\s\xa0]*Солунян)|(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)))|[\s\xa0]*послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|[\s\xa0]*фессалонікі[ий]ців|[\s\xa0]*Солуньці|Thess|[\s\xa0]*Сол|[\s\xa0]*до[\s\xa0]*солунян|\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян))|Перш[ае][\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*(?:(?:фессалонікі[ий]|салонікі[ий])ців|солунян)|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*солунян)|фессалонікі[ий]ців|Солуньці|Солунян|до[\s\xa0]*солунян)|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*solunjan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))))|[\s\xa0]*послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|[\s\xa0]*Тимоте[ий]|Tim|[\s\xa0]*Тимофію|[\s\xa0]*Тим|[\s\xa0]*Ти\xADмофія|\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|Друг[ае][\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tymofija)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))))|[\s\xa0]*послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|[\s\xa0]*Тимоте[ий]|Tim|[\s\xa0]*Тимофію|[\s\xa0]*Тим|[\s\xa0]*Ти\xADмофія|\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|[\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія)))|Перш[ае][\s\xa0]*(?:послання[\s\xa0]*(?:до[\s\xa0]*Тимотея|Тимофію|до[\s\xa0]*Тимофія|апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимофія|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ти\xADмофія)|Ти(?:мо(?:те[ий]|фію)|\xADмофія))|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tymofija)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Titus"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Poslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Tyta|Titus|Тита|Тит|До[\s\xa0]*Тита|Послан(?:ня[\s\xa0]*(?:св\.?[\s\xa0]*)?апостола[\s\xa0]*Павла|[\s\xa0]*ня)[\s\xa0]*до[\s\xa0]*Тита)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phlm"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послання[\s\xa0]*(?:апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|до[\s\xa0]*Фили(?:пі[ий]ців|мона)|св\.?[\s\xa0]*апостола[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона)|P(?:oslannja[\s\xa0]*apostola[\s\xa0]*Pavla[\s\xa0]*do[\s\xa0]*Fylymona|hlm)|Ф(?:илимона|лм)|Филим(?:он)?|До[\s\xa0]*Филимона)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Heb"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послан(?:[\s\xa0]*ня[\s\xa0]*до[\s\xa0]*Євре[ії]|ня[\s\xa0]*до[\s\xa0]*євре[ії])в|Євре[ії]в|Heb|До[\s\xa0]*євре[ії]в|Євр(?:е[ії])?|Poslannja[\s\xa0]*do[\s\xa0]*jevre[i\xEF]v)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jas"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Poslannja[\s\xa0]*apostola[\s\xa0]*Jakova|Якова|Jas|Як(?:ов)?|Послання[\s\xa0]*Якова|Послання[\s\xa0]*апостола[\s\xa0]*Якова|Соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*)?Якова)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|ге(?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)))|[\s\xa0]*Петра|Pet|[\s\xa0]*Петрово|[\s\xa0]*Петр?|[\s\xa0]*послання[\s\xa0]*Петра|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Петра|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|II(?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|Друг[ае][\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|Druhe[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Petra)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:\-?(?:[ае](?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|ше(?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)))|[\s\xa0]*Петра|Pet|[\s\xa0]*Петрово|[\s\xa0]*Петр?|[\s\xa0]*послання[\s\xa0]*Петра|[\s\xa0]*послання[\s\xa0]*апостола[\s\xa0]*Петра|[\s\xa0]*соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра|\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|I(?:\.[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|[\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра))|Перш[ае][\s\xa0]*(?:послання[\s\xa0]*Петра|Петр(?:ово|а)|послання[\s\xa0]*апостола[\s\xa0]*Петра|соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*|апостола[\s\xa0]*)?Петра)|Per[sš]e[\s\xa0]*poslannja[\s\xa0]*apostola[\s\xa0]*Petra)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jude"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Poslannja[\s\xa0]*apostola[\s\xa0]*Judy|Юд[аи]|Іуд|Jude|Юд|Послання[\s\xa0]*(?:Іу|Ю)ди|Послання[\s\xa0]*апостола[\s\xa0]*Юди|Соборне[\s\xa0]*послання[\s\xa0]*(?:св\.?[\s\xa0]*апостола[\s\xa0]*)?Юди)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Tob"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Товита)|(?:Товит|Tob|Тов|Книга[\s\xa0]*Товита)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jdt"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Юдити|Юдити|Jdt)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Вар(?:уха)?|Bar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sus"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Сус(?:анна)?|Sus)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	]
	# Short-circuit the look if we know we want all the books.
	return books if include_apocrypha is true and case_sensitive is "none"
	# Filter out books in the Apocrypha if we don't want them. `Array.map` isn't supported below IE9.
	out = []
	for book in books
		continue if include_apocrypha is false and book.apocrypha? and book.apocrypha is true
		if case_sensitive is "books"
			book.regexp = new RegExp book.regexp.source, "g"
		out.push book
	out

# Default to not using the Apocrypha
bcv_parser::regexps.books = bcv_parser::regexps.get_books false, "none"
