bcv_parser::regexps.space = "[\\s\\xa0]"
bcv_parser::regexps.escaped_passage = ///
	(?:^ | [^\x1f\x1e\dA-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ] )	# Beginning of string or not in the middle of a word or immediately following another book. Only count a book if it's part of a sequence: `Matt5John3` is OK, but not `1Matt5John3`
		(
			# Start inverted book/chapter (cb)
			(?:
				  (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s* (?: [\u2013\u2014\-] | through | thru | to) \s* \d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: \d+ (?: th | nd | st ) \s*
					ch (?: apter | a?pt\.? | a?p?\.? )? \s* #no plurals here since it's a single chapter
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )? \s* )
			)? # End inverted book/chapter (cb)
			\x1f(\d+)(?:/\d+)?\x1f		#book
				(?:
				    /\d+\x1f				#special Psalm chapters
				  | [\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014]
				  | title (?! [a-z] )		#could be followed by a number
				  | и#{bcv_parser::regexps.space}+сл | глава | глави | verse | гл | - | и
				  | [aаб] (?! \w )			#a-e allows 1:1a
				  | $						#or the end of the string
				 )+
		)
	///gi
# These are the only valid ways to end a potential passage match. The closing parenthesis allows for fully capturing parentheses surrounding translations (ESV**)**.
bcv_parser::regexps.match_end_split = ///
	  \d+ \W* title
	| \d+ \W* и#{bcv_parser::regexps.space}+сл (?: [\s\xa0*]* \.)?
	| \d+ [\s\xa0*]* [aаб] (?! \w )
	| \x1e (?: [\s\xa0*]* [)\]\uff09] )? #ff09 is a full-width closing parenthesis
	| [\d\x1f]+
	///gi
bcv_parser::regexps.control = /[\x1e\x1f]/g
bcv_parser::regexps.pre_book = "[^A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ]"

bcv_parser::regexps.first = "(?:Първа|1|I)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.second = "(?:Втора|2|II)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.third = "(?:Трето|3|III)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.range_and = "(?:[&\u2013\u2014-]|и|-)"
bcv_parser::regexps.range_only = "(?:[\u2013\u2014-]|-)"
# Each book regexp should return two parenthesized objects: an optional preliminary character and the book itself.
bcv_parser::regexps.get_books = (include_apocrypha, case_sensitive) ->
	books = [
		osis: ["Ps"]
		apocrypha: true
		extra: "2"
		regexp: ///(\b)( # Don't match a preceding \d like usual because we only want to match a valid OSIS, which will never have a preceding digit.
			Ps151
			# Always follwed by ".1"; the regular Psalms parser can handle `Ps151` on its own.
			)(?=\.1)///g # Case-sensitive because we only want to match a valid OSIS.
	,
		osis: ["Gen"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Бит(?:ие)?|Първа[\s\xa0]*(?:Моисеева|книга[\s\xa0]*Моисеева)|(?:[1I](?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева))|Gen)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Exod"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Изх(?:од)?|Exod|Втора[\s\xa0]*(?:Моисеева|книга[\s\xa0]*Моисеева)|2(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева)|II(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bel"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Bel|Бел)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lev"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет(?:о[\s\xa0]*Моисеева|а[\s\xa0]*книга[\s\xa0]*Моисеева)|3(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева)|III(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева)|Lev|Лев(?:ит)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Num"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Ч(?:етвърта[\s\xa0]*(?:Моисеева|книга[\s\xa0]*Моисеева)|ис(?:ла)?)|IV(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева)|4(?:[\s\xa0]*Моисеева|\.[\s\xa0]*Моисеева)|Num)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sir"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премъдрост[\s\xa0]*на[\s\xa0]*Иисус,[\s\xa0]*син[\s\xa0]*Сирахов|Книга[\s\xa0]*(?:на[\s\xa0]*Сирах|Премъдрост[\s\xa0]*на[\s\xa0]*Иисуса,[\s\xa0]*син[\s\xa0]*Сирахов)|Sir|Сирахов)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Wis"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премъдрост(?:[\s\xa0]*Соломонова)?|Книга[\s\xa0]*(?:на[\s\xa0]*мъдростта|Премъдрост[\s\xa0]*Соломонова)|Wis)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lam"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:П(?:лач(?:ът[\s\xa0]*на[\s\xa0]*(?:Еремия|[ЙИ]еремия)|[\s\xa0]*(?:Еремиев|Иеремиев))?|\.[\s\xa0]*[ИЙ]ер|[\s\xa0]*[ЙИ]ер)|Книга[\s\xa0]*Плач[\s\xa0]*Иеремиев|Lam)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["EpJer"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*на[\s\xa0]*Иеремия|EpJer)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Откр(?:овение(?:[\s\xa0]*на[\s\xa0]*(?:св(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)|[ЙИ]оан)|то[\s\xa0]*на[\s\xa0]*[ИЙ]оан)?)?|Апокалипсис|Rev)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrMan"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		PrMan
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Deut"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Вт(?:орозак(?:оние)?)?|5[\s\xa0]*Моисеева|Deut|Пета[\s\xa0]*книга[\s\xa0]*Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Josh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Josh|И(?:\.[\s\xa0]*Н|исус[\s\xa0]*Навин|[\s\xa0]*Н|с(?:[\s\xa0]*Нав|\.[\s\xa0]*Нав|ус[\s\xa0]*Нави(?:ев|н)))|Книга[\s\xa0]*(?:на[\s\xa0]*Исус[\s\xa0]*Навиев|Иисус[\s\xa0]*Навин))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Judg"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:Съдии[\s\xa0]*Израилеви|на[\s\xa0]*съдиите)|Съд(?:ии(?:[\s\xa0]*Израилеви)?)?|Judg)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ruth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ruth|Книга[\s\xa0]*Рут|Рут)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първа[\s\xa0]*(?:Ездра|книга[\s\xa0]*на[\s\xa0]*Ездра)|I(?:[\s\xa0]*Ездра|\.[\s\xa0]*Ездра)|1(?:Esd|[\s\xa0]*Ездра|\.[\s\xa0]*Ездра))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втора[\s\xa0]*(?:Ездра|книга[\s\xa0]*на[\s\xa0]*Ездра)|II(?:[\s\xa0]*Ездра|\.[\s\xa0]*Ездра)|2(?:Esd|[\s\xa0]*Ездра|\.[\s\xa0]*Ездра))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Isa"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Исаия|Ис(?:а(?:ия|я))?|Isa)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втора[\s\xa0]*(?:Самуил|книга[\s\xa0]*(?:Царства|на[\s\xa0]*Самуил)|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|II(?:\.[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|2(?:\.[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|[\s\xa0]*(?:Самуил|Ц(?:ар(?:е|ства))?|Книга[\s\xa0]*на[\s\xa0]*царете)|Sam))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:I(?:\.[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|Първа[\s\xa0]*(?:Самуил|книга[\s\xa0]*(?:Царства|на[\s\xa0]*Самуил)|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|1(?:\.[\s\xa0]*(?:Самуил|Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|[\s\xa0]*(?:Самуил|Ц(?:ар(?:е|ства))?|Книга[\s\xa0]*на[\s\xa0]*царете)|Sam))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:IV(?:[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|\.[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|4(?:[\s\xa0]*(?:Ц(?:ар(?:е|ства))?|Книга[\s\xa0]*на[\s\xa0]*царете)|\.[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|2Kgs|Четвърта[\s\xa0]*(?:Цар(?:е|ства)|книга[\s\xa0]*(?:на[\s\xa0]*царете|Царства)|Книга[\s\xa0]*на[\s\xa0]*царете))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:3(?:[\s\xa0]*(?:Ц(?:ар(?:е|ства))?|Книга[\s\xa0]*на[\s\xa0]*царете)|\.[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|III(?:[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете)|\.[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|Трет(?:а[\s\xa0]*книга[\s\xa0]*(?:на[\s\xa0]*царете|Царства)|о[\s\xa0]*(?:Цар(?:е|ства)|Книга[\s\xa0]*на[\s\xa0]*царете))|1Kgs)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втора[\s\xa0]*(?:Лет(?:описи)?|книга[\s\xa0]*(?:на[\s\xa0]*летописите|Паралипоменон)|Книга[\s\xa0]*на[\s\xa0]*летописите)|II(?:[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|\.[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите))|2(?:[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|\.[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|Chr)|или[\s\xa0]*Втора[\s\xa0]*книга[\s\xa0]*Паралипоменон)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:I(?:[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|\.[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите))|или[\s\xa0]*Първа[\s\xa0]*книга[\s\xa0]*Паралипоменон|Първа[\s\xa0]*(?:Лет(?:описи)?|книга[\s\xa0]*(?:на[\s\xa0]*летописите|Паралипоменон)|Книга[\s\xa0]*на[\s\xa0]*летописите)|1(?:[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|\.[\s\xa0]*(?:Лет(?:описи)?|Книга[\s\xa0]*на[\s\xa0]*летописите)|Chr))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ezra|Езд(?:ра)?|Книга[\s\xa0]*на[\s\xa0]*Ездра)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Neh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Неем(?:ия)?|Книга[\s\xa0]*на[\s\xa0]*Неемия|Neh)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["GkEsth"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		GkEsth
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Esth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Esth|Ест(?:ир)?|Книга[\s\xa0]*Естир)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Job"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:[ЙИ]ов|Job|Книга[\s\xa0]*на[\s\xa0]*(?:Йов|Иова?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ps"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пс(?:ал(?:тир|ми|ом))?|Ps)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrAzar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		PrAzar
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Prov"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Притчи[\s\xa0]*Соломонови|Пр(?:итчи(?:[\s\xa0]*Соломонови)?)?|Prov)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eccl"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Екл(?:исиаста?|есиаст)?|Книга[\s\xa0]*на[\s\xa0]*Еклисиаста[\s\xa0]*или[\s\xa0]*Проповедника|Проповедника|Eccl)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["SgThree"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		SgThree
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Song"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Song|П(?:ес(?:ен[\s\xa0]*на[\s\xa0]*песните)?|[\s\xa0]*П|\.[\s\xa0]*П)|Книга[\s\xa0]*Песен[\s\xa0]*на[\s\xa0]*Песните,[\s\xa0]*от[\s\xa0]*Соломона)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jer"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ер(?:емия)?|(?:[ЙИ]ер(?:емия)?)|Jer|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*(?:Еремия|[ИЙ]еремия))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иез(?:екииля?)?|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*(?:Иезекииля|Езекиил)|Ezek|Йез(?:екиил)?|Езек(?:и(?:ил|л))?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Dan"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Даниила?|Дан(?:иила?|аил)?|Dan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Осия|Ос(?:ия)?|Hos)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Joel"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Иоиля?|Joel|Иоиля?|Йоил)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Amos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Amos|Ам(?:оса?)?|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Амоса?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Obad|Авд(?:и[йи])?|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Авди[йи])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jonah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Иона|Jonah|[ИЙ]она?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mic"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Мих(?:е[ий])?|Mic|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Михе[йи])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Nah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Наума?|Наума?|Nah)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Авакума?|Ав(?:ак(?:ума?)?)?|Hab)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zeph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Софония|Соф(?:они[ияй])?|Zeph)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hag"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Аг(?:е[ий])?|Hag|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Аге[ий])
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zech"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Zech|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Захария|Зах(?:ария)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Мал(?:ахия)?|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Малахия|Mal)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Matt"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:От[\s\xa0]*Матея(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?|Евангелие[\s\xa0]*от[\s\xa0]*Мате[ий]|Matt|Мат(?:е[ий])?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mark"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Mark|Марко?|Евангелие[\s\xa0]*от[\s\xa0]*Марко|От[\s\xa0]*Марка(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Luke"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Luke|Лука|От[\s\xa0]*Лука(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?|Евангелие[\s\xa0]*от[\s\xa0]*Лука)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:послание[\s\xa0]*на[\s\xa0]*[ЙИ]оан|съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)|\.[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)))|а[\s\xa0]*(?:[ИЙ]оан(?:ово)?))|I(?:\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ЙИ]оан(?:ово)?))|1(?:John|\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ИЙ]оан(?:ово)?)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:послание[\s\xa0]*на[\s\xa0]*[ИЙ]оан|съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)|\.[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)))|а[\s\xa0]*(?:[ИЙ]оан(?:ово)?))|2(?:John|\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ИЙ]оан(?:ово)?))|II(?:\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ЙИ]оан(?:ово)?)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:3(?:John|\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ИЙ]оан(?:ово)?))|Трето[\s\xa0]*(?:(?:[ЙИ]оан(?:ово)?)|послание[\s\xa0]*на[\s\xa0]*[ИЙ]оан|съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)|\.[\s\xa0]*ап(?:[\s\xa0]*Иоана[\s\xa0]*Богослова|\.[\s\xa0]*Иоана[\s\xa0]*Богослова)))|III(?:\.[\s\xa0]*(?:[ИЙ]оан(?:ово)?)|[\s\xa0]*(?:[ИЙ]оан(?:ово)?)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["John"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*[ЙИ]оан|От[\s\xa0]*Иоана(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?|John|[ЙИ]оан)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Acts"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Д(?:[\s\xa0]*А|\.[\s\xa0]*А|е(?:ла|ян(?:ия(?:[\s\xa0]*на[\s\xa0]*(?:апостолите|светите[\s\xa0]*Апостоли)|та[\s\xa0]*на[\s\xa0]*апостолите)?)?))|Acts|Апостол)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rom"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Rom|Рим(?:л(?:яни)?)?|Послание[\s\xa0]*(?:на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Римляни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Римляни)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Римляни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Римляни))|към[\s\xa0]*римляните)|римляните)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*послание[\s\xa0]*(?:към[\s\xa0]*коринтяните|на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни)|[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни)))|а[\s\xa0]*Кор(?:интяни(?:те)?)?)|2(?:\.[\s\xa0]*Кор(?:интяни(?:те)?)?|[\s\xa0]*Кор(?:интяни(?:те)?)?|Cor)|II(?:\.[\s\xa0]*Кор(?:интяни(?:те)?)?|[\s\xa0]*Кор(?:интяни(?:те)?)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*послание[\s\xa0]*(?:към[\s\xa0]*коринтяните|на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни)|[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни)))|а[\s\xa0]*Кор(?:интяни(?:те)?)?)|I(?:\.[\s\xa0]*Кор(?:интяни(?:те)?)?|[\s\xa0]*Кор(?:интяни(?:те)?)?)|1(?:\.[\s\xa0]*Кор(?:интяни(?:те)?)?|[\s\xa0]*Кор(?:интяни(?:те)?)?|Cor))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Gal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:към[\s\xa0]*галатяните|на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Галатяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Галатяни)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Галатяни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Галатяни)))|Гал(?:атяни(?:те)?)?|Gal)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Eph|Еф(?:есяни(?:те)?)?|Послание[\s\xa0]*(?:на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ефесяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ефесяни)|\.[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ефесяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ефесяни))|към[\s\xa0]*ефесяните))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phil"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Фил(?:ипяни(?:те)?)?|Phil|Послание[\s\xa0]*(?:към[\s\xa0]*филипяните|на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филипяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филипяни)|\.[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филипяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филипяни))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Col"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Col|Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Колосяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Колосяни)|[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Колосяни|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Колосяни))|към[\s\xa0]*колосяните)|Кол(?:осяни(?:те)?)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:II(?:[\s\xa0]*Сол(?:унци(?:те)?)?|\.[\s\xa0]*Сол(?:унци(?:те)?)?)|2(?:Thess|[\s\xa0]*Сол(?:унци(?:те)?)?|\.[\s\xa0]*Сол(?:унци(?:те)?)?)|Втор(?:о[\s\xa0]*послание[\s\xa0]*(?:към[\s\xa0]*солунците|на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни)))|а[\s\xa0]*Сол(?:унци(?:те)?)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:Thess|[\s\xa0]*Сол(?:унци(?:те)?)?|\.[\s\xa0]*Сол(?:унци(?:те)?)?)|I(?:[\s\xa0]*Сол(?:унци(?:те)?)?|\.[\s\xa0]*Сол(?:унци(?:те)?)?)|Първ(?:о[\s\xa0]*послание[\s\xa0]*(?:към[\s\xa0]*солунците|на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни)))|а[\s\xa0]*Сол(?:унци(?:те)?)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:а[\s\xa0]*Тим(?:оте[йи])?|о[\s\xa0]*послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея)|[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея))|към[\s\xa0]*Тимоте[ий]))|II(?:\.[\s\xa0]*Тим(?:оте[йи])?|[\s\xa0]*Тим(?:оте[йи])?)|2(?:Tim|\.[\s\xa0]*Тим(?:оте[йи])?|[\s\xa0]*Тим(?:оте[ий])?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:I(?:\.[\s\xa0]*Тим(?:оте[йи])?|[\s\xa0]*Тим(?:оте[йи])?)|Първ(?:а[\s\xa0]*Тим(?:оте[ий])?|о[\s\xa0]*послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея)|[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея))|към[\s\xa0]*Тимоте[ий]))|1(?:Tim|\.[\s\xa0]*Тим(?:оте[йи])?|[\s\xa0]*Тим(?:оте[йи])?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Titus"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Titus|Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тита|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тита)|[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тита|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тита))|към[\s\xa0]*Тит)|Тит)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phlm"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Филим(?:он)?|Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона)|[\s\xa0]*ап(?:[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона))|към[\s\xa0]*Филимон)|Phlm)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Heb"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Heb|Евр(?:еи(?:те)?)?|Послание[\s\xa0]*(?:към[\s\xa0]*евреите|на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Евреите|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Евреите)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Евреите|[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Евреите))))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jas"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*на[\s\xa0]*Яков|Як(?:ов)?|Jas|Съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Иакова|[\s\xa0]*Иакова)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Иакова|[\s\xa0]*Иакова)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Петра|[\s\xa0]*Петра)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Петра|[\s\xa0]*Петра))|послание[\s\xa0]*на[\s\xa0]*Петър)|а[\s\xa0]*Пет(?:р(?:ово)?|ър)?)|2(?:[\s\xa0]*Пет(?:р(?:ово)?|ър)?|\.[\s\xa0]*Пет(?:р(?:ово)?|ър)?|Pet)|II(?:[\s\xa0]*Пет(?:р(?:ово)?|ър)?|\.[\s\xa0]*Пет(?:р(?:ово)?|ър)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:\.[\s\xa0]*Петра|[\s\xa0]*Петра)|\.[\s\xa0]*ап(?:\.[\s\xa0]*Петра|[\s\xa0]*Петра))|послание[\s\xa0]*на[\s\xa0]*Петър)|а[\s\xa0]*Пет(?:р(?:ово)?|ър)?)|1(?:[\s\xa0]*Пет(?:р(?:ово)?|ър)?|\.[\s\xa0]*Пет(?:р(?:ово)?|ър)?|Pet)|I(?:[\s\xa0]*Пет(?:р(?:ово)?|ър)?|\.[\s\xa0]*Пет(?:р(?:ово)?|ър)?))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jude"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:[\s\xa0]*ап(?:[\s\xa0]*Иуда|\.[\s\xa0]*Иуда)|\.[\s\xa0]*ап(?:[\s\xa0]*Иуда|\.[\s\xa0]*Иуда))|Jude|Послание[\s\xa0]*на[\s\xa0]*Юда|Юда)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Tob"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:на[\s\xa0]*Товита?|за[\s\xa0]*Тобия)|То(?:бия|вита?)|Tob)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jdt"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Иудит|Jdt|Книга[\s\xa0]*(?:Иудит|за[\s\xa0]*Юдита))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Варуха?|Книга[\s\xa0]*на[\s\xa0]*(?:Барух|пророк[\s\xa0]*Варуха)|Bar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sus"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Сус|Sus)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:Macc|[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|Втора[\s\xa0]*(?:книга[\s\xa0]*(?:Макаве[ий]ска|на[\s\xa0]*Макавеите)|Макавеи)|II(?:[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет(?:о[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*Макавеите|Макавеи)|а[\s\xa0]*книга[\s\xa0]*Макаве[йи]ска)|3(?:Macc|[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|III(?:[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["4Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:IV(?:[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|4(?:Macc|[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|Четвърта[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*Макавеите|Макавеи))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:Macc|[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|I(?:[\s\xa0]*Макавеи|\.[\s\xa0]*Макавеи)|Първа[\s\xa0]*(?:книга[\s\xa0]*(?:Макаве[ий]ска|на[\s\xa0]*Макавеите)|Макавеи))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek", "Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		Ез
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab", "Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		Ав
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)（）\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	]
	# Short-circuit the look if we know we want all the books.
	return books if include_apocrypha is true and case_sensitive is "none"
	# Filter out books in the Apocrypha if we don't want them. `Array.map` isn't supported below IE9.
	out = []
	for book in books
		continue if book.apocrypha? and book.apocrypha is true
		if case_sensitive is "books"
			book.regexp = new RegExp book.regexp.source, "g"
		out.push book
	out

# Default to not using the Apocrypha
bcv_parser::regexps.books = bcv_parser::regexps.get_books false, "none"