bcv_parser::regexps.space = "[\\s\\xa0]"
bcv_parser::regexps.escaped_passage = ///
	(?:^ | [^\x1f\x1e\dA-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ] )	# Beginning of string or not in the middle of a word or immediately following another book. Only count a book if it's part of a sequence: `Matt5John3` is OK, but not `1Matt5John3`
		(
			# Start inverted book/chapter (cb)
			(?:
				  (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s* (?: [\u2013\u2014\-] | through | thru | to) \s* \d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: ch (?: apters? | a?pts?\.? | a?p?s?\.? )? \s*
					\d+ \s*
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )?\s* )
				| (?: \d+ (?: th | nd | st ) \s*
					ch (?: apter | a?pt\.? | a?p?\.? )? \s* #no plurals here since it's a single chapter
					(?: from | of | in ) (?: \s+ the \s+ book \s+ of )? \s* )
			)? # End inverted book/chapter (cb)
			\x1f(\d+)(?:/\d+)?\x1f		#book
				(?:
				    /\d+\x1f				#special Psalm chapters
				  | [\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014]
				  | title (?! [a-z] )		#could be followed by a number
				  | и#{bcv_parser::regexps.space}+сл | глава | глави | гл | ст | - | и
				  | [aавб] (?! \w )			#a-e allows 1:1a
				  | $						#or the end of the string
				 )+
		)
	///gi
# These are the only valid ways to end a potential passage match. The closing parenthesis allows for fully capturing parentheses surrounding translations (ESV**)**. The last one, `[\d\x1f]` needs not to be +; otherwise `Gen5ff` becomes `\x1f0\x1f5ff`, and `adjust_regexp_end` matches the `\x1f5` and incorrectly dangles the ff.
bcv_parser::regexps.match_end_split = ///
	  \d \W* title
	| \d \W* и#{bcv_parser::regexps.space}+сл (?: [\s\xa0*]* \.)?
	| \d [\s\xa0*]* [aавб] (?! \w )
	| \x1e (?: [\s\xa0*]* [)\]\uff09] )? #ff09 is a full-width closing parenthesis
	| [\d\x1f]
	///gi
bcv_parser::regexps.control = /[\x1e\x1f]/g
bcv_parser::regexps.pre_book = "[^A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ]"

bcv_parser::regexps.first = "(?:Първа|Първо|1|I)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.second = "(?:Втора|Второ|2|II)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.third = "(?:Трета|Трето|3|III)\\.?#{bcv_parser::regexps.space}*"
bcv_parser::regexps.range_and = "(?:[&\u2013\u2014-]|и|-)"
bcv_parser::regexps.range_only = "(?:[\u2013\u2014-]|-)"
# Each book regexp should return two parenthesized objects: an optional preliminary character and the book itself.
bcv_parser::regexps.get_books = (include_apocrypha, case_sensitive) ->
	books = [
		osis: ["Ps"]
		apocrypha: true
		extra: "2"
		regexp: ///(\b)( # Don't match a preceding \d like usual because we only want to match a valid OSIS, which will never have a preceding digit.
			Ps151
			# Always follwed by ".1"; the regular Psalms parser can handle `Ps151` on its own.
			)(?=\.1)///g # Case-sensitive because we only want to match a valid OSIS.
	,
		osis: ["Gen"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:[1I][\s\xa0]*Моисеева|Битие|Gen|Бит|[1I]\.[\s\xa0]*Моисеева|Първ(?:а[\s\xa0]*(?:книга[\s\xa0]*)?|о[\s\xa0]*)Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Exod"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:II|2)[\s\xa0]*Моисеева|Изход|Exod|Изх|(?:II|2)\.[\s\xa0]*Моисеева|Втор(?:а[\s\xa0]*(?:книга[\s\xa0]*)?|о[\s\xa0]*)Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bel"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Вил(?:[\s\xa0]*и[\s\xa0]*змеят)?|Bel|Бел)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lev"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:III|3)[\s\xa0]*Моисеева|Левит|Lev|Лев|(?:III|3)\.[\s\xa0]*Моисеева|Трет(?:а[\s\xa0]*(?:книга[\s\xa0]*)?|о[\s\xa0]*)Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Num"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Ч(?:етвърт(?:а[\s\xa0]*(?:книга[\s\xa0]*)?|о[\s\xa0]*)Моисеева|ис(?:ла|л)?)|(?:IV|4)[\s\xa0]*Моисеева|Num|(?:IV|4)\.[\s\xa0]*Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sir"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Сирахов)|(?:Книга[\s\xa0]*(?:Премъдрост[\s\xa0]*на[\s\xa0]*Иисуса,[\s\xa0]*син[\s\xa0]*Сирахов|на[\s\xa0]*Сирах)|Премъдрост[\s\xa0]*на[\s\xa0]*Иисус,[\s\xa0]*син[\s\xa0]*Сирахов|Сирах|Sir|Сир)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Wis"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Премъдрост[\s\xa0]*Соломонова)|(?:Книга[\s\xa0]*(?:Премъдрост[\s\xa0]*Соломонов|на[\s\xa0]*мъдростт)а|Премъдрост[\s\xa0]*на[\s\xa0]*Соломон|Wis|Прем(?:ъдрост)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Lam"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Плач[\s\xa0]*(?:Ие|Е)ремиев)|(?:П(?:лач(?:ът[\s\xa0]*на[\s\xa0]*(?:[ИЙ]е|Е)ремия|[\s\xa0]*Иер)|(?:\.[\s\xa0]*[ИЙ]|[\s\xa0]*[ИЙ])ер)|Lam|Плач|Книга[\s\xa0]*Плач[\s\xa0]*Иеремиев)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["EpJer"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:По(?:с(?:лание[\s\xa0]*на[\s\xa0]*[ИЙ]еремия|(?:\.[\s\xa0]*[ИЙ]|[\s\xa0]*[ИЙ])ер)|ел\.?[\s\xa0]*Иер)|EpJer)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rev"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Отк(?:р(?:овение(?:[\s\xa0]*на[\s\xa0]*(?:св\.?[\s\xa0]*Иоана[\s\xa0]*Богослова|[ИЙ]оан)|то[\s\xa0]*на[\s\xa0]*[ИЙ]оан)?)?)?|Апокалипсис|Rev)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrMan"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:М(?:олитвата[\s\xa0]*на[\s\xa0]*Манасия|\.?[\s\xa0]*Ман|анасия)|PrMan)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Deut"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Второзаконие)|(?:Второзак|Deut|Вт(?:ор)?|5[\s\xa0]*Моисеева|Пета[\s\xa0]*книга[\s\xa0]*Моисеева)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Josh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:И(?:(?:\.[\s\xa0]?|[\s\xa0])Н|сус[\s\xa0]*Навин)|Josh|Иисус[\s\xa0]*Навин|И(?:с(?:ус[\s\xa0]*Навие|[\s\xa0]*На|\.[\s\xa0]*На)|ис\.?[\s\xa0]*На)в|Книга[\s\xa0]*(?:на[\s\xa0]*Исус[\s\xa0]*Навиев|Иисус[\s\xa0]*Навин))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Judg"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Съдии[\s\xa0]*Израилеви)|(?:Съдии)|(?:Книга[\s\xa0]*(?:Съдии[\s\xa0]*Израилеви|на[\s\xa0]*съдиите)|Judg|Съд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ruth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*Рут|Ruth|Рут)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:1(?:[\s\xa0]*Ездра|Esd|[\s\xa0]*Ездр?)|I[\s\xa0]*Ездра|[1I]\.[\s\xa0]*Ездра|Първ(?:а[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*)?|о[\s\xa0]*)Ездра)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Esd"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:2(?:[\s\xa0]*Ездра|Esd)|3[\s\xa0]*Ездра|2[\s\xa0]*Ездр?|3[\s\xa0]*Ездр|III?[\s\xa0]*Ездра|(?:(?:III?|[23])\.|Трет[ао])[\s\xa0]*Ездра|Втор(?:а[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*)?|о[\s\xa0]*)Ездра)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Isa"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Исаия)|(?:Исая)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Исаия|Isa|Ис)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:(?:II|2)\.|II)[\s\xa0]*Цар(?:ства|е)|2(?:[\s\xa0]*Цар(?:ства|е)|Sam)|(?:(?:II|2)\.|II|2)[\s\xa0]*Самуил|(?:(?:II|2)\.|II)[\s\xa0]*Цар(?:ств)?|2[\s\xa0]*Ц(?:ар(?:ств)?)?|(?:(?:II|2)\.|II|2)[\s\xa0]*Книга[\s\xa0]*на[\s\xa0]*царете|Втор(?:а[\s\xa0]*(?:книга[\s\xa0]*(?:на[\s\xa0]*Самуил|Царства)|Цар(?:ства|е)|Самуил|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)|о[\s\xa0]*(?:Цар(?:ства|е)|Самуил|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Sam"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:[1I]\.|I)[\s\xa0]*Цар(?:ства|е)|1(?:[\s\xa0]*Цар(?:ства|е)|Sam)|(?:[1I]\.|[1I])[\s\xa0]*Самуил|(?:[1I]\.|I)[\s\xa0]*Цар(?:ств)?|1[\s\xa0]*Ц(?:ар(?:ств)?)?|(?:[1I]\.|[1I])[\s\xa0]*Книга[\s\xa0]*на[\s\xa0]*царете|Първ(?:а[\s\xa0]*(?:книга[\s\xa0]*(?:на[\s\xa0]*Самуил|Царства)|Цар(?:ства|е)|Самуил|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)|о[\s\xa0]*(?:Цар(?:ства|е)|Самуил|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:(?:IV|4)\.|IV)[\s\xa0]*Цар(?:ства|е)|4[\s\xa0]*Цар(?:ства|е)|2Kgs|(?:(?:IV|4)\.|IV)[\s\xa0]*Цар(?:ств)?|4[\s\xa0]*Ц(?:ар(?:ств)?)?|(?:(?:IV|4)\.|IV|4)[\s\xa0]*Книга[\s\xa0]*на[\s\xa0]*царете|Четвърт(?:а[\s\xa0]*(?:Цар(?:ства|е)|книга[\s\xa0]*Царства|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)|о[\s\xa0]*(?:Цар(?:ства|е|ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)))|(?:Четвърта[\s\xa0]*книга[\s\xa0]*на[\s\xa0]*царете)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Kgs"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:(?:III|3)\.|III)[\s\xa0]*Цар(?:ства|е)|3[\s\xa0]*Цар(?:ства|е)|1Kgs|(?:(?:III|3)\.|III)[\s\xa0]*Цар(?:ств)?|3[\s\xa0]*Ц(?:ар(?:ств)?)?|(?:(?:III|3)\.|III|3)[\s\xa0]*Книга[\s\xa0]*на[\s\xa0]*царете|Трет(?:а[\s\xa0]*(?:Цар(?:ства|е)|книга[\s\xa0]*Царства|Цар(?:ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)|о[\s\xa0]*(?:Цар(?:ства|е|ств)?|Книга[\s\xa0]*на[\s\xa0]*царете)))|(?:Трета[\s\xa0]*книга[\s\xa0]*на[\s\xa0]*царете)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:II|2)[\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|2Chr|(?:II|2)\.[\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|Втор[ао][\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|(?:(?:II|2)\.|II|2|Втор[ао])[\s\xa0]*Лет|или[\s\xa0]*Втора[\s\xa0]*книга[\s\xa0]*Паралипоменон)|(?:Втора[\s\xa0]*книга[\s\xa0]*(?:Паралипоменон|на[\s\xa0]*летописите))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Chr"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:[1I][\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|1Chr|[1I]\.[\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|Първ[ао][\s\xa0]*(?:Книга[\s\xa0]*на[\s\xa0]*летописите|Летописи|Парал)|(?:[1I]\.|[1I]|Първ[ао])[\s\xa0]*Лет|или[\s\xa0]*Първа[\s\xa0]*книга[\s\xa0]*Паралипоменон)|(?:Първа[\s\xa0]*книга[\s\xa0]*(?:Паралипоменон|на[\s\xa0]*летописите))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ездра)|(?:Книга[\s\xa0]*на[\s\xa0]*Ездра|Ezra|Езд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Neh"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Неемия)|(?:Книга[\s\xa0]*на[\s\xa0]*Неемия|Неем|Neh)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["GkEsth"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Естир[\s\xa0]*\(според[\s\xa0]*Септуагинта\)|Ест\.?[\s\xa0]*Септ|GkEsth|Книга[\s\xa0]*Естир[\s\xa0]*\(според[\s\xa0]*Септуагинта\))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Esth"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Естир)|(?:Книга[\s\xa0]*Естир|Esth|Ест)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Job"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*(?:Иова?|Йов)|[ИЙ]ов|Job)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ps"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Пс(?:ал(?:ми|ом|тир))?|Ps)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["PrAzar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:М(?:олитвата[\s\xa0]*на[\s\xa0]*Азария|\.?[\s\xa0]*Аза)|PrAzar)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Prov"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Притчи[\s\xa0]*Соломонови)|(?:Книга[\s\xa0]*Притчи[\s\xa0]*Соломонови|Притчи|Prov|Пр(?:итч)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eccl"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Екл(?:исиаста|есиаст)|Eccl|Екл(?:исиаст)?|Проповедника|Книга[\s\xa0]*на[\s\xa0]*Еклисиаста[\s\xa0]*или[\s\xa0]*Проповедника)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["SgThree"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:П(?:есента[\s\xa0]*на[\s\xa0]*тримата[\s\xa0]*младежи|\.?[\s\xa0]*Мл)|SgThree)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Song"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:П(?:ес(?:ен[\s\xa0]*на[\s\xa0]*песните|\.?[\s\xa0]*на[\s\xa0]*песн)|\.?[\s\xa0]*П)|Song|Пес|Книга[\s\xa0]*Песен[\s\xa0]*на[\s\xa0]*Песните,[\s\xa0]*от[\s\xa0]*Соломона)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jer"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:(?:[ИЙ]е|Е)ремия|(?:[ИЙ]е|Е)р|Jer|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*(?:[ИЙ]е|Е)ремия)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Езекил|Ezek|Иезекииля|Езекиил|Йезекиил|Иез(?:екиил)?|Езек|Йез|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*(?:Иезекииля|Езекиил))
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Dan"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Даниила?)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Даниила?|Данаил|Dan|Дан)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Осия)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Осия|Hos|Ос)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Joel"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Иоиля?|Joel|Йоил|Иоиля?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Amos"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Амоса?)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Амоса?|Amos|Ам)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Авди[ий])|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Авди[ий]|Obad|Авд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jonah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:[ИЙ]она|Jonah|[ИЙ]он|Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Иона)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mic"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Михе[ий]|Михе[ий]|Mic|Мих)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Nah"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Наума?|Наума?|Nah)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ав(?:акума?|к))|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Авакума?|Авак|Hab|Ав)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zeph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Софония|Софони[ийя]|Zeph|Соф)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hag"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Аге[ий]|Аге[ий]|Hag|Аг)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Zech"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Захария)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Захария|Zech|Зах)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Малахия)|(?:Книга[\s\xa0]*на[\s\xa0]*пророк[\s\xa0]*Малахия|Mal|Мал)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Matt"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*Мате[ий]|Мате[ий]|Matt|Мт|Мат|От[\s\xa0]*Матея(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Mark"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*Марко|М(?:арко|к)|Mark|Марк|От[\s\xa0]*Марка(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Luke"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*Лука|Л(?:ука|к)|Luke|Лук|От[\s\xa0]*Лука(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Иоана[\s\xa0]*Богослова|послание[\s\xa0]*на[\s\xa0]*[ИЙ]оан|[ИЙ]оаново|[ИЙ]оан)|а[\s\xa0]*(?:[ИЙ]оаново|[ИЙ]оан))|1(?:[\s\xa0]*[ИЙ]н|John|[\s\xa0]*[ИЙ]оаново)|(?:[1I]\.[\s\xa0]*[ИЙ]|I[\s\xa0]*[ИЙ])оаново|(?:(?:[1I]\.[\s\xa0]*[ИЙ]|I[\s\xa0]*[ИЙ])о|1[\s\xa0]*[ИЙ]о)ан)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Иоана[\s\xa0]*Богослова|послание[\s\xa0]*на[\s\xa0]*[ИЙ]оан|[ИЙ]оаново|[ИЙ]оан)|а[\s\xa0]*(?:[ИЙ]оаново|[ИЙ]оан))|(?:(?:II|2)\.[\s\xa0]*[ИЙ]|II[\s\xa0]*[ИЙ])оаново|2(?:[\s\xa0]*[ИЙ]н|John|[\s\xa0]*[ИЙ]оаново)|(?:(?:(?:II|2)\.[\s\xa0]*[ИЙ]|II[\s\xa0]*[ИЙ])о|2[\s\xa0]*[ИЙ]о)ан)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3John"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Иоана[\s\xa0]*Богослова|послание[\s\xa0]*на[\s\xa0]*[ИЙ]оан|[ИЙ]оаново|[ИЙ]оан)|а[\s\xa0]*(?:[ИЙ]оаново|[ИЙ]оан))|(?:(?:III|3)\.[\s\xa0]*[ИЙ]|III[\s\xa0]*[ИЙ])оаново|3(?:[\s\xa0]*[ИЙ]н|John|[\s\xa0]*[ИЙ]оаново)|(?:(?:(?:III|3)\.[\s\xa0]*[ИЙ]|III[\s\xa0]*[ИЙ])о|3[\s\xa0]*[ИЙ]о)ан)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["John"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евангелие[\s\xa0]*от[\s\xa0]*[ИЙ]оан|[ИЙ]н|John|[ИЙ]оан|От[\s\xa0]*Иоана(?:[\s\xa0]*свето[\s\xa0]*Евангелие)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Acts"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Д(?:е(?:ян(?:ия(?:[\s\xa0]*на[\s\xa0]*(?:светите[\s\xa0]*Апостоли|апостолите)|та[\s\xa0]*на[\s\xa0]*апостолите)?)?|ла)|\.?[\s\xa0]*А)|Апостол|Acts)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Rom"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:римляните)|(?:Римляни)|(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Римляни|към[\s\xa0]*римляните)|Римл|Rom|Рим)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|към[\s\xa0]*коринтяните)|Кор(?:интяните|интяни)?)|а[\s\xa0]*Кор(?:интяните|интяни)?)|(?:(?:II|2)\.|II|2)[\s\xa0]*Коринтяните|2Cor|(?:(?:II|2)\.|II|2)[\s\xa0]*Кор(?:интяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Cor"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Коринтяни|към[\s\xa0]*коринтяните)|Кор(?:интяните|интяни)?)|а[\s\xa0]*Кор(?:интяните|интяни)?)|(?:[1I]\.|[1I])[\s\xa0]*Коринтяните|1Cor|(?:[1I]\.|[1I])[\s\xa0]*Кор(?:интяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Gal"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Галатяни|към[\s\xa0]*галатяните)|Галатяните|Gal|Гал(?:атяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Eph"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Ефесяни|към[\s\xa0]*ефесяните)|Ефесяните|Eph|Еф(?:есяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phil"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филипяни|към[\s\xa0]*филипяните)|Филипяните|Phil|Фил(?:ипяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Col"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Колосяни|към[\s\xa0]*колосяните)|Колосяните|Col|Кол(?:осяни)?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:(?:II\.?|2\.?)[\s\xa0]*Солуняни)|(?:(?:II\.?|2\.?)[\s\xa0]*Солунците)|(?:(?:II\.?|2\.?)[\s\xa0]*Солунци)|(?:Втор(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|към[\s\xa0]*солунците)|Сол(?:унците|унци|уняни)?)|а[\s\xa0]*Сол(?:унците|унци|уняни)?)|2(?:Thess|[\s\xa0]*Сол|\.[\s\xa0]*Сол)|II\.?[\s\xa0]*Сол)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Thess"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:[1I]\.?[\s\xa0]*Солуняни)|(?:[1I]\.?[\s\xa0]*Солунците)|(?:[1I]\.?[\s\xa0]*Солунци)|(?:Първ(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Солуняни|към[\s\xa0]*солунците)|Сол(?:унците|унци|уняни)?)|а[\s\xa0]*Сол(?:унците|унци|уняни)?)|1(?:Thess|[\s\xa0]*Сол|\.[\s\xa0]*Сол)|I\.?[\s\xa0]*Сол)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|към[\s\xa0]*Тимоте[ий])|Тим(?:оте[ий])?)|а[\s\xa0]*Тим(?:оте[ий])?)|(?:(?:II|2)\.|II|2)[\s\xa0]*Тимоте[ий]|2Tim|(?:(?:II|2)\.|II|2)[\s\xa0]*Тим)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Tim"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тимотея|към[\s\xa0]*Тимоте[ий])|Тим(?:оте[ий])?)|а[\s\xa0]*Тим(?:оте[ий])?)|(?:[1I]\.|[1I])[\s\xa0]*Тимоте[ий]|1Tim|(?:[1I]\.|[1I])[\s\xa0]*Тим)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Titus"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Тита|към[\s\xa0]*Тит)|Titus|Тит)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Phlm"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Филимона|към[\s\xa0]*Филимон)|Phlm|Флм|Филимон|Филим)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Heb"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Евреите)|(?:Послание[\s\xa0]*(?:на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Павла[\s\xa0]*до[\s\xa0]*Е|към[\s\xa0]*е)вреите|Евреи|Heb|Евр)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jas"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Иакова|Послание[\s\xa0]*на[\s\xa0]*Яков|Jas|Иак|Яков|Як)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Петра|послание[\s\xa0]*на[\s\xa0]*Петър|Пет(?:рово|ър)|Петр?)|а[\s\xa0]*Пет(?:рово|ър|р)?)|(?:(?:II|2)\.|II|2)[\s\xa0]*Петрово|2Pet|(?:(?:II|2)\.|II|2)[\s\xa0]*Петър|(?:(?:II|2)\.|II|2)[\s\xa0]*Петр?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Pet"]
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:о[\s\xa0]*(?:съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Петра|послание[\s\xa0]*на[\s\xa0]*Петър|Пет(?:рово|ър)|Петр?)|а[\s\xa0]*Пет(?:рово|ър|р)?)|(?:[1I]\.|[1I])[\s\xa0]*Петрово|1Pet|(?:[1I]\.|[1I])[\s\xa0]*Петър|(?:[1I]\.|[1I])[\s\xa0]*Петр?)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jude"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Съборно[\s\xa0]*послание[\s\xa0]*на[\s\xa0]*св(?:\.[\s\xa0]*ап\.?|[\s\xa0]*ап\.?)[\s\xa0]*Иуда|(?:Послание[\s\xa0]*на[\s\xa0]*)?Юда|Jude|Иуд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Tob"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Товита?)|(?:Книга[\s\xa0]*(?:на[\s\xa0]*Товита?|за[\s\xa0]*Тобия)|Tob|Тов|Тобия)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Jdt"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Книга[\s\xa0]*(?:за[\s\xa0]*Юдита|Иудит)|Юдит|Jdt|Иудит|Юд)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Bar"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Варуха)|(?:Книга[\s\xa0]*на[\s\xa0]*(?:пророк[\s\xa0]*Варуха|Барух)|Варух|Bar|Вар)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Sus"]
		apocrypha: true
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Сус(?:ана)?|Sus)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["2Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Втор(?:а[\s\xa0]*(?:книга[\s\xa0]*(?:Макаве[ий]ска|на[\s\xa0]*Макавеите)|Макавеи)|о[\s\xa0]*Макавеи)|(?:(?:II|2)\.|II)[\s\xa0]*Макавеи|2(?:[\s\xa0]*Макавеи|Macc)|2[\s\xa0]*Мак)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["3Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Трет(?:а[\s\xa0]*(?:книга[\s\xa0]*Макаве[ий]ска|Макавеи)|о[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*Макавеите|Макавеи))|(?:III\.?|3\.)[\s\xa0]*Макавеи|3(?:[\s\xa0]*Макавеи|Macc)|3[\s\xa0]*Мак)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["4Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Четвърт(?:а[\s\xa0]*(?:книга[\s\xa0]*на[\s\xa0]*Макавеите|Макавеи)|о[\s\xa0]*Макавеи)|(?:(?:IV|4)\.|IV)[\s\xa0]*Макавеи|4(?:[\s\xa0]*Макавеи|Macc)|4[\s\xa0]*Мак)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["1Macc"]
		apocrypha: true
		regexp: ///(^|[^0-9A-Za-zªµºÀ-ÖØ-öø-ɏЀ-ҁ҃-҇Ҋ-ԧḀ-ỿⱠ-Ɀⷠ-ⷿꙀ-꙯ꙴ-꙽ꙿ-ꚗꚟꜢ-ꞈꞋ-ꞎꞐ-ꞓꞠ-Ɦꟸ-ꟿ])(
		(?:Първ(?:а[\s\xa0]*(?:книга[\s\xa0]*(?:Макаве[ий]ска|на[\s\xa0]*Макавеите)|Макавеи)|о[\s\xa0]*Макавеи)|(?:[1I]\.|I)[\s\xa0]*Макавеи|1(?:[\s\xa0]*Макавеи|Macc)|1[\s\xa0]*Мак)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Ezek", "Ezra"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ез)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	,
		osis: ["Hab", "Obad"]
		regexp: ///(^|#{bcv_parser::regexps.pre_book})(
		(?:Ав)
			)(?:(?=[\d\s\xa0.:,;\x1e\x1f&\(\)\uff08\uff09\[\]/"'\*=~\-\u2013\u2014])|$)///gi
	]
	# Short-circuit the look if we know we want all the books.
	return books if include_apocrypha is true and case_sensitive is "none"
	# Filter out books in the Apocrypha if we don't want them. `Array.map` isn't supported below IE9.
	out = []
	for book in books
		continue if include_apocrypha is false and book.apocrypha? and book.apocrypha is true
		if case_sensitive is "books"
			book.regexp = new RegExp book.regexp.source, "g"
		out.push book
	out

# Default to not using the Apocrypha
bcv_parser::regexps.books = bcv_parser::regexps.get_books false, "none"
