var bcv_regexps = class {
  constructor() {
    this.books = [];
    this.languages = ["mar"];
    this.translations = [/ERV\b/gi];
    this.first = /(?:पहिल\.?\s*|पहल\.?\s*|1\.?\s*)/;
    this.second = /(?:दुसरे\.?\s*|दसर\.?\s*|दुसर\.?\s*|दसरे\.?\s*|2\.?\s*)/;
    this.third = /(?:तिसरे\.?\s*|तसर\.?\s*|तिसर\.?\s*|तसरे\.?\s*|3\.?\s*)/;
    this.range_and = /(?:[&\u2013\u2014-]|and\.?\s*|to\.?\s*)/;
    this.range_only = /(?:[\u2013\u2014-]|to\.?\s*)/;
    this.match_end_split = /\d\W*(?:title)|\d\W*(?:ff)(?:[\s*]*\.)?|\d[\s*]*(?:(?:[a-e](?!\w)))|\x1e(?:[\s*]*[)\]\uff09])?|[\d\x1f]/gi;
    this.control = /[\x1e\x1f]/g;
    this.escaped_passage = /(?:^|[^\x1e\x1f\p{L}\p{N}])((?:(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:[\u2013\u2014\-]|through|thru|to)\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:\d+(?:th|nd|st)\s*ch(?:apter|a?pt\.?|a?p?\.?)?\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*))?\x1f(\d+)(?:\/\d+)?\x1f(?:\/\d+\x1f|[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—]|title\.?\s*(?![a-z])|(?:(?:chapter\.?\s*)|(?:verse\.?\s*)|(?:ff\.?\s*)|(?:and\.?\s*)|(?:to\.?\s*))|(?:[a-e]\.?\s*(?!\w))(?!\w)|$)+)/giu;
    this.pre_book = /(?:^|(?<=[^\p{L}]))/gu;
    this.pre_number_book = /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))/gu;
    this.post_book = /(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/gu;
    this.all_books = [
          {
            osis: ["Ps"],
            testament: "a",
            extra: "2",
            regexp: /\b(Ps151)(?=\.1\b)/g
          },
          {
            osis: ["Gen"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:उत(?:्पत(?:्ति?|ति?|ि)?|पत(?:्ति?|ति?|ि)?)|utpatti|Gen))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Exod"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:nirgam|न(?:िर्?गम|र्?गम)|Exod))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bel"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bel)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lev"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:lew[iī]y|ल(?:ेवी?य|वी?य)|Lev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Num"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ga[nṇ]an[aā]|गणना?|Num))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sir"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sir)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Wis"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Wis)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:wil[aā]pg[iī]t|व(?:िल(?:ापगी?त|पगी?त)|ल(?:ापगी?त|पगी?त))|Lam))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["EpJer"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(EpJer)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rev"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yoh[aā]n[aā]l[aā]\s*ǳʰ[aā]lele\s*praka[tṭ][iī]kara[nṇ]|य(?:ोहानाला\s*झालेले\s*प्रकटी|हनल\s*झलल\s*परकट)करण|praka[tṭ][iī]kara[nṇ]|प्?रकटीकरण|प्?रकटकरण|Rev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrMan"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrMan)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Deut"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:anuw[aā]d|अन(?:ुवा?द|वा?द)|Deut))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Josh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yaho[sŝ]aw[aā]|यह(?:ोशवा?|शवा?)|Josh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Judg"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:श(?:ास(?:्ते?|ते?)|स(?:्ते?|ते?))|[sŝ][aā]ste|Judg))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ruth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:Ruth|r[uū]tʰ|रू?थ))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Isa"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ya[sŝ]ay[aā]|यश(?:या?|ाय)|Isa))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:द(?:ुसर(?:े\s*शम(?:ुवे?ल|वे?ल)|\s*शम(?:ुवे?ल|वे?ल))|सर(?:े\s*शम(?:ुवे?ल|वे?ल)|\s*शम(?:ुवे?ल|वे?ल)))|2(?:(?:\s*[sŝ]amuwel|Sam)|\s*शम(?:ुवे?ल|वे?ल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:पह(?:िल(?:े\s*शम(?:ुवे?ल|वे?ल)|\s*शम(?:ुवे?ल|वे?ल))|ल(?:े\s*शम(?:ुवे?ल|वे?ल)|\s*शम(?:ुवे?ल|वे?ल)))|1(?:(?:\s*[sŝ]amuwel|Sam)|\s*शम(?:ुवे?ल|वे?ल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:द(?:ुसर(?:े\s*र(?:ाजे?|जे?)|\s*र(?:ाजे?|जे?))|सर(?:े\s*र(?:ाजे?|जे?)|\s*र(?:ाजे?|जे?)))|2(?:(?:\s*r[aā]ǳe|Kgs)|\s*र(?:ाजे?|जे?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:पह(?:िल(?:े\s*र(?:ाजे?|जे?)|\s*र(?:ाजे?|जे?))|ल(?:े\s*र(?:ाजे?|जे?)|\s*र(?:ाजे?|जे?)))|1(?:(?:\s*r[aā]ǳe|Kgs)|\s*र(?:ाजे?|जे?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:द(?:ुसर(?:े\s*इत(?:िहा?स|हा?स)|\s*इत(?:िहा?स|हा?स))|सर(?:े\s*इत(?:िहा?स|हा?स)|\s*इत(?:िहा?स|हा?स)))|2(?:(?:\s*itih[aā]s|Chr)|\s*इत(?:िहा?स|हा?स))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:पह(?:िल(?:े\s*इत(?:िहा?स|हा?स)|\s*इत(?:िहा?स|हा?स))|ल(?:े\s*इत(?:िहा?स|हा?स)|\s*इत(?:िहा?स|हा?स)))|1(?:(?:\s*itih[aā]s|Chr)|\s*इत(?:िहा?स|हा?स))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezra"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:e(?:dz|ǳ)r[aā]|एज(?:्रा?|रा?)|Ezra))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Neh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:nahemy[aā]|नह(?:ेम(?:्या?|या?)|म(?:्या?|या?))|Neh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["GkEsth"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(GkEsth)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Esth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:एस(?:्ते?र|ते?र)|ester|Esth))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Job"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:(?:[iī]y|J)ob|[इई]यो?ब))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ps"],
            testament: "oa",
            testament_books: { Ps: "oa" },
            regexp: /(?:^|(?<=[^\p{L}]))((?:स(?:्त(?:्र(?:ोत(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता))|त(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता)))|र(?:ोत(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता))|त(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता)))|(?:ोत्?रस|त्?रस)(?:ंहि?ता|हि?ता))|त(?:्र(?:ोत(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता))|त(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता)))|र(?:ोत(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता))|त(?:्रस(?:ंहि?ता|हि?ता)|रस(?:ंहि?ता|हि?ता)))|(?:ोत्?रस|त्?रस)(?:ंहि?ता|हि?ता)))|स(?:्त(?:्र(?:ोत(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त))|त(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त)))|र(?:ोत(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त))|त(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त)))|(?:ोत्?रस|त्?रस)(?:ंहि?त|हि?त)|ोत्?र|त्?र)|त(?:्र(?:ोत(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त))|त(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त)))|र(?:ोत(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त))|त(?:्रस(?:ंहि?त|हि?त)|रस(?:ंहि?त|हि?त)))|(?:ोत्?रस|त्?रस)(?:ंहि?त|हि?त)|ोत्?र|त्?र))|stotrasa[mṃ]hit[aā]|Ps))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrAzar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrAzar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Prov"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:न(?:ीत(?:िस(?:ूत(?:्र(?:ें?|ं)?|र(?:ें?|ं)?)|त(?:्र(?:ें?|ं)?|र(?:ें?|ं)?))|स(?:ूत(?:्र(?:ें?|ं)?|र(?:ें?|ं)?)|त(?:्र(?:ें?|ं)?|र(?:ें?|ं)?)))|त(?:िस(?:ूत(?:्र(?:ें?|ं)?|र(?:ें?|ं)?)|त(?:्र(?:ें?|ं)?|र(?:ें?|ं)?))|स(?:ूत(?:्र(?:ें?|ं)?|र(?:ें?|ं)?)|त(?:्र(?:ें?|ं)?|र(?:ें?|ं)?))))|n[iī]tis[uū]tre|Prov))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eccl"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:upade[sŝ]ak|उपदे?शक|Eccl))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["SgThree"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(SgThree)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Song"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:g[iī]tratna|ग(?:ीतरत्?न|तरत्?न)|Song))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jer"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yirmay[aā]|य(?:िर(?:्मया?|मया?)|र(?:्मया?|मया?))|Jer))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezek"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yahe(?:dz|ǳ)kel|यह(?:ेज(?:्के?ल|के?ल)|ज(?:्के?ल|के?ल))|Ezek))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Dan"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:द(?:ान(?:ीएल(?:्र|र)?|एल(?:्र|र)?)|न(?:ीएल(?:्र|र)?|एल(?:्र|र)?))|d[aā]n[iī]el|Dan))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ho[sŝ]ey|ह(?:ोशे?य|शे?य)|Hos))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Joel"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:[Jy]oel|यो?एल))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Amos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:[Aaā]mos|[अआ]मो?स))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Obad"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:obadʰ[aā]|ओब(?:द(?:्या?|या?)|धा?)|Obad))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jonah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:Jonah|yon[aā]|य(?:ोना?|ना?)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mic"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:m[iī]kʰ[aā]|म(?:ीखा?|खा?)|Mic))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Nah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:nah[uū]m|नहू?म|Nah))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hab"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:habakk[uū]k|हबक(?:्क(?:ूक?|क)?|क(?:ूक?|क)?)|Hab))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zeph"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:sapʰany[aā]|सफन(?:्या?|या?)|Zeph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hag"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:h[aā]ggay|ह(?:ाग्?गय|ग्?गय)|Hag))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zech"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:jakʰary[aā]|जख[रऱ](?:्या?|या?)|Zech))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mal"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:mal[aā]kʰ[iī]|मल(?:ाखी?|खी?)|Mal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Matt"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:mattay[aā]ne\s*lihilele\s*[sŝ]ubʰavartam[aā]n|मत(?:्तय(?:ान(?:े(?:\s*लिहिलेले\s*शुभवर्तमान)?)?|ने|न)?|तयन\s*लहलल\s*शभवरतमन|तया?ने|तय(?:ान|न?))|mattay[aā]ne|Matt))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mark"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:m[aā]rk[aā]ne\s*lihilele\s*[sŝ]ubʰavartam[aā]n|म(?:ार(?:्क(?:ान(?:े(?:\s*लिहिलेले\s*शुभवर्तमान)?)?|ने|न)?|का?ने|क(?:ा?न)?)|रकन\s*लहलल\s*शभवरतमन|(?:र(?:्का?न|कान)|रकन)े|र(?:(?:्का?न|कान)|(?:कन?|्क)))|m[aā]rk[aā]ne|Mark))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Luke"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:l[uū]k[aā]ne\s*lihilele\s*[sŝ]ubʰavartam[aā]n|ल(?:ूक(?:ा(?:न(?:े(?:\s*लिहिलेले\s*शुभवर्तमान)?)?)?|ने|न)?|कन\s*लहलल\s*शभवरतमन|का?ने|क(?:ान|(?:न|ा)?))|l[uū]k[aā]ne|Luke))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:yoh[aā]n[aā]ce[mṃ]\s*pahile\s*patra|य(?:ोह(?:ान(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))))|ह(?:ान(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))))|1(?:\s*(?:yoh[aā]n[aā]ce[mṃ]|य(?:ोह(?:ाना?च|ना?च)|ह(?:ाना?च|ना?च)))|John)|1\s*य(?:ोहा?न|हा?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:yoh[aā]n[aā]ce[mṃ]\s*dusre\s*patra|य(?:ोह(?:ान(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))))|ह(?:ान(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))))|2(?:\s*(?:yoh[aā]n[aā]ce[mṃ]|य(?:ोह(?:ाना?च|ना?च)|ह(?:ाना?च|ना?च)))|John)|2\s*य(?:ोहा?न|हा?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:yoh[aā]n[aā]ce[mṃ]\s*tisre\s*patra|य(?:ोह(?:ान(?:ाच(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))))|ह(?:ान(?:ाच(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|न(?:ाच(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*त(?:िसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))))|3(?:\s*(?:yoh[aā]n[aā]ce[mṃ]|य(?:ोह(?:ाना?च|ना?च)|ह(?:ाना?च|ना?च)))|John)|3\s*य(?:ोहा?न|हा?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yoh[aā]n[aā]ne\s*lihilele\s*[sŝ]ubʰavartam[aā]n|य(?:ोह(?:ान(?:ान(?:े(?:\s*लिहिलेले\s*शुभवर्तमान)?)?|ने|न)?|ना?ने|न(?:ा?न)?)|हनन\s*लहलल\s*शभवरतमन|(?:ह(?:ाना?न|नान)|हनन)े|ह(?:(?:ाना?न|नान)|(?:नन?|ान)))|yoh[aā]n[aā]ne|John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Acts"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:्रेषितांची(?:ं\s*कृत्यें?|\s*कृत्यें)|रषतच\s*कतय)|pre[sš]it[aā][mṃ]c[iī][mṃ]\s*kr(?:̥tye[mṃ]|tye[mṃ])|Acts))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rom"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौल(?:ाच(?:े\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))|ल(?:ाच(?:े\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*र(?:ोमकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|मकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))))|romkar[aā][mṃ]s\s*patra|र(?:ोमकर(?:ां?स\s*|ं?स\s*)|मकर(?:ां?स\s*|ं?स\s*))पत्?र|romkar[aā][mṃ]s|र(?:ोमकर(?:ां?स|ं?स)|मकर(?:ां?स|ं?स))|र(?:ोमकंरा?स|मकंरा?स)|Rom))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*करिंथकरांस\s*दूसरे\s*पत्|लच\s*करथकरस\s*दसर\s*पत)र|kari[mṃ]tʰkar[aā][mṃ]s\s*dusre\s*patra|कर(?:ि(?:ंथकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|थकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)))|ंथकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|थकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ंस\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|स\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)))र|कर(?:ि(?:ंथकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|थकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)))|ंथकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|थकर(?:ा(?:ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ंस\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|स\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)))|2(?:\s*(?:kari[mṃ]tʰkar[aā][mṃ]s|कर(?:ि(?:ंथकर(?:ां?स|ं?स)|थकर(?:ां?स|ं?स))|ंथकर(?:ां?स|ं?स)|थकर(?:ां?स|ं?स)))|Cor)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*करिंथकरांस\s*पहिले\s*पत्|लच\s*करथकरस\s*पहल\s*पत)र|kari[mṃ]tʰkar[aā][mṃ]s\s*pahile\s*patra|कर(?:ि(?:ंथकर(?:ा(?:ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|थकर(?:ा(?:ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्)))|ंथकर(?:ा(?:ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|थकर(?:ा(?:ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ंस\s*पह(?:िले?\s*पत्|ले?\s*पत्)|स\s*पह(?:िले?\s*पत्|ले?\s*पत्)))र|कर(?:ि(?:ंथकर(?:ा(?:ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|थकर(?:ा(?:ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर)))|ंथकर(?:ा(?:ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|थकर(?:ा(?:ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ंस\s*पह(?:िले?\s*पतर|ले?\s*पतर)|स\s*पह(?:िले?\s*पतर|ले?\s*पतर)))|1(?:\s*(?:kari[mṃ]tʰkar[aā][mṃ]s|कर(?:ि(?:ंथकर(?:ां?स|ं?स)|थकर(?:ां?स|ं?स))|ंथकर(?:ां?स|ं?स)|थकर(?:ां?स|ं?स)))|Cor)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Gal"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौल(?:ाच(?:े\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))|ल(?:ाच(?:े\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*गलत(?:ीकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))))|galat[iī]kar[aā][mṃ]s\s*patra|गलत(?:ीकर(?:ां?स\s*|ं?स\s*)|कर(?:ां?स\s*|ं?स\s*))पत्?र|galat[iī]kar[aā][mṃ]s|गलत(?:ीकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|Gal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eph"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौल(?:ाच(?:े\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))|ल(?:ाच(?:े\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|च(?:े\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|\s*इफ(?:िसकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|सकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))))|ipʰiskar[aā][mṃ]s\s*patra|इफ(?:िसकर(?:ां?स\s*|ं?स\s*)|सकर(?:ां?स\s*|ं?स\s*))पत्?र|ipʰiskar[aā][mṃ]s|इफ(?:िसकर(?:ां?स|ं?स)|सकर(?:ां?स|ं?स))|Eph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phil"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौलाचे\s*फिलिप्पैकरांस\s*पत्|लच\s*फलपपकरस\s*पत)र|pʰilippaikar[aā][mṃ]s\s*patra|फ(?:िल(?:िप(?:्प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्))|प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्)))|प(?:्प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्))|प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्))))|ल(?:िप(?:्प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्))|प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्)))|प(?:्प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्))|प(?:ैकर(?:ां?स\s*पत्|ं?स\s*पत्)|कर(?:ां?स\s*पत्|ं?स\s*पत्)))))र|फ(?:िल(?:िप(?:्प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर))|प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर)))|प(?:्प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर))|प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर))))|ल(?:िप(?:्प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर))|प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर)))|प(?:्प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर))|प(?:ैकर(?:ां?स\s*पतर|ं?स\s*पतर)|कर(?:ां?स\s*पतर|ं?स\s*पतर)))))|pʰilippaikar[aā][mṃ]s|फ(?:िल(?:िप(?:्प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|प(?:्प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))))|ल(?:िप(?:्प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|प(?:्प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|प(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))))|Phil))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Col"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौल(?:ाच(?:े\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))|च(?:े\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))))|ल(?:ाच(?:े\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))|च(?:े\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|\s*कलस(?:्स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|स(?:ैकर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|कर(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))))))|kalassaikar[aā][mṃ]s\s*patra|कलस(?:्स(?:ैकर(?:ां?स\s*|ं?स\s*)|कर(?:ां?स\s*|ं?स\s*))|स(?:ैकर(?:ां?स\s*|ं?स\s*)|कर(?:ां?स\s*|ं?स\s*)))पत्?र|kalassaikar[aā][mṃ]s|कलस(?:्स(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|स(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|कलस(?:ैकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|Col))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*थेस्सलनीकाकरांस\s*दुसरे\s*पत्|लच\s*थससलनककरस\s*दसर\s*पत)र|tʰessalan[iī]k[aā]kar[aā][mṃ]s\s*dusre\s*patra|थेस्सलनीकाकरांस\s*दुसरे\s*पत्र|2(?:\s*(?:tʰessalan[iī]k[aā]kar[aā][mṃ]s|थ(?:ेस(?:्सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))))|स(?:्सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))))))|Thess)|थससलनककरस\s*दसर\s*पतर))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*थेस्सलनीकाकरांस\s*पहिले\s*पत्|लच\s*थससलनककरस\s*पहल\s*पत)र|tʰessalan[iī]k[aā]kar[aā][mṃ]s\s*pahile\s*patra|थेस्सलनीकाकरांस\s*पहिले\s*पत्र|1(?:\s*(?:tʰessalan[iī]k[aā]kar[aā][mṃ]s|थ(?:ेस(?:्सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))))|स(?:्सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स)))|सलन(?:ीक(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))|क(?:ाकर(?:ां?स|ं?स)|कर(?:ां?स|ं?स))))))|Thess)|थससलनककरस\s*पहल\s*पतर))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*तीमथ्थाला\s*दुसरे\s*पत्|लच\s*तमथथल\s*दसर\s*पत)र|t[iī]matʰtʰ[aā]l[aā]\s*dusre\s*patra|त(?:ीमथ(?:्थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)))|थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))))|मथ(?:्थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)))|थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्))|ल(?:ा\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)|\s*द(?:ुसरे?\s*पत्|सरे?\s*पत्)))))र|त(?:ीमथ(?:्थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)))|थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))))|मथ(?:्थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)))|थ(?:ाल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर))|ल(?:ा\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)|\s*द(?:ुसरे?\s*पतर|सरे?\s*पतर)))))|2(?:\s*(?:t[iī]matʰtʰ[aā]l[aā]|त(?:ीमथ(?:्था?ला|था?ला)|मथ(?:्था?ला|था?ला)))|Tim)|2\s*त(?:ीमथ(?:्था?ल|था?ल)|मथ(?:्था?ल|था?ल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:प(?:ौलाचे\s*तीमथ्याला\s*पहिले\s*पत्|लच\s*तमथयल\s*पहल\s*पत)र|t[iī]matʰtʰ[aā]l[aā]\s*pahile\s*patra|त(?:ीमथ(?:्थ(?:ाल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्)))|थ(?:ाल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्))))|मथ(?:्थ(?:ाल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्)))|थ(?:ाल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्))|ल(?:ा\s*पह(?:िले?\s*पत्|ले?\s*पत्)|\s*पह(?:िले?\s*पत्|ले?\s*पत्)))))र|त(?:ीमथ(?:्थ(?:ाल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर)))|थ(?:ाल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर))))|मथ(?:्थ(?:ाल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर)))|थ(?:ाल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर))|ल(?:ा\s*पह(?:िले?\s*पतर|ले?\s*पतर)|\s*पह(?:िले?\s*पतर|ले?\s*पतर)))))|1(?:\s*(?:t[iī]matʰtʰ[aā]l[aā]|त(?:ीमथ(?:्[थय]ा?ला|[थय]ा?ला)|मथ(?:्[थय]ा?ला|[थय]ा?ला)))|Tim)|1\s*त(?:ीमथ(?:्[थय]ा?ल|[थय]ा?ल)|मथ(?:्[थय]ा?ल|[थय]ा?ल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Titus"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौल(?:ाच(?:े\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र)))|\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))))|च(?:े\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र)))|\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र)))))|ल(?:ाच(?:े\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र)))|\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))))|च(?:े\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र)))|\s*त(?:ीत(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))|त(?:ाल(?:ा\s*पत्?र|\s*पत्?र)|ल(?:ा\s*पत्?र|\s*पत्?र))))))|t[iī]t[aā]l[aā]\s*patra|त(?:ीत(?:ाला?\s*|ला?\s*)|त(?:ाला?\s*|ला?\s*))पत्?र|t[iī]t[aā]l[aā]|त(?:ीत(?:ाला?|ला?)|त(?:ाला?|ला?))|Titus))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phlm"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:ौलाचे\s*फिलेमोनाला\s*पत्|लच\s*फलमनल\s*पत)र|pʰilemon[aā]l[aā]\s*patra|फ(?:िल(?:ेम(?:ोन(?:ाला?\s*पत्|ला?\s*पत्)|न(?:ाला?\s*पत्|ला?\s*पत्))|म(?:ोन(?:ाला?\s*पत्|ला?\s*पत्)|न(?:ाला?\s*पत्|ला?\s*पत्)))|ल(?:ेम(?:ोन(?:ाला?\s*पत्|ला?\s*पत्)|न(?:ाला?\s*पत्|ला?\s*पत्))|म(?:ोन(?:ाला?\s*पत्|ला?\s*पत्)|न(?:ाला?\s*पत्|ला?\s*पत्))))र|फ(?:िल(?:ेम(?:ोन(?:ाला?\s*पतर|ला?\s*पतर)|न(?:ाला?\s*पतर|ला?\s*पतर))|म(?:ोन(?:ाला?\s*पतर|ला?\s*पतर)|न(?:ाला?\s*पतर|ला?\s*पतर)))|ल(?:ेम(?:ोन(?:ाला?\s*पतर|ला?\s*पतर)|न(?:ाला?\s*पतर|ला?\s*पतर))|म(?:ोन(?:ाला?\s*पतर|ला?\s*पतर)|न(?:ाला?\s*पतर|ला?\s*पतर))))|pʰilemon[aā]l[aā]|फ(?:िल(?:ेम(?:ोन(?:ा(?:ला?)?|ला?)?|न(?:ा(?:ला?)?|ला?)?)|म(?:ोन(?:ा(?:ला?)?|ला?)?|न(?:ा(?:ला?)?|ला?)?))|ल(?:ेम(?:ोन(?:ा(?:ला?)?|ला?)?|न(?:ा(?:ला?)?|ला?)?)|म(?:ोन(?:ा(?:ला?)?|ला?)?|न(?:ा(?:ला?)?|ला?)?)))|Phlm))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Heb"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:इब(?:्री?\s*ल(?:ोक(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|क(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र))|री?\s*ल(?:ोक(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)|क(?:ा(?:ंस\s*पत्?र|स\s*पत्?र)|ंस\s*पत्?र|स\s*पत्?र)))|ibr[iī]\s*lok[aā][mṃ]s(?:\s*patra)?|इब(?:्र(?:ी?\s*ल(?:ोक(?:ां?स|ं?स)|क(?:ां?स|ं?स))|ी)?|र(?:ी?\s*ल(?:ोक(?:ां?स|ं?स)|क(?:ां?स|ं?स))|ी)?)|Heb))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jas"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:y[aā]kob[aā]ce[mṃ]\s*patra|य(?:ाक(?:ोब(?:ाच(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?|ब(?:ाच(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?)|क(?:ोब(?:ाच(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?|ब(?:ाच(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?))|y[aā]kob[aā]ce[mṃ]|Jas))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:petr[aā]ce[mṃ]\s*dusre\s*patra|प(?:ेत(?:्र(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|र(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))))|त(?:्र(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))))|र(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))))|ौ?ल(?:ाच(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))|ं\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र))|\s*द(?:ुसर(?:े\s*पत्?र|\s*पत्?र)|सर(?:े\s*पत्?र|\s*पत्?र)))))|2(?:\s*(?:प(?:ेत(?:्र(?:ाचे?ं|चे?ं)|र(?:ाचे?ं|चे?ं))|त(?:्र(?:ाचे?ं|चे?ं)|र(?:ाचे?ं|चे?ं)))|petr[aā]ce[mṃ])|Pet)|2\s*प(?:ेत(?:्र(?:ाचे?|चे?)?|र(?:ाचे?|चे?)?)|त(?:्र(?:ाचे?|चे?)?|र(?:ाचे?|चे?)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:petr[aā]ce[mṃ]\s*pahile\s*patra|प(?:ेत(?:्र(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))|र(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))))|त(?:्र(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))|र(?:ाच(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|च(?:े(?:ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र)))|ं\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:े\s*पत्?र|\s*पत्?र)|ल(?:े\s*पत्?र|\s*पत्?र))))))|1(?:\s*(?:प(?:ेत(?:्र(?:ाचे?ं|चे?ं)|र(?:ाचे?ं|चे?ं))|त(?:्र(?:ाचे?ं|चे?ं)|र(?:ाचे?ं|चे?ं)))|petr[aā]ce[mṃ])|Pet)|1\s*प(?:ेत(?:्र(?:ाचे?|चे?)?|र(?:ाचे?|चे?)?)|त(?:्र(?:ाचे?|चे?)?|र(?:ाचे?|चे?)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jude"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yah[uū]d[aā]ce[mṃ]\s*patra|यह(?:ूद(?:ा(?:च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?|द(?:ा(?:च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?|च(?:(?:ें?\s*|ं?\s*)पत्?र|ें?|ं)?)?)|yah[uū]d[aā]ce[mṃ]|Jude))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Tob"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Tob)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jdt"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Jdt)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sus"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sus)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(3Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["4Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(4Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          }
        ];
  }
};

var bcv_translations = class {
  constructor() {
    this.aliases = { current: { system: "current", osis: "" }, default: { system: "default", osis: "" } };
    this.current_system = "default";
    this.systems = {
          current: {},
          default: {
            order: {
              Gen: 1,
              Exod: 2,
              Lev: 3,
              Num: 4,
              Deut: 5,
              Josh: 6,
              Judg: 7,
              Ruth: 8,
              "1Sam": 9,
              "2Sam": 10,
              "1Kgs": 11,
              "2Kgs": 12,
              "1Chr": 13,
              "2Chr": 14,
              Ezra: 15,
              Neh: 16,
              Esth: 17,
              Job: 18,
              Ps: 19,
              Prov: 20,
              Eccl: 21,
              Song: 22,
              Isa: 23,
              Jer: 24,
              Lam: 25,
              Ezek: 26,
              Dan: 27,
              Hos: 28,
              Joel: 29,
              Amos: 30,
              Obad: 31,
              Jonah: 32,
              Mic: 33,
              Nah: 34,
              Hab: 35,
              Zeph: 36,
              Hag: 37,
              Zech: 38,
              Mal: 39,
              Matt: 40,
              Mark: 41,
              Luke: 42,
              John: 43,
              Acts: 44,
              Rom: 45,
              "1Cor": 46,
              "2Cor": 47,
              Gal: 48,
              Eph: 49,
              Phil: 50,
              Col: 51,
              "1Thess": 52,
              "2Thess": 53,
              "1Tim": 54,
              "2Tim": 55,
              Titus: 56,
              Phlm: 57,
              Heb: 58,
              Jas: 59,
              "1Pet": 60,
              "2Pet": 61,
              "1John": 62,
              "2John": 63,
              "3John": 64,
              Jude: 65,
              Rev: 66,
              Tob: 67,
              Jdt: 68,
              GkEsth: 69,
              Wis: 70,
              Sir: 71,
              Bar: 72,
              PrAzar: 73,
              Sus: 74,
              Bel: 75,
              SgThree: 76,
              EpJer: 77,
              "1Macc": 78,
              "2Macc": 79,
              "3Macc": 80,
              "4Macc": 81,
              "1Esd": 82,
              "2Esd": 83,
              PrMan: 84
            },
            chapters: {
              Gen: [31, 25, 24, 26, 32, 22, 24, 22, 29, 32, 32, 20, 18, 24, 21, 16, 27, 33, 38, 18, 34, 24, 20, 67, 34, 35, 46, 22, 35, 43, 55, 32, 20, 31, 29, 43, 36, 30, 23, 23, 57, 38, 34, 34, 28, 34, 31, 22, 33, 26],
              Exod: [22, 25, 22, 31, 23, 30, 25, 32, 35, 29, 10, 51, 22, 31, 27, 36, 16, 27, 25, 26, 36, 31, 33, 18, 40, 37, 21, 43, 46, 38, 18, 35, 23, 35, 35, 38, 29, 31, 43, 38],
              Lev: [17, 16, 17, 35, 19, 30, 38, 36, 24, 20, 47, 8, 59, 57, 33, 34, 16, 30, 37, 27, 24, 33, 44, 23, 55, 46, 34],
              Num: [54, 34, 51, 49, 31, 27, 89, 26, 23, 36, 35, 16, 33, 45, 41, 50, 13, 32, 22, 29, 35, 41, 30, 25, 18, 65, 23, 31, 40, 16, 54, 42, 56, 29, 34, 13],
              Deut: [46, 37, 29, 49, 33, 25, 26, 20, 29, 22, 32, 32, 18, 29, 23, 22, 20, 22, 21, 20, 23, 30, 25, 22, 19, 19, 26, 68, 29, 20, 30, 52, 29, 12],
              Josh: [18, 24, 17, 24, 15, 27, 26, 35, 27, 43, 23, 24, 33, 15, 63, 10, 18, 28, 51, 9, 45, 34, 16, 33],
              Judg: [36, 23, 31, 24, 31, 40, 25, 35, 57, 18, 40, 15, 25, 20, 20, 31, 13, 31, 30, 48, 25],
              Ruth: [22, 23, 18, 22],
              "1Sam": [28, 36, 21, 22, 12, 21, 17, 22, 27, 27, 15, 25, 23, 52, 35, 23, 58, 30, 24, 42, 15, 23, 29, 22, 44, 25, 12, 25, 11, 31, 13],
              "2Sam": [27, 32, 39, 12, 25, 23, 29, 18, 13, 19, 27, 31, 39, 33, 37, 23, 29, 33, 43, 26, 22, 51, 39, 25],
              "1Kgs": [53, 46, 28, 34, 18, 38, 51, 66, 28, 29, 43, 33, 34, 31, 34, 34, 24, 46, 21, 43, 29, 53],
              "2Kgs": [18, 25, 27, 44, 27, 33, 20, 29, 37, 36, 21, 21, 25, 29, 38, 20, 41, 37, 37, 21, 26, 20, 37, 20, 30],
              "1Chr": [54, 55, 24, 43, 26, 81, 40, 40, 44, 14, 47, 40, 14, 17, 29, 43, 27, 17, 19, 8, 30, 19, 32, 31, 31, 32, 34, 21, 30],
              "2Chr": [17, 18, 17, 22, 14, 42, 22, 18, 31, 19, 23, 16, 22, 15, 19, 14, 19, 34, 11, 37, 20, 12, 21, 27, 28, 23, 9, 27, 36, 27, 21, 33, 25, 33, 27, 23],
              Ezra: [11, 70, 13, 24, 17, 22, 28, 36, 15, 44],
              Neh: [11, 20, 32, 23, 19, 19, 73, 18, 38, 39, 36, 47, 31],
              Esth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 3],
              Job: [22, 13, 26, 21, 27, 30, 21, 22, 35, 22, 20, 25, 28, 22, 35, 22, 16, 21, 29, 29, 34, 30, 17, 25, 6, 14, 23, 28, 25, 31, 40, 22, 33, 37, 16, 33, 24, 41, 30, 24, 34, 17],
              Ps: [6, 12, 8, 8, 12, 10, 17, 9, 20, 18, 7, 8, 6, 7, 5, 11, 15, 50, 14, 9, 13, 31, 6, 10, 22, 12, 14, 9, 11, 12, 24, 11, 22, 22, 28, 12, 40, 22, 13, 17, 13, 11, 5, 26, 17, 11, 9, 14, 20, 23, 19, 9, 6, 7, 23, 13, 11, 11, 17, 12, 8, 12, 11, 10, 13, 20, 7, 35, 36, 5, 24, 20, 28, 23, 10, 12, 20, 72, 13, 19, 16, 8, 18, 12, 13, 17, 7, 18, 52, 17, 16, 15, 5, 23, 11, 13, 12, 9, 9, 5, 8, 28, 22, 35, 45, 48, 43, 13, 31, 7, 10, 10, 9, 8, 18, 19, 2, 29, 176, 7, 8, 9, 4, 8, 5, 6, 5, 6, 8, 8, 3, 18, 3, 3, 21, 26, 9, 8, 24, 13, 10, 7, 12, 15, 21, 10, 20, 14, 9, 6],
              Prov: [33, 22, 35, 27, 23, 35, 27, 36, 18, 32, 31, 28, 25, 35, 33, 33, 28, 24, 29, 30, 31, 29, 35, 34, 28, 28, 27, 28, 27, 33, 31],
              Eccl: [18, 26, 22, 16, 20, 12, 29, 17, 18, 20, 10, 14],
              Song: [17, 17, 11, 16, 16, 13, 13, 14],
              Isa: [31, 22, 26, 6, 30, 13, 25, 22, 21, 34, 16, 6, 22, 32, 9, 14, 14, 7, 25, 6, 17, 25, 18, 23, 12, 21, 13, 29, 24, 33, 9, 20, 24, 17, 10, 22, 38, 22, 8, 31, 29, 25, 28, 28, 25, 13, 15, 22, 26, 11, 23, 15, 12, 17, 13, 12, 21, 14, 21, 22, 11, 12, 19, 12, 25, 24],
              Jer: [19, 37, 25, 31, 31, 30, 34, 22, 26, 25, 23, 17, 27, 22, 21, 21, 27, 23, 15, 18, 14, 30, 40, 10, 38, 24, 22, 17, 32, 24, 40, 44, 26, 22, 19, 32, 21, 28, 18, 16, 18, 22, 13, 30, 5, 28, 7, 47, 39, 46, 64, 34],
              Lam: [22, 22, 66, 22, 22],
              Ezek: [28, 10, 27, 17, 17, 14, 27, 18, 11, 22, 25, 28, 23, 23, 8, 63, 24, 32, 14, 49, 32, 31, 49, 27, 17, 21, 36, 26, 21, 26, 18, 32, 33, 31, 15, 38, 28, 23, 29, 49, 26, 20, 27, 31, 25, 24, 23, 35],
              Dan: [21, 49, 30, 37, 31, 28, 28, 27, 27, 21, 45, 13],
              Hos: [11, 23, 5, 19, 15, 11, 16, 14, 17, 15, 12, 14, 16, 9],
              Joel: [20, 32, 21],
              Amos: [15, 16, 15, 13, 27, 14, 17, 14, 15],
              Obad: [21],
              Jonah: [17, 10, 10, 11],
              Mic: [16, 13, 12, 13, 15, 16, 20],
              Nah: [15, 13, 19],
              Hab: [17, 20, 19],
              Zeph: [18, 15, 20],
              Hag: [15, 23],
              Zech: [21, 13, 10, 14, 11, 15, 14, 23, 17, 12, 17, 14, 9, 21],
              Mal: [14, 17, 18, 6],
              Matt: [25, 23, 17, 25, 48, 34, 29, 34, 38, 42, 30, 50, 58, 36, 39, 28, 27, 35, 30, 34, 46, 46, 39, 51, 46, 75, 66, 20],
              Mark: [45, 28, 35, 41, 43, 56, 37, 38, 50, 52, 33, 44, 37, 72, 47, 20],
              Luke: [80, 52, 38, 44, 39, 49, 50, 56, 62, 42, 54, 59, 35, 35, 32, 31, 37, 43, 48, 47, 38, 71, 56, 53],
              John: [51, 25, 36, 54, 47, 71, 53, 59, 41, 42, 57, 50, 38, 31, 27, 33, 26, 40, 42, 31, 25],
              Acts: [26, 47, 26, 37, 42, 15, 60, 40, 43, 48, 30, 25, 52, 28, 41, 40, 34, 28, 41, 38, 40, 30, 35, 27, 27, 32, 44, 31],
              Rom: [32, 29, 31, 25, 21, 23, 25, 39, 33, 21, 36, 21, 14, 23, 33, 27],
              "1Cor": [31, 16, 23, 21, 13, 20, 40, 13, 27, 33, 34, 31, 13, 40, 58, 24],
              "2Cor": [24, 17, 18, 18, 21, 18, 16, 24, 15, 18, 33, 21, 14],
              Gal: [24, 21, 29, 31, 26, 18],
              Eph: [23, 22, 21, 32, 33, 24],
              Phil: [30, 30, 21, 23],
              Col: [29, 23, 25, 18],
              "1Thess": [10, 20, 13, 18, 28],
              "2Thess": [12, 17, 18],
              "1Tim": [20, 15, 16, 16, 25, 21],
              "2Tim": [18, 26, 17, 22],
              Titus: [16, 15, 15],
              Phlm: [25],
              Heb: [14, 18, 19, 16, 14, 20, 28, 13, 28, 39, 40, 29, 25],
              Jas: [27, 26, 18, 17, 20],
              "1Pet": [25, 25, 22, 19, 14],
              "2Pet": [21, 22, 18],
              "1John": [10, 29, 24, 21, 21],
              "2John": [13],
              "3John": [15],
              Jude: [25],
              Rev: [20, 29, 22, 11, 14, 17, 17, 13, 21, 11, 19, 17, 18, 20, 8, 21, 18, 24, 21, 15, 27, 21],
              Tob: [22, 14, 17, 21, 22, 18, 16, 21, 6, 13, 18, 22, 17, 15],
              Jdt: [16, 28, 10, 15, 24, 21, 32, 36, 14, 23, 23, 20, 20, 19, 14, 25],
              GkEsth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 13, 12, 6, 18, 19, 16, 24],
              Wis: [16, 24, 19, 20, 23, 25, 30, 21, 18, 21, 26, 27, 19, 31, 19, 29, 21, 25, 22],
              Sir: [30, 18, 31, 31, 15, 37, 36, 19, 18, 31, 34, 18, 26, 27, 20, 30, 32, 33, 30, 31, 28, 27, 27, 34, 26, 29, 30, 26, 28, 25, 31, 24, 33, 31, 26, 31, 31, 34, 35, 30, 22, 25, 33, 23, 26, 20, 25, 25, 16, 29, 30],
              Bar: [22, 35, 37, 37, 9],
              PrAzar: [68],
              Sus: [64],
              Bel: [42],
              SgThree: [39],
              EpJer: [73],
              "1Macc": [64, 70, 60, 61, 68, 63, 50, 32, 73, 89, 74, 53, 53, 49, 41, 24],
              "2Macc": [36, 32, 40, 50, 27, 31, 42, 36, 29, 38, 38, 45, 26, 46, 39],
              "3Macc": [29, 33, 30, 21, 51, 41, 23],
              "4Macc": [35, 24, 21, 26, 38, 35, 23, 29, 32, 21, 27, 19, 27, 20, 32, 25, 24, 24],
              "1Esd": [58, 30, 24, 63, 73, 34, 15, 96, 55],
              "2Esd": [40, 48, 36, 52, 56, 59, 70, 63, 47, 59, 46, 51, 58, 48, 63, 78],
              PrMan: [15],
              Ps151: [7]
            }
          }
        };
    this.systems.current = structuredClone(this.systems.default);
  }
};

var bcv_grammar_options_default = {
  ab: /^(?:(?:a|b|c|d|e))(?!\p{L})/iu,
  and: /^(?:(?:(?:and\.?\s*)|&))/i,
  c_explicit: /^[\s*]*(?:(?:chapter\.?\s*))[\s*]*/i,
  c_sep_eu: /^\x1f\x1f\x1f/i,
  c_sep_us: /^\x1f\x1f\x1f/i,
  cv_sep_weak: /^(?:[\s*]*["'][\s*]*|[\s*])+/i,
  cv_sep_eu: /^[\s*]*,+[\s*]*/i,
  cv_sep_us: /^[\s*]*(?::+|\.(?!\s*\.\s*\.))[\s*]*/i,
  ff: /^[\s*]*(?:(?:ff\.?\s*))(?![\p{L}\p{N}])(?:\.(?!\s*\.))?/iu,
  in_book_of: /^[\s*]*(?:from|of|in)[\s*]*(?:the[\s*]*book[\s*]*of[\s*]*)?/i,
  next: /^(?:\x1f\x1f\x1f)/i,
  ordinal: /^(?:th|st|nd|rd)/i,
  range: /^[\s*]*(?:[\-–—]|(?:to\.?\s*))+[\s*]*/i,
  sequence_eu: /^(?:[;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  sequence_us: /^(?:[,;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  space: /^[\s*]+/,
  title: /^[\s*]*(?:(?:title\.?\s*))(?!\p{L})[\s*]*/iu,
  v_explicit: /^[\s*]*(?:(?:verse\.?\s*))[\s*]*(?!\p{L})/iu
};
var regexps = bcv_regexps;
var translations = bcv_translations;
var grammar_options = bcv_grammar_options_default;
export {
  grammar_options,
  regexps,
  translations
};