var bcv_regexps = class {
  constructor() {
    this.books = [];
    this.languages = ["nep"];
    this.translations = [/ERV\b/gi];
    this.first = /1\.?\s*/;
    this.second = /2\.?\s*/;
    this.third = /3\.?\s*/;
    this.range_and = /(?:[&\u2013\u2014-]|and\.?\s*|(?:\x2d\.?\s*|–\.?\s*|—\.?\s*))/;
    this.range_only = /(?:[\u2013\u2014-]|(?:\x2d\.?\s*|–\.?\s*|—\.?\s*))/;
    this.match_end_split = /\d\W*(?:title)|\d\W*(?:ff)(?:[\s*]*\.)?|\d[\s*]*(?:(?:[a-e](?!\w)))|\x1e(?:[\s*]*[)\]\uff09])?|[\d\x1f]/gi;
    this.control = /[\x1e\x1f]/g;
    this.escaped_passage = /(?:^|[^\x1e\x1f\p{L}\p{N}])((?:(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:[\u2013\u2014\-]|through|thru|to)\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:\d+(?:th|nd|st)\s*ch(?:apter|a?pt\.?|a?p?\.?)?\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*))?\x1f(\d+)(?:\/\d+)?\x1f(?:\/\d+\x1f|[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—]|title\.?\s*(?![a-z])|(?:(?:chapter\.?\s*)|(?:verse\.?\s*)|(?:ff\.?\s*)|(?:and\.?\s*)|(?:[\-–—]\.?\s*))|(?:[a-e]\.?\s*(?!\w))(?!\w)|$)+)/giu;
    this.pre_book = /(?:^|(?<=[^\p{L}]))/gu;
    this.pre_number_book = /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))/gu;
    this.post_book = /(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/gu;
    this.all_books = [
          {
            osis: ["Ps"],
            testament: "a",
            extra: "2",
            regexp: /\b(Ps151)(?=\.1\b)/g
          },
          {
            osis: ["Gen"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:उत(?:्पत(?:्त(?:ि(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|त(?:ि(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|पत(?:्त(?:ि(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|त(?:ि(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|utpattiko\s*pustak|utpattiko|Gen))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Exod"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:prastʰ[aā]nko\s*pustak|प(?:्रस(?:्थ(?:ान(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|न(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|थ(?:ान(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|न(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|रस(?:्थ(?:ान(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|न(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|थ(?:ान(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|न(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)))|prastʰ[aā]nko|Exod))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bel"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bel)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lev"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:lev[iī]har[uū]ko(?:\s*pustak)?|ल(?:ेव(?:ी?हर(?:ूको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक))|ि)|व(?:ी?हर(?:ूको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक))|ि))|ल(?:ेव(?:ी?हर(?:ूको?|को?)|ी)?|व(?:ी?हर(?:ूको?|को?)|ी)?)|Lev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Num"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:gant[iī]ko\s*pustak|गन(?:्त(?:ी(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|त(?:ी(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|gant[iī]ko|Num))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sir"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sir)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Wis"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Wis)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yarmiy[aā]ko\s*vil[aā]p|यर(?:्म(?:िय(?:ाक(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प))|क(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प)))|य(?:ाक(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प))|क(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प))))|म(?:िय(?:ाक(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प))|क(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प)))|य(?:ाक(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प))|क(?:ो\s*व(?:िला?प|ला?प)|\s*व(?:िला?प|ला?प)))))|व(?:िला?प|ला?प)|Lam))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["EpJer"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(EpJer)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rev"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:y[uū]hann[aā]l[aā][iī]\s*bʰaeko\s*prak[aā][sš]|य(?:ूहन(?:्न(?:ाल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श)))|ल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))))|न(?:ाल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श)))|ल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श)))))|हन(?:्न(?:ाल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श)))|ल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))))|न(?:ाल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श)))|ल(?:ाई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))|ई\s*भएक(?:ो\s*प(?:्रका?श|रका?श)|\s*प(?:्रका?श|रका?श))))))|प(?:्रका?श|रका?श)|Rev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrMan"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrMan)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Deut"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:vyavastʰ[aā]ko\s*pustak|व(?:्य(?:वस(?:(?:्थ(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक))|थ(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक)))|(?:्थ(?:ा(?:को?)?|को?)?|थ(?:ा(?:को?)?|को?)?))|ावस(?:्था?|था?))|य(?:वस(?:(?:्थ(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक))|थ(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक)))|(?:्थ(?:ा(?:को?)?|को?)?|थ(?:ा(?:को?)?|को?)?))|ावस(?:्था?|था?)))|vyavastʰ[aā]ko|Deut))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Josh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yaho[sš][uū]ko\s*pustak|यह(?:ोश(?:ू(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|श(?:ू(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|yaho[sš][uū]ko|Josh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Judg"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ny[aā]yakartt[aā]har[uū]ko\s*pustak|न(?:्य(?:ायकर(?:्त(?:्ताहरूको\s*पुस्तक|ा?हर(?:ूक(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|्त(?:ाहर(?:ूको?|क)|हरू?क)|ता?हरू?को|्त(?:हरू?क|ाहरक)ो|ता?हरू?क|ा)?|ता?हर(?:ूक(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|त्?ता?हरू?को|त्?ता?हरू?क|ता?)|(?:यकर्?ता|यकर्?त)हर(?:ूक(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|यकर्?त्?ता?हरू?को|यकर्?त्?ता?हरू?क|यकर्?ता|यकर्?त)|(?:(?:य(?:ायकर्?त|यकर्त)|ययकरत)ा|(?:य(?:ायकर्?त|यकर्त)|ययकरत))हर(?:ूक(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|(?:(?:(?:(?:य(?:ायकर्?त|यकर्त)्?त|ययकरत्त)ा?ह|ययकरतताह)रू?क|ययकरततहरूक)|ययकरततहरक)ो|(?:(?:य(?:ायकर्?त|यकर्त)्?त|ययकरत्त)ा?ह|ययकरतताह)रू?क|ययकरततहरक\s*पसतक|ययकरततहरूक|य(?:यकरत(?:तहरक)?|(?:ायकर्?त|यकर्त))|(?:य(?:ायकर्?त|यकर्त)|ययकरत)ा)|ny[aā]yakartt[aā]har[uū]ko|Judg))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ruth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:r[uū]tʰko(?:\s*pustak)?|र(?:ूथको?\s*प(?:ुस्?तक|स्?तक)|थको?\s*प(?:ुस्?तक|स्?तक))|र(?:ूथ(?:को?)?|थ(?:को?)?)|Ruth))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Isa"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ya[sš]əiy[aā]ko(?:\s*pustak)?|य(?:श(?:ैय(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक))|य(?:ाको?\s*प(?:ुस्?तक|स्?तक)|को?\s*प(?:ुस्?तक|स्?तक)))|ेशै?या)|य(?:श(?:ैय(?:ा(?:को?)?|को?)?|य(?:ा(?:को?)?|को?)?)|ेशै?य)|Isa))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:[sš]am[uū]elko|श(?:म(?:(?:ू?एलको|(?:ूएलक?|एलक?))|ुएल)|ामु?एल))|\s*(?:[sš]am[uū]elko|श(?:म(?:(?:ू?एलको|(?:ूएलक?|एलक?))|ुएल)|ामु?एल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:[sš]am[uū]elko|श(?:म(?:(?:ू?एलको|(?:ूएलक?|एलक?))|ुएल)|ामु?एल))|\s*(?:[sš]am[uū]elko|श(?:म(?:(?:ू?एलको|(?:ूएलक?|एलक?))|ुएल)|ामु?एल))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:शम(?:ूएलक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))|एलक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))))|2(?:\s*शमू?एल|Sam)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:शम(?:ूएलक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|एलक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))|[sš]am[uū]elko\s*pustak|1(?:\s*शमू?एल|Sam)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:r[aā]ǳ[aā]har[uū]ko|र(?:(?:ाजा?हरू?को|जा?हरू?को)|(?:ाज(?:ा?हरू?क|ा)?|ज(?:ा?हरू?क|ा)?)))|\s*(?:r[aā]ǳ[aā]har[uū]ko|र(?:(?:ाजा?हरू?को|जा?हरू?को)|(?:ाज(?:ा?हरू?क|ा)?|ज(?:ा?हरू?क|ा)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:r[aā]ǳ[aā]har[uū]ko|र(?:(?:ाजा?हरू?को|जा?हरू?को)|(?:ाज(?:ा?हरू?क|ा)?|ज(?:ा?हरू?क|ा)?)))|\s*(?:r[aā]ǳ[aā]har[uū]ko|र(?:(?:ाजा?हरू?को|जा?हरू?को)|(?:ाज(?:ा?हरू?क|ा)?|ज(?:ा?हरू?क|ा)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:र(?:ाजाहरूको\s*दोस्रो\s*पुस्|जहरक\s*दसर\s*पस)तक|2(?:(?:\s*रा?जा|Kgs)|\s*रा?ज)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:र(?:ाज(?:ाहर(?:ूक\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक))|क\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक)))|हर(?:ूक\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक))|क\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक))))|ज(?:ाहर(?:ूक\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक))|क\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक)))|हर(?:ूक\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक))|क\s*पह(?:िल\s*प(?:ुस्?तक|स्?तक)|ल\s*प(?:ुस्?तक|स्?तक)))))|r[aā]ǳ[aā]har[uū]ko\s*pustak|1(?:\s*रा?जा|Kgs)|1\s*रा?ज))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:itih[aā]sko|इत(?:िह(?:ास(?:को?)?|स(?:को?)?)|ह(?:ास(?:को?)?|स(?:को?)?)))|\s*(?:itih[aā]sko|इत(?:िह(?:ास(?:को?)?|स(?:को?)?)|ह(?:ास(?:को?)?|स(?:को?)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:itih[aā]sko|इत(?:िह(?:ास(?:को?)?|स(?:को?)?)|ह(?:ास(?:को?)?|स(?:को?)?)))|\s*(?:itih[aā]sko|इत(?:िह(?:ास(?:को?)?|स(?:को?)?)|ह(?:ास(?:को?)?|स(?:को?)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:इत(?:िह(?:ासक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))|सक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))))|ह(?:ासक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))|सक(?:ो\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|\s*द(?:ोस(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|स(?:्र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|र(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))))|2(?:\s*इत(?:िहा?स|हा?स)|Chr)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:इत(?:िह(?:ासक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|सक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))))|ह(?:ासक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))|सक(?:ो\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))|\s*पह(?:िल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ल(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))))))|itih[aā]sko\s*pustak|1(?:\s*इत(?:िहा?स|हा?स)|Chr)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezra"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:एज(?:्र(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|र(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|eǳr[aā]ko|Ezra))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Neh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:nahemy[aā]hko\s*pustak|नह(?:ेम(?:्य(?:ाह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|य(?:ाह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|म(?:्य(?:ाह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|य(?:ाह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ह(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)))|nahemy[aā]hko|Neh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["GkEsth"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(GkEsth)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Esth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:estarko\s*pustak|एस(?:्तर(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|तर(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|estarko|Esth))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Job"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:अय(?:्य(?:ूब(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ब(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|य(?:ूब(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|ब(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|ayy[uū]bko\s*pustak|ayy[uū]bko|Job))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ps"],
            testament: "oa",
            testament_books: { Ps: "oa" },
            regexp: /(?:^|(?<=[^\p{L}]))((?:bʰaǳansa[mṃ]grah|भजनस(?:ंग्?रह|ग्?रह)|भजन|Ps))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrAzar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrAzar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Prov"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:hitopade[sš]ko\s*pustak|ह(?:ित(?:ोपद(?:ेश(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|श(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|पद(?:ेश(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|श(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|त(?:ोपद(?:ेश(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|श(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|पद(?:ेश(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|श(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)))|hitopade[sš]ko|Prov))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eccl"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:upade[sš]akko\s*pustak|उपद(?:ेशक(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|शक(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|upade[sš]akko|Eccl))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["SgThree"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(SgThree)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Song"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:sulem[aā]nko\s*[sš]re[sṣ][tṭ]ʰag[iī]t|स(?:ुल(?:ेम(?:ानक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))))|नक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))))|म(?:ानक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))))|नक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))))))|ल(?:ेम(?:ानक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))))|नक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))))|म(?:ानक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))))|नक(?:ो\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|\s*श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))))))|श(?:्र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त))|र(?:ेष(?:्ठगी?त|ठगी?त)|ष(?:्ठगी?त|ठगी?त)))|Song))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jer"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yarmiy[aā]ko\s*pustak|यर(?:्म(?:िय(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|य(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|म(?:िय(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|य(?:ा(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|yarmiy[aā]ko|Jer))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezek"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:(?:iǳakielko\s*pusta|Eze)k|इजक(?:िएल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|एल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|iǳakielko))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Dan"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:d[aā]niyalko\s*pustak|द(?:ान(?:ियल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|यल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?)|न(?:ियल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?|यल(?:क(?:ो?\s*प(?:ुस्?तक|स्?तक)|ो)?)?))|d[aā]niyalko|Dan))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ह(?:ोश(?:े?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|े)?|श(?:े?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|े)?)|ho[sš]e|Hos))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Joel"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:य(?:ोएल(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|एल(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?)|[Jy]oel))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Amos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:आम(?:ोस(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|स(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?)|[Aaā]mos|अमो?स))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Obad"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ओबद(?:िय(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?|य(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?)|obadiy[aā]|Obad))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jonah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:य(?:ोन(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?|न(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?)|Jonah|yon[aā]))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mic"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:म(?:ीक(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?|क(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?|िका?)|m[iī]k[aā]|Mic))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Nah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:नह(?:ूम(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|म(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?)|nah[uū]m|Nah))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hab"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:हबक(?:ूक(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|क(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?)|habak[uū]k|Hab))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zeph"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:सपन(?:्य(?:ाह(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|ह(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?)|य(?:ाह(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?|ह(?:क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक)))?))|sapany[aā]h|Zeph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hag"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ह(?:ाग(?:्ग(?:ै?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ै)?|ग(?:ै?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ै)?)|ग(?:्ग(?:ै?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ै)?|ग(?:ै?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ै)?))|h[aā]ggəi|Hag))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zech"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:जकर(?:िय(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?|य(?:ा?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ा)?)|jakariy[aā]|Zech))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mal"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:मल(?:ाक(?:ी?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ी)?|क(?:ी?क(?:ो\s*प(?:ुस्?तक|स्?तक)|\s*प(?:ुस्?तक|स्?तक))|ी)?)|mal[aā]k[iī]|Mal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Matt"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:matt[iī]le\s*lekʰeko\s*susm[aā]c[aā]r|मत(?:्त(?:ीले\s*लेखेको\s*सुसमाचार|ी?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|ी(?:ले?)?|ले|ल|ि)?|ती?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|त(?:ल\s*लखक\s*ससमचर|(?:(?:ीले|(?:ले|ि))|(?:ील|(?:ल|ी)?))))|matt[iī]le|Matt))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mark"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:mark[uū]sle\s*lekʰeko\s*susm[aā]c[aā]r|मर(?:्क(?:ू(?:स(?:ले\s*लेखेको\s*सुसमाचार|क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))))|श)|सक(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|सले|श)|कू?सक(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|क(?:सल\s*लखक\s*ससमचर|(?:ूसले|(?:सले|ूश|श))))|mark[uū]sle|मर(?:्क(?:ूस(?:ले?)?|सल?)|क(?:ूसल?|सल?))|मर्?कुस|र(?:्मकू?स|मकू?स)|Mark))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Luke"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:l[uū]k[aā]le\s*lekʰeko\s*susm[aā]c[aā]r|ल(?:ूक(?:ाले\s*लेखेको\s*सुसमाचार|ा?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|ा(?:ले?)?|ले|ल)?|का?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|कल\s*लखक\s*ससमचर|काले|काल|कले|ुका|क(?:ल|ा)?|ुक)|l[uū]k[aā]le|Luke))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))|\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))|\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(3(?:\.\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))|\s*(?:y[uū]hann[aā]ko|य(?:ूहन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))|हन(?:्न(?:ाको?|को?)|न(?:ाको?|को?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:y[uū]hann[aā]ko\s*pahilo\s*patra|य(?:ूहन(?:्न(?:ाक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|क(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))))|न(?:ाक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|क(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))))|हन(?:्न(?:ाक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|क(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))))|न(?:ाक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|क(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))))))|1(?:\s*य(?:ूहन्?ना|हन्?ना)|John)|1\s*य(?:ूहन्?न|हन्?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:य(?:ूहन(?:्न(?:ाक(?:ो\s*द(?:ोस(?:्(?:त्रो\s*पत्र|रो?\s*पत्र|रो?\s*पतर)|रो?\s*पत्र|रो?\s*पतर)|स्?रो?\s*पत्र|स्?रो?\s*पतर)|\s*दो?स्?रो?\s*पत्र|\s*दो?स्?रो?\s*पतर)|को?\s*दो?स्?रो?\s*पत्र|को?\s*दो?स्?रो?\s*पतर)|ना?को?\s*दो?स्?रो?\s*पत्र|ना?को?\s*दो?स्?रो?\s*पतर)|(?:(?:(?:(?:हन(?:्ना?क|नाक)ो?\s*|हननको\s*)दो?स|हननक\s*दोस)्?र|हननक\s*दस्?र)ो?\s*पत्|हननक\s*दसतर\s*पत)र|(?:(?:(?:हन(?:्ना?क|नाक)ो?\s*|हननको\s*)दो?स|हननक\s*दोस)्?र|हननक\s*दस्?र)ो?\s*पतर)|y[uū]hann[aā]ko\s*dostro\s*patra|2(?:\s*य(?:ूहन्?ना|हन्?ना)|John)|2\s*य(?:ूहन्?न|हन्?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:य(?:ूहन(?:्न(?:ाक(?:ो\s*त(?:ेस(?:्(?:त्रो\s*पत्र|रो?\s*पत्र|रो?\s*पतर)|रो?\s*पत्र|रो?\s*पतर)|स्?रो?\s*पत्र|स्?रो?\s*पतर)|\s*ते?स्?रो?\s*पत्र|\s*ते?स्?रो?\s*पतर)|को?\s*ते?स्?रो?\s*पत्र|को?\s*ते?स्?रो?\s*पतर)|ना?को?\s*ते?स्?रो?\s*पत्र|ना?को?\s*ते?स्?रो?\s*पतर)|(?:(?:(?:(?:हन(?:्ना?क|नाक)ो?\s*|हननको\s*)ते?स|हननक\s*तेस)्?र|हननक\s*तस्?र)ो?\s*पत्|हननक\s*तसतर\s*पत)र|(?:(?:(?:हन(?:्ना?क|नाक)ो?\s*|हननको\s*)ते?स|हननक\s*तेस)्?र|हननक\s*तस्?र)ो?\s*पतर)|y[uū]hann[aā]ko\s*testro\s*patra|3(?:\s*य(?:ूहन्?ना|हन्?ना)|John)|3\s*य(?:ूहन्?न|हन्?न)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))|\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))|\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(3(?:\.\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))|\s*य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))(य(?:ूहन(?:्ना?|ना?)|हन(?:्ना?|ना?)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:y[uū]hann[aā]le\s*lekʰeko\s*susm[aā]c[aā]r|य(?:ूहन(?:्न(?:ाले\s*लेखेको\s*सुसमाचार|ा?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|ले)|ना?क(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|ना?ले|ा)|(?:हन्ना?क|हनना?क)(?:ो\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र))|\s*स(?:ुसम(?:ाचा?र|चा?र)|सम(?:ाचा?र|चा?र)))|हननल\s*लखक\s*ससमचर|ूहन(?:्न(?:ा(?:ले?)?|ल)?|ना?ल|ना?)?|हन(?:्ना?ल|नाल)े|(?:ूहा|ह[ाू])न(?:्ना?|ना?)|हन(?:(?:्ना?ल|नाल)|(?:्ना?|(?:(?:नल?)?|ना)))|ुहन(?:्ना?|ना?)|हन(?:नले|ा))|y[uū]hann[aā]le|John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Acts"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:प(?:्र(?:ेर(?:ितहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म))|तहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म)))|र(?:ितहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म))|तहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म))))|र(?:ेर(?:ितहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म))|तहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म)))|र(?:ितहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म))|तहर(?:ूक(?:ा\s*का?म|\s*का?म)|क(?:ा\s*का?म|\s*का?म)))))|prerithar[uū]k[aā]\s*k[aā]m|प(?:्र(?:ेरि?त|रि?त)|र(?:ेरि?त|रि?त))|Acts))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rom"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:र(?:ोमी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)))|मी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))))|rom[iī]har[uū]l[aā][iī](?:\s*patra)?|र(?:ोम(?:ी?हर(?:ूला?ई|ला?ई)|ी)?|म(?:ी?हर(?:ूला?ई|ला?ई)|ी)?)|Rom))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:korintʰ[iī]har[uū]l[aā][iī]|क(?:(?:ोर(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई)))|र(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))))|(?:ोर(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?))|र(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?)))))|\s*(?:korintʰ[iī]har[uū]l[aā][iī]|क(?:(?:ोर(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई)))|र(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))))|(?:ोर(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?))|र(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?)))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:korintʰ[iī]har[uū]l[aā][iī]|क(?:(?:ोर(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई)))|र(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))))|(?:ोर(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?))|र(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?)))))|\s*(?:korintʰ[iī]har[uū]l[aā][iī]|क(?:(?:ोर(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई)))|र(?:िन(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))|न(?:्थी?हर(?:ूला?ई|ला?ई)|थी?हर(?:ूला?ई|ला?ई))))|(?:ोर(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?))|र(?:िन(?:्थी?|थी?)|न(?:्थी?|थी?)))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:क(?:ोरिन्थीहरूलाई\s*(?:पावलको\s*दोस|दोस्त)्रो\s*पत्र|रनथहरलई\s*(?:पवलक\s*दस|दसत)र\s*पतर)|korintʰ[iī]har[uū]l[aā][iī]\s*dostro\s*patra|2(?:\s*क(?:ोर(?:िन्?थी|न्?थी)|र(?:िन्?थी|न्?थी))|Cor)|2\s*क(?:ोर(?:िन्?थ|न्?थ)|र(?:िन्?थ|न्?थ))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:क(?:ोरिन्थीहरूलाई\s*प(?:ावलको\s*प)?हिलो\s*पत्र|रनथहरलई\s*प(?:वलक\s*प)?हल\s*पतर)|korintʰ[iī]har[uū]l[aā][iī]\s*pahilo\s*patra|1(?:\s*क(?:ोर(?:िन्?थी|न्?थी)|र(?:िन्?थी|न्?थी))|Cor)|1\s*क(?:ोर(?:िन्?थ|न्?थ)|र(?:िन्?थ|न्?थ))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Gal"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:गल(?:ाती?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)))|ती?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))))|gal[aā]t[iī]har[uū]l[aā][iī](?:\s*patra)?|गल(?:ात(?:ी?हर(?:ूला?ई|ला?ई)|ी)?|त(?:ी?हर(?:ूला?ई|ला?ई)|ी)?)|Gal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eph"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:एफ(?:िसी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)))|सी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))))|epʰis[iī]har[uū]l[aā][iī](?:\s*patra)?|एफ(?:िस(?:ी?हर(?:ूला?ई|ला?ई)|ी)?|स(?:ी?हर(?:ूला?ई|ला?ई)|ी)?)|Eph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phil"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:फ(?:िल(?:िप(?:्प(?:ीहर(?:ूल(?:ाई\s*प(?:ावलको\s*पत्र|त्?र)|ई\s*पत्?र)|ल(?:ाई\s*पत्?र|ई\s*पत्?र))|हर(?:ूल(?:ाई\s*पत्?र|ई\s*पत्?र)|ल(?:ाई\s*पत्?र|ई\s*पत्?र)))|पी?हर(?:ूल(?:ाई\s*पत्?र|ई\s*पत्?र)|ल(?:ाई\s*पत्?र|ई\s*पत्?र)))|प्?पी?हर(?:ूल(?:ाई\s*पत्?र|ई\s*पत्?र)|ल(?:ाई\s*पत्?र|ई\s*पत्?र)))|(?:ल(?:िप्?प|प्प)ी?ह|लपपीह)र(?:ूल(?:ाई\s*पत्?र|ई\s*पत्?र)|ल(?:ाई\s*पत्?र|ई\s*पत्?र))|लपपहर(?:ल(?:ई\s*प(?:वलक\s*पतर|त्?र)|ाई\s*पत्?र)|ूल(?:ाई\s*पत्?र|ई\s*पत्?र)))|pʰilipp[iī]har[uū]l[aā][iī](?:\s*patra)?|फ(?:िल(?:िप(?:्प(?:ी(?:हरूलाई)?|ीहरूलई|ीहरला?ई|हर(?:ूला?ई|ला?ई))?|पी?हर(?:ूला?ई|ला?ई)|पी?)|प्?पी?हर(?:ूला?ई|ला?ई)|प्?पी?)|(?:ल(?:िप्?प|प्प)ी?ह|लपपीह)र(?:ूला?ई|ला?ई)|लपपहरूला?ई|लपपहरलाई|लपप(?:(?:हरलई)?|ी)|ल(?:िप्?प|प्प)ी?)|Phil))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Col"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:कलस(?:्सी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)))|सी?हर(?:ूल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))|ल(?:ाई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र)|ई\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))))|kalass[iī]har[uū]l[aā][iī](?:\s*patra)?|कलस(?:्स(?:ी?हर(?:ूला?ई|ला?ई)|ी)?|स(?:ी?हर(?:ूला?ई|ला?ई)|ी)?)|Col))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:tʰissalonik[iī]har[uū]l[aā][iī]|थ(?:(?:िस(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))))|स(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))))|(?:िस(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?)))|स(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))))))|\s*(?:tʰissalonik[iī]har[uū]l[aā][iī]|थ(?:(?:िस(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))))|स(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))))|(?:िस(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?)))|स(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:tʰissalonik[iī]har[uū]l[aā][iī]|थ(?:(?:िस(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))))|स(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))))|(?:िस(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?)))|स(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))))))|\s*(?:tʰissalonik[iī]har[uū]l[aā][iī]|थ(?:(?:िस(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))))|स(?:्सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))|सल(?:ोन(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई))|न(?:िकी?हर(?:ूला?ई|ला?ई)|की?हर(?:ूला?ई|ला?ई)))))|(?:िस(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?)))|स(?:्सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))|सल(?:ोन(?:िकी?|की?)|न(?:िकी?|की?))))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:थ(?:िस्सलोनिकीहरूलाई\s*(?:पावलको\s*दोस|दोस्त)्रो\s*पत्र|ससलनकहरलई\s*(?:पवलक\s*दस|दसत)र\s*पतर)|tʰissalonik[iī]har[uū]l[aā][iī]\s*dostro\s*patra|2(?:\s*थ(?:िस(?:्सल(?:ोनि?की|नि?की)|सल(?:ोनि?की|नि?की))|स(?:्सल(?:ोनि?की|नि?की)|सल(?:ोनि?की|नि?की)))|Thess)|2\s*थ(?:िस(?:्सल(?:ोनि?क|नि?क)|सल(?:ोनि?क|नि?क))|स(?:्सल(?:ोनि?क|नि?क)|सल(?:ोनि?क|नि?क)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:थ(?:िस्सलोनिकीहरूलाई\s*प(?:ावलको\s*प)?हिलो\s*पत्र|ससलनकहरलई\s*प(?:वलक\s*प)?हल\s*पतर)|tʰissalonik[iī]har[uū]l[aā][iī]\s*pahilo\s*patra|1(?:\s*थ(?:िस(?:्सल(?:ोनि?की|नि?की)|सल(?:ोनि?की|नि?की))|स(?:्सल(?:ोनि?की|नि?की)|सल(?:ोनि?की|नि?की)))|Thess)|1\s*थ(?:िस(?:्सल(?:ोनि?क|नि?क)|सल(?:ोनि?क|नि?क))|स(?:्सल(?:ोनि?क|नि?क)|सल(?:ोनि?क|नि?क)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:timotʰ[iī]l[aā][iī]|त(?:(?:िम(?:ोथी?ला?ई|थी?ला?ई)|म(?:ोथी?ला?ई|थी?ला?ई))|(?:िम(?:ोथी?|थी?)|म(?:ोथी?|थी?))))|\s*(?:timotʰ[iī]l[aā][iī]|त(?:(?:िम(?:ोथी?ला?ई|थी?ला?ई)|म(?:ोथी?ला?ई|थी?ला?ई))|(?:िम(?:ोथी?|थी?)|म(?:ोथी?|थी?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:timotʰ[iī]l[aā][iī]|त(?:(?:िम(?:ोथी?ला?ई|थी?ला?ई)|म(?:ोथी?ला?ई|थी?ला?ई))|(?:िम(?:ोथी?|थी?)|म(?:ोथी?|थी?))))|\s*(?:timotʰ[iī]l[aā][iī]|त(?:(?:िम(?:ोथी?ला?ई|थी?ला?ई)|म(?:ोथी?ला?ई|थी?ला?ई))|(?:िम(?:ोथी?|थी?)|म(?:ोथी?|थी?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:त(?:िमोथीलाई\s*(?:पावलको\s*दोस|दोस्त)्रो\s*पत्र|मथलई\s*(?:पवलक\s*दस|दसत)र\s*पतर)|timotʰ[iī]l[aā][iī]\s*dostro\s*patra|2(?:\s*त(?:िमो?थी|मो?थी)|Tim)|2\s*त(?:िमो?थ|मो?थ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:त(?:िम(?:ोथ(?:ील(?:ाई(?:र्\s*पावलको\s*पहिलो\s*पत्र|\s*पह(?:िलो?\s*पत्|लो?\s*पत्)र|\s*पह(?:िलो?\s*पतर|लो?\s*पतर))|ई\s*पह(?:िलो?\s*पत्|लो?\s*पत्)र|ई\s*पह(?:िलो?\s*पतर|लो?\s*पतर))|ला?ई\s*पह(?:िलो?\s*पत्|लो?\s*पत्)र|ला?ई\s*पह(?:िलो?\s*पतर|लो?\s*पतर))|थी?ला?ई\s*पह(?:िलो?\s*पत्|लो?\s*पत्)र|थी?ला?ई\s*पह(?:िलो?\s*पतर|लो?\s*पतर))|(?:मथलईर\s*पवलक\s*पहल\s*पत|(?:(?:म(?:ोथी?ल|थील)ा?ई|मथलाई)|मथलई)\s*पह(?:िलो?\s*पत्|लो?\s*पत्))र|(?:(?:म(?:ोथी?ल|थील)ा?ई|मथलाई)|मथलई)\s*पह(?:िलो?\s*पतर|लो?\s*पतर))|timotʰ[iī]l[aā][iī]\s*pahilo\s*patra|1(?:\s*त(?:िमो?थी|मो?थी)|Tim)|1\s*त(?:िमो?थ|मो?थ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Titus"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:त(?:ीतस(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?|तस(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?)|t[iī]tasl[aā][iī]\s*patra|t[iī]tasl[aā][iī]|Titus))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phlm"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:फ(?:िल(?:ेम(?:ोन(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?|न(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?)|म(?:ोन(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?|न(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?))|ल(?:ेम(?:ोन(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?|न(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?)|म(?:ोन(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?|न(?:ल(?:ाई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?|ई(?:\s*प(?:ावलक(?:ो\s*पत्?र|\s*पत्?र)|वलक(?:ो\s*पत्?र|\s*पत्?र)|त्?र))?))?)))|pʰilemonl[aā][iī]\s*patra|pʰilemonl[aā][iī]|Phlm))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Heb"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ह(?:िब(?:्र(?:ूहर(?:ूक(?:ो\s*न(?:िम(?:्ति\s*पत्र|ति)|म्?ति)|\s*न(?:िम्?ति|म्?ति))|क(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति)))|हर(?:ूक(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))|क(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))))|रू?हर(?:ूक(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))|क(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))))|ब(?:्रू?ह|रूह)र(?:ूक(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))|क(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति)))|बरहर(?:ूक(?:ो\s*न(?:िम्?ति|म्?ति)|\s*न(?:िम्?ति|म्?ति))|क(?:\s*न(?:म(?:त(?:\s*पतर|ि)|्ति)|िम्?ति)|ो\s*न(?:िम्?ति|म्?ति))))|hibr[uū]har[uū]ko\s*nimti(?:\s*patra)?|ह(?:िब(?:्र(?:ू(?:हरूको\s*निम्ति?)?|ूहरूको\s*निमत|ूहरूको\s*नम्?त|ूहरूक\s*न(?:िम्?त|म्?त)|ूहरक(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))|हर(?:ूक(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))|क(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))))?|रू?हर(?:ूक(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))|क(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त)))|रू?)|ब(?:्रू?ह|रूह)र(?:ूक(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))|क(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त)))|ब(?:रहरूक(?:ो\s*न(?:िम्?त|म्?त)|\s*न(?:िम्?त|म्?त))|(?:रहरको\s*न(?:िम्?त|म्?त)|(?:रहरक\s*निम्?त|(?:रहरक\s*नम्त|(?:र(?:(?:हरक\s*नमत)?|ू)|्रू?))))))|Heb))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jas"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:y[aā]k[uū]bko\s*patra|य(?:ाक(?:ूब(?:क(?:ो?\s*पत्?र|ो)?)?|ब(?:क(?:ो?\s*पत्?र|ो)?)?)|क(?:ूब(?:क(?:ो?\s*पत्?र|ो)?)?|ब(?:क(?:ो?\s*पत्?र|ो)?)?))|y[aā]k[uū]bko|Jas))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1(?:\.\s*(?:patrusko|पत(?:्र(?:ुस(?:को?)?|स(?:को?)?)|र(?:ुस(?:को?)?|स(?:को?)?)))|\s*(?:patrusko|पत(?:्र(?:ुस(?:को?)?|स(?:को?)?)|र(?:ुस(?:को?)?|स(?:को?)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2(?:\.\s*(?:patrusko|पत(?:्र(?:ुस(?:को?)?|स(?:को?)?)|र(?:ुस(?:को?)?|स(?:को?)?)))|\s*(?:patrusko|पत(?:्र(?:ुस(?:को?)?|स(?:को?)?)|र(?:ुस(?:को?)?|स(?:को?)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:पत(?:्र(?:ुसक(?:ो\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र)))|\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))))|सक(?:ो\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र)))|\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र)))))|र(?:ुसक(?:ो\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र)))|\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))))|सक(?:ो\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र)))|\s*द(?:ोस(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|स(?:्(?:त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))|त(?:्र(?:ो\s*पत्?र|\s*पत्?र)|र(?:ो\s*पत्?र|\s*पत्?र))|र(?:ो\s*पत्?र|\s*पत्?र))))))|patrusko\s*dostro\s*patra|2(?:\s*पत(?:्रु?स|रु?स)|Pet)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:patrusko\s*pahilo\s*patra|पत(?:्र(?:ुसक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|सक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))))|र(?:ुसक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))|सक(?:ो\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र))|\s*पह(?:िल(?:ो\s*पत्?र|\s*पत्?र)|ल(?:ो\s*पत्?र|\s*पत्?र)))))|1(?:\s*पत(?:्रु?स|रु?स)|Pet)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jude"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:yah[uū]d[aā]ko\s*patra|यह(?:ूद(?:ा(?:क(?:ो?\s*पत्?र|ो)?)?|क(?:ो?\s*पत्?र|ो)?)?|द(?:ा(?:क(?:ो?\s*पत्?र|ो)?)?|क(?:ो?\s*पत्?र|ो)?)?)|yah[uū]d[aā]ko|Jude))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Tob"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Tob)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jdt"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Jdt)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sus"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sus)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(3Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["4Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(4Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          }
        ];
  }
};

var bcv_translations = class {
  constructor() {
    this.aliases = { current: { system: "current", osis: "" }, default: { system: "default", osis: "" } };
    this.current_system = "default";
    this.systems = {
          current: {},
          default: {
            order: {
              Gen: 1,
              Exod: 2,
              Lev: 3,
              Num: 4,
              Deut: 5,
              Josh: 6,
              Judg: 7,
              Ruth: 8,
              "1Sam": 9,
              "2Sam": 10,
              "1Kgs": 11,
              "2Kgs": 12,
              "1Chr": 13,
              "2Chr": 14,
              Ezra: 15,
              Neh: 16,
              Esth: 17,
              Job: 18,
              Ps: 19,
              Prov: 20,
              Eccl: 21,
              Song: 22,
              Isa: 23,
              Jer: 24,
              Lam: 25,
              Ezek: 26,
              Dan: 27,
              Hos: 28,
              Joel: 29,
              Amos: 30,
              Obad: 31,
              Jonah: 32,
              Mic: 33,
              Nah: 34,
              Hab: 35,
              Zeph: 36,
              Hag: 37,
              Zech: 38,
              Mal: 39,
              Matt: 40,
              Mark: 41,
              Luke: 42,
              John: 43,
              Acts: 44,
              Rom: 45,
              "1Cor": 46,
              "2Cor": 47,
              Gal: 48,
              Eph: 49,
              Phil: 50,
              Col: 51,
              "1Thess": 52,
              "2Thess": 53,
              "1Tim": 54,
              "2Tim": 55,
              Titus: 56,
              Phlm: 57,
              Heb: 58,
              Jas: 59,
              "1Pet": 60,
              "2Pet": 61,
              "1John": 62,
              "2John": 63,
              "3John": 64,
              Jude: 65,
              Rev: 66,
              Tob: 67,
              Jdt: 68,
              GkEsth: 69,
              Wis: 70,
              Sir: 71,
              Bar: 72,
              PrAzar: 73,
              Sus: 74,
              Bel: 75,
              SgThree: 76,
              EpJer: 77,
              "1Macc": 78,
              "2Macc": 79,
              "3Macc": 80,
              "4Macc": 81,
              "1Esd": 82,
              "2Esd": 83,
              PrMan: 84
            },
            chapters: {
              Gen: [31, 25, 24, 26, 32, 22, 24, 22, 29, 32, 32, 20, 18, 24, 21, 16, 27, 33, 38, 18, 34, 24, 20, 67, 34, 35, 46, 22, 35, 43, 55, 32, 20, 31, 29, 43, 36, 30, 23, 23, 57, 38, 34, 34, 28, 34, 31, 22, 33, 26],
              Exod: [22, 25, 22, 31, 23, 30, 25, 32, 35, 29, 10, 51, 22, 31, 27, 36, 16, 27, 25, 26, 36, 31, 33, 18, 40, 37, 21, 43, 46, 38, 18, 35, 23, 35, 35, 38, 29, 31, 43, 38],
              Lev: [17, 16, 17, 35, 19, 30, 38, 36, 24, 20, 47, 8, 59, 57, 33, 34, 16, 30, 37, 27, 24, 33, 44, 23, 55, 46, 34],
              Num: [54, 34, 51, 49, 31, 27, 89, 26, 23, 36, 35, 16, 33, 45, 41, 50, 13, 32, 22, 29, 35, 41, 30, 25, 18, 65, 23, 31, 40, 16, 54, 42, 56, 29, 34, 13],
              Deut: [46, 37, 29, 49, 33, 25, 26, 20, 29, 22, 32, 32, 18, 29, 23, 22, 20, 22, 21, 20, 23, 30, 25, 22, 19, 19, 26, 68, 29, 20, 30, 52, 29, 12],
              Josh: [18, 24, 17, 24, 15, 27, 26, 35, 27, 43, 23, 24, 33, 15, 63, 10, 18, 28, 51, 9, 45, 34, 16, 33],
              Judg: [36, 23, 31, 24, 31, 40, 25, 35, 57, 18, 40, 15, 25, 20, 20, 31, 13, 31, 30, 48, 25],
              Ruth: [22, 23, 18, 22],
              "1Sam": [28, 36, 21, 22, 12, 21, 17, 22, 27, 27, 15, 25, 23, 52, 35, 23, 58, 30, 24, 42, 15, 23, 29, 22, 44, 25, 12, 25, 11, 31, 13],
              "2Sam": [27, 32, 39, 12, 25, 23, 29, 18, 13, 19, 27, 31, 39, 33, 37, 23, 29, 33, 43, 26, 22, 51, 39, 25],
              "1Kgs": [53, 46, 28, 34, 18, 38, 51, 66, 28, 29, 43, 33, 34, 31, 34, 34, 24, 46, 21, 43, 29, 53],
              "2Kgs": [18, 25, 27, 44, 27, 33, 20, 29, 37, 36, 21, 21, 25, 29, 38, 20, 41, 37, 37, 21, 26, 20, 37, 20, 30],
              "1Chr": [54, 55, 24, 43, 26, 81, 40, 40, 44, 14, 47, 40, 14, 17, 29, 43, 27, 17, 19, 8, 30, 19, 32, 31, 31, 32, 34, 21, 30],
              "2Chr": [17, 18, 17, 22, 14, 42, 22, 18, 31, 19, 23, 16, 22, 15, 19, 14, 19, 34, 11, 37, 20, 12, 21, 27, 28, 23, 9, 27, 36, 27, 21, 33, 25, 33, 27, 23],
              Ezra: [11, 70, 13, 24, 17, 22, 28, 36, 15, 44],
              Neh: [11, 20, 32, 23, 19, 19, 73, 18, 38, 39, 36, 47, 31],
              Esth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 3],
              Job: [22, 13, 26, 21, 27, 30, 21, 22, 35, 22, 20, 25, 28, 22, 35, 22, 16, 21, 29, 29, 34, 30, 17, 25, 6, 14, 23, 28, 25, 31, 40, 22, 33, 37, 16, 33, 24, 41, 30, 24, 34, 17],
              Ps: [6, 12, 8, 8, 12, 10, 17, 9, 20, 18, 7, 8, 6, 7, 5, 11, 15, 50, 14, 9, 13, 31, 6, 10, 22, 12, 14, 9, 11, 12, 24, 11, 22, 22, 28, 12, 40, 22, 13, 17, 13, 11, 5, 26, 17, 11, 9, 14, 20, 23, 19, 9, 6, 7, 23, 13, 11, 11, 17, 12, 8, 12, 11, 10, 13, 20, 7, 35, 36, 5, 24, 20, 28, 23, 10, 12, 20, 72, 13, 19, 16, 8, 18, 12, 13, 17, 7, 18, 52, 17, 16, 15, 5, 23, 11, 13, 12, 9, 9, 5, 8, 28, 22, 35, 45, 48, 43, 13, 31, 7, 10, 10, 9, 8, 18, 19, 2, 29, 176, 7, 8, 9, 4, 8, 5, 6, 5, 6, 8, 8, 3, 18, 3, 3, 21, 26, 9, 8, 24, 13, 10, 7, 12, 15, 21, 10, 20, 14, 9, 6],
              Prov: [33, 22, 35, 27, 23, 35, 27, 36, 18, 32, 31, 28, 25, 35, 33, 33, 28, 24, 29, 30, 31, 29, 35, 34, 28, 28, 27, 28, 27, 33, 31],
              Eccl: [18, 26, 22, 16, 20, 12, 29, 17, 18, 20, 10, 14],
              Song: [17, 17, 11, 16, 16, 13, 13, 14],
              Isa: [31, 22, 26, 6, 30, 13, 25, 22, 21, 34, 16, 6, 22, 32, 9, 14, 14, 7, 25, 6, 17, 25, 18, 23, 12, 21, 13, 29, 24, 33, 9, 20, 24, 17, 10, 22, 38, 22, 8, 31, 29, 25, 28, 28, 25, 13, 15, 22, 26, 11, 23, 15, 12, 17, 13, 12, 21, 14, 21, 22, 11, 12, 19, 12, 25, 24],
              Jer: [19, 37, 25, 31, 31, 30, 34, 22, 26, 25, 23, 17, 27, 22, 21, 21, 27, 23, 15, 18, 14, 30, 40, 10, 38, 24, 22, 17, 32, 24, 40, 44, 26, 22, 19, 32, 21, 28, 18, 16, 18, 22, 13, 30, 5, 28, 7, 47, 39, 46, 64, 34],
              Lam: [22, 22, 66, 22, 22],
              Ezek: [28, 10, 27, 17, 17, 14, 27, 18, 11, 22, 25, 28, 23, 23, 8, 63, 24, 32, 14, 49, 32, 31, 49, 27, 17, 21, 36, 26, 21, 26, 18, 32, 33, 31, 15, 38, 28, 23, 29, 49, 26, 20, 27, 31, 25, 24, 23, 35],
              Dan: [21, 49, 30, 37, 31, 28, 28, 27, 27, 21, 45, 13],
              Hos: [11, 23, 5, 19, 15, 11, 16, 14, 17, 15, 12, 14, 16, 9],
              Joel: [20, 32, 21],
              Amos: [15, 16, 15, 13, 27, 14, 17, 14, 15],
              Obad: [21],
              Jonah: [17, 10, 10, 11],
              Mic: [16, 13, 12, 13, 15, 16, 20],
              Nah: [15, 13, 19],
              Hab: [17, 20, 19],
              Zeph: [18, 15, 20],
              Hag: [15, 23],
              Zech: [21, 13, 10, 14, 11, 15, 14, 23, 17, 12, 17, 14, 9, 21],
              Mal: [14, 17, 18, 6],
              Matt: [25, 23, 17, 25, 48, 34, 29, 34, 38, 42, 30, 50, 58, 36, 39, 28, 27, 35, 30, 34, 46, 46, 39, 51, 46, 75, 66, 20],
              Mark: [45, 28, 35, 41, 43, 56, 37, 38, 50, 52, 33, 44, 37, 72, 47, 20],
              Luke: [80, 52, 38, 44, 39, 49, 50, 56, 62, 42, 54, 59, 35, 35, 32, 31, 37, 43, 48, 47, 38, 71, 56, 53],
              John: [51, 25, 36, 54, 47, 71, 53, 59, 41, 42, 57, 50, 38, 31, 27, 33, 26, 40, 42, 31, 25],
              Acts: [26, 47, 26, 37, 42, 15, 60, 40, 43, 48, 30, 25, 52, 28, 41, 40, 34, 28, 41, 38, 40, 30, 35, 27, 27, 32, 44, 31],
              Rom: [32, 29, 31, 25, 21, 23, 25, 39, 33, 21, 36, 21, 14, 23, 33, 27],
              "1Cor": [31, 16, 23, 21, 13, 20, 40, 13, 27, 33, 34, 31, 13, 40, 58, 24],
              "2Cor": [24, 17, 18, 18, 21, 18, 16, 24, 15, 18, 33, 21, 14],
              Gal: [24, 21, 29, 31, 26, 18],
              Eph: [23, 22, 21, 32, 33, 24],
              Phil: [30, 30, 21, 23],
              Col: [29, 23, 25, 18],
              "1Thess": [10, 20, 13, 18, 28],
              "2Thess": [12, 17, 18],
              "1Tim": [20, 15, 16, 16, 25, 21],
              "2Tim": [18, 26, 17, 22],
              Titus: [16, 15, 15],
              Phlm: [25],
              Heb: [14, 18, 19, 16, 14, 20, 28, 13, 28, 39, 40, 29, 25],
              Jas: [27, 26, 18, 17, 20],
              "1Pet": [25, 25, 22, 19, 14],
              "2Pet": [21, 22, 18],
              "1John": [10, 29, 24, 21, 21],
              "2John": [13],
              "3John": [15],
              Jude: [25],
              Rev: [20, 29, 22, 11, 14, 17, 17, 13, 21, 11, 19, 17, 18, 20, 8, 21, 18, 24, 21, 15, 27, 21],
              Tob: [22, 14, 17, 21, 22, 18, 16, 21, 6, 13, 18, 22, 17, 15],
              Jdt: [16, 28, 10, 15, 24, 21, 32, 36, 14, 23, 23, 20, 20, 19, 14, 25],
              GkEsth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 13, 12, 6, 18, 19, 16, 24],
              Wis: [16, 24, 19, 20, 23, 25, 30, 21, 18, 21, 26, 27, 19, 31, 19, 29, 21, 25, 22],
              Sir: [30, 18, 31, 31, 15, 37, 36, 19, 18, 31, 34, 18, 26, 27, 20, 30, 32, 33, 30, 31, 28, 27, 27, 34, 26, 29, 30, 26, 28, 25, 31, 24, 33, 31, 26, 31, 31, 34, 35, 30, 22, 25, 33, 23, 26, 20, 25, 25, 16, 29, 30],
              Bar: [22, 35, 37, 37, 9],
              PrAzar: [68],
              Sus: [64],
              Bel: [42],
              SgThree: [39],
              EpJer: [73],
              "1Macc": [64, 70, 60, 61, 68, 63, 50, 32, 73, 89, 74, 53, 53, 49, 41, 24],
              "2Macc": [36, 32, 40, 50, 27, 31, 42, 36, 29, 38, 38, 45, 26, 46, 39],
              "3Macc": [29, 33, 30, 21, 51, 41, 23],
              "4Macc": [35, 24, 21, 26, 38, 35, 23, 29, 32, 21, 27, 19, 27, 20, 32, 25, 24, 24],
              "1Esd": [58, 30, 24, 63, 73, 34, 15, 96, 55],
              "2Esd": [40, 48, 36, 52, 56, 59, 70, 63, 47, 59, 46, 51, 58, 48, 63, 78],
              PrMan: [15],
              Ps151: [7]
            }
          }
        };
    this.systems.current = structuredClone(this.systems.default);
  }
};

var bcv_grammar_options_default = {
  ab: /^(?:(?:a|b|c|d|e))(?!\p{L})/iu,
  and: /^(?:(?:(?:and\.?\s*)|&))/i,
  c_explicit: /^[\s*]*(?:(?:chapter\.?\s*))[\s*]*/i,
  c_sep_eu: /^\x1f\x1f\x1f/i,
  c_sep_us: /^\x1f\x1f\x1f/i,
  cv_sep_weak: /^(?:[\s*]*["'][\s*]*|[\s*])+/i,
  cv_sep_eu: /^[\s*]*,+[\s*]*/i,
  cv_sep_us: /^[\s*]*(?::+|\.(?!\s*\.\s*\.))[\s*]*/i,
  ff: /^[\s*]*(?:(?:ff\.?\s*))(?![\p{L}\p{N}])(?:\.(?!\s*\.))?/iu,
  in_book_of: /^[\s*]*(?:from|of|in)[\s*]*(?:the[\s*]*book[\s*]*of[\s*]*)?/i,
  next: /^(?:\x1f\x1f\x1f)/i,
  ordinal: /^(?:th|st|nd|rd)/i,
  range: /^[\s*]*(?:[\-–—]|(?:[\-–—]\.?\s*))+[\s*]*/i,
  sequence_eu: /^(?:[;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  sequence_us: /^(?:[,;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  space: /^[\s*]+/,
  title: /^[\s*]*(?:(?:title\.?\s*))(?!\p{L})[\s*]*/iu,
  v_explicit: /^[\s*]*(?:(?:verse\.?\s*))[\s*]*(?!\p{L})/iu
};
var regexps = bcv_regexps;
var translations = bcv_translations;
var grammar_options = bcv_grammar_options_default;
export {
  grammar_options,
  regexps,
  translations
};