var bcv_regexps = class {
  constructor() {
    this.books = [];
    this.languages = ["ori"];
    this.translations = [/ERV\b/gi];
    this.first = /(?:ପ୍ରଥମ\.?\s*|ପରଥମ\.?\s*|1\.?\s*)/;
    this.second = /(?:ଦ୍ୱିତୀୟ\.?\s*|ଦୱତୟ\.?\s*|ଦ୍ୱିତୟ\.?\s*|ଦ୍ୱତୀୟ\.?\s*|ଦ୍ୱତୟ\.?\s*|ଦୱିତୀୟ\.?\s*|ଦୱିତୟ\.?\s*|ଦୱତୀୟ\.?\s*|2\.?\s*)/;
    this.third = /(?:ତୃତୀୟ\.?\s*|ତତୟ\.?\s*|ତୃତୟ\.?\s*|ତତୀୟ\.?\s*|3\.?\s*)/;
    this.range_and = /(?:[&\u2013\u2014-]|and\.?\s*|(?:ଠାରୁ\.?\s*|ଠର\.?\s*|ଠାର\.?\s*|ଠରୁ\.?\s*))/;
    this.range_only = /(?:[\u2013\u2014-]|(?:ଠାରୁ\.?\s*|ଠର\.?\s*|ଠାର\.?\s*|ଠରୁ\.?\s*))/;
    this.match_end_split = /\d\W*(?:title)|\d\W*(?:ff)(?:[\s*]*\.)?|\d[\s*]*(?:ଖ)|\x1e(?:[\s*]*[)\]\uff09])?|[\d\x1f]/gi;
    this.control = /[\x1e\x1f]/g;
    this.escaped_passage = /(?:^|[^\x1e\x1f\p{L}\p{N}])((?:(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:[\u2013\u2014\-]|through|thru|to)\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:\d+(?:th|nd|st)\s*ch(?:apter|a?pt\.?|a?p?\.?)?\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*))?\x1f(\d+)(?:\/\d+)?\x1f(?:\/\d+\x1f|[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—]|title\.?\s*(?![a-z])|(?:(?:chapter\.?\s*)|(?:verse\.?\s*)|(?:ff\.?\s*)|(?:and\.?\s*)|(?:ଠ(?:ାରୁ?|ରୁ?)\.?\s*))|(?:ଖ\.?\s*)(?!\w)|$)+)/giu;
    this.pre_book = /(?:^|(?<=[^\p{L}]))/gu;
    this.pre_number_book = /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))/gu;
    this.post_book = /(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/gu;
    this.all_books = [
          {
            osis: ["Ps"],
            testament: "a",
            extra: "2",
            regexp: /\b(Ps151)(?=\.1\b)/g
          },
          {
            osis: ["Gen"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଆଦ(?:ି?ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ି)?|Gen))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Exod"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ାତ(?:୍ର(?:ା?\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା?ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା)?|ର(?:ା?\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା?ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା)?)|ତ(?:୍ର(?:ା?\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା?ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା)?|ର(?:ା?\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା?ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା)?))|Exod))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bel"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bel)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lev"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଲ(?:େବ(?:ୀୟ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ୟ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ବ(?:ୀୟ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ୟ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|Lev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Num"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଗଣନ(?:ା?\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ା)?|Num))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sir"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sir)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Wis"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Wis)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିର(?:ିମ(?:ିୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ))|ୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)))|ମ(?:ିୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ))|ୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ))))|ର(?:ିମ(?:ିୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ))|ୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)))|ମ(?:ିୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ))|ୟଙ(?:୍କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)|କ\s*ବ(?:ିଳା?ପ|ଳା?ପ)))))|Lam))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["EpJer"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(EpJer)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rev"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ୋହନଙ୍କ\s*ପ୍ରତି\s*ପ୍ରକାଶିତ\s*ବାକ୍|ହନଙକ\s*ପରତ\s*ପରକଶତ\s*ବକ)ୟ|Rev))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrMan"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrMan)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Deut"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?)|ୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?))|ତ(?:ୀୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?)|ୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?)))|ୱ(?:ିତ(?:ୀୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?)|ୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?))|ତ(?:ୀୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?)|ୟ\s*ବ(?:ିବରଣୀ?|ବରଣୀ?))))|Deut))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Josh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିହ(?:ୋଶ(?:ୂୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ଶ(?:ୂୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)))|ହ(?:ୋଶ(?:ୂୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ଶ(?:ୂୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))))|Josh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Judg"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ବ(?:ିଗ(?:୍ଭରକର(?:୍ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))))|ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))))|ଭରକର(?:୍ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))))|ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))))))|ଗ(?:୍ଭରକର(?:୍ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))))|ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))))|ଭରକର(?:୍ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))))|ତ(?:୍ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))|ତ(?:ାମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ))|ମ(?:ାନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)|ନଙ(?:୍କ\s*ବି?ବରଣ|କ\s*ବି?ବରଣ)))))))|Judg))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ruth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଋତର\s*ବ(?:ିବରଣ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ବରଣ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|Ruth))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Esd"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Esd)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Isa"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:(?:ିଶାଇୟ\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କର\s*ପୁସ୍|ଶଇୟ\s*ଭବଷୟଦବକତଙକର\s*ପସ)ତକ|(?:ିଶା|ଶ)ଇୟ|[ାୀ]ଶା?ଇୟ|ିଶଇୟ|ଶାଇୟ)|ୟ(?:ଶା?ଇ|ିଶା)ୟ|ୟ(?:ଶା?ୟ|ିଶୟ)|Isa))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))|ରଥମ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))))|1(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))|ୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))))|ତ(?:ୀୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))|ୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))|ୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))))|ତ(?:ୀୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))|ୟ(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))))))|2(?:\.\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?)))|\s*ଶ(?:ାମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))|ମ(?:ୁୟ(?:େଲଙ?|ଲଙ?)|ୟ(?:େଲଙ?|ଲଙ?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଶ(?:ାମୁୟେଲଙ୍କ\s*ଦ୍ୱିତୀୟ\s*ପୁସ୍|ମୟଲଙକ\s*ଦୱତୟ\s*ପସ)ତକ|2Sam))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଶ(?:ାମ(?:ୁୟ(?:େଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ୟ(?:େଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|ମ(?:ୁୟ(?:େଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ୟ(?:େଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ଲଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|କ\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))))|1Sam))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ରଥମ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|1(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|ତ(?:ୀୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|ତ(?:ୀୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))))|2(?:\.\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ର(?:ାଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଜ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ର(?:ାଜ(?:ାବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|ବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))))|ଜ(?:ାବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|ବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))))|2Kgs))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ର(?:ାଜ(?:ାବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ଜ(?:ାବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|1Kgs))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ରଥମ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|1(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|ତ(?:ୀୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))|ତ(?:ୀୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))|ୟ(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))))))|2(?:\.\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?))|\s*ବ(?:ଂଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)|ଶ(?:ାବଳ(?:ୀର?|ର)?|ବଳ(?:ୀର?|ର)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ବ(?:ଂଶ(?:ାବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|ବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))))|ଶ(?:ାବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|ବଳ(?:ୀର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ର\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ୱ(?:ିତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ତ(?:ୀୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ୟ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))))|2Chr))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ବ(?:ଂଶ(?:ାବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))))|ଶ(?:ାବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))|ବଳ(?:ୀର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))|ର\s*ପ(?:୍ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|ରଥମ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)))))|1Chr))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezra"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଏଜ(?:୍ରା?|ରା?)|Ezra))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Neh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ନ(?:ିହ(?:ିମ(?:ିୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)))|ମ(?:ିୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))))|ହ(?:ିମ(?:ିୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)))|ମ(?:ିୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ୟ(?:ାଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ଙ(?:୍କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|କର(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)))))|Neh))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["GkEsth"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(GkEsth)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Esth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଏଷ(?:୍ଟର\s*ବି?ବରଣ|ଟର\s*ବି?ବରଣ)|Esth))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Job"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଆୟ(?:ୁବ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ବ(?:\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|Job))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ps"],
            testament: "oa",
            testament_books: { Ps: "oa" },
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଗ(?:ୀତ(?:ିସ(?:ଂହ(?:ିତା?|ତା?)|ହ(?:ିତା?|ତା?))|ସ(?:ଂହ(?:ିତା?|ତା?)|ହ(?:ିତା?|ତା?)))|ାତସ(?:ଂହ(?:ିତା?|ତା?)|ହ(?:ିତା?|ତା?))|ତ(?:ିସ(?:ଂହ(?:ିତା?|ତା?)|ହ(?:ିତା?|ତା?))|ସ(?:ଂହ(?:ିତା?|ତା?)|ହ(?:ିତା?|ତା?))))|Ps))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["PrAzar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(PrAzar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Prov"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ହ(?:ିତ(?:ୋପଦେ?ଶ|ପଦେ?ଶ)|ତ(?:ୋପଦେ?ଶ|ପଦେ?ଶ))|Prov))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eccl"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଉପଦେ?ଶକ|Eccl))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["SgThree"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(SgThree)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Song"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ପରମଗୀ?ତ|Song))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jer"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିର(?:ିମ(?:ିୟ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ୟ)|ମି?ୟ)|ର(?:ମୟ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|(?:(?:ିମି?ୟ|ମିୟ)|ମୟ)))|Jer))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezek"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିହ(?:ିଜ(?:ିକଲ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|କଲ)|ଜି?କଲ)|ହଜକଲ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|(?:ହ(?:ିଜି?କ|ଜିକ)|ହଜକ)ଲ)|Ezek))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Dan"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଦ(?:ାନ(?:ିୟ(?:େଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟ(?:େଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?))|ନ(?:ିୟ(?:େଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)|ୟ(?:େଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?|ଲଙ(?:୍କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ)|କ\s*ପ(?:ୁସ୍?ତକ|ସ୍?ତକ))?)))|Dan))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ହ(?:ୋଶ(?:େୟ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ହେ|ହ|ୟ)|ଶ(?:ୟ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|(?:(?:େୟ|ହେ)|[ହୟ])))|Hos))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Joel"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ୋୟ(?:େଲ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ଲ)|ୟଲ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ୟେ?ଲ)|Joel))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Amos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଆମ(?:ୋଷ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ଷ(?:\s*ଭବଷୟଦବକତଙକ\s*ପସତକ)?)|Amos))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Obad"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଓବଦ(?:ିଅ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ଅ(?:\s*ଭବଷୟଦବକତଙକ\s*ପସତକ)?)|Obad))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jonah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ୂନସ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ନସ(?:\s*ଭବଷୟଦବକତଙକ\s*ପସତକ)?)|Jonah))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mic"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ମ(?:ୀଖ(?:ା(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?)?|ଖ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ି?ଖା|ି?ଖ)|Mic))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Nah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ନ(?:ାହ(?:ୂମ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ମ)|ହମ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ହୂ?ମ)|Nah))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hab"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ହବକ(?:୍କ(?:ୂକ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|କ)|କକ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|(?:[ୁୂ])?କ୍|କୂକ|କକ?|[ୁୂ]କ)|Hab))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zeph"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ସ(?:ିଫନ(?:ିୟ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ୟ)|ଫନୟ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ଫନି?ୟ)|Zeph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hag"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ହ(?:ାଗୟ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ଗୟ(?:\s*ଭବଷୟଦବକତଙକ\s*ପସତକ)?)|Hag))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zech"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିଖର(?:ିୟ(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?|ୟ)|ଖରୟ\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ଖରି?ୟ)|Zech))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mal"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ମଲ(?:ାଖ(?:ି(?:\s*ଭବିଷ୍ୟଦ୍ବକ୍ତାଙ୍କ\s*ପୁସ୍ତକ)?)?|ଖ(?:\s*ଭବଷୟଦବକତଙକ\s*ପସତକ|ି?))|Mal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Matt"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ମ(?:ାଥ(?:ିଉ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|ଉ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?)|ଥ(?:ିଉ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|ଉ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?))|Matt))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mark"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ମ(?:ାର(?:୍କ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|କ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?)|ର(?:୍କ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|କ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?))|Mark))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Luke"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଲ(?:ୂକ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|କ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?)|Luke))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ରଥମ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ))|1(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ))|ତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ))|ତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ))))|2(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ତ(?:ୃତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ))|ତ(?:ୀୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)|ୟ(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)))|3(?:\.\s*ଯୋ?ହନଙ|\s*ଯୋ?ହନଙ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଯ(?:ୋହନଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ହନଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|1John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଯ(?:ୋହନଙ(?:୍କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))|କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))))|ହନଙ(?:୍କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))|କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))))|2John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଯ(?:ୋହନଙ(?:୍କ\s*ତ(?:ୃତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|କ\s*ତ(?:ୃତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))|ହନଙ(?:୍କ\s*ତ(?:ୃତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|କ\s*ତ(?:ୃତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))))|3John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ୋହନ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?|ହନ(?:\s*ଲ(?:ିଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))|ଖ(?:ିତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର))|ତ\s*ସ(?:ୁସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)|ସମ(?:ାଗ୍?ଭର|ଗ୍?ଭର)))))?)|John))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Acts"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ପ(?:୍ର(?:େର(?:ିତ(?:ମାନଙ୍କ\s*କାର୍ଯ୍ୟର\s*ବିବରଣ)?|ତ)|ରି?ତ)|ର(?:ରତମନଙକ\s*କରଯୟର\s*ବବରଣ|(?:(?:େରି?ତ|ରିତ)|ରତ)))|Acts))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Deut"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))(ବ(?:ିବରଣି?|ବରଣି?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rom"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ର(?:ୋମ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ମ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|Rom))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))|ରଥମ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))))|1(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))|ୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))))|ତ(?:ୀୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))|ୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))|ୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))))|ତ(?:ୀୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))|ୟ(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))))))|2(?:\.\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)))|\s*କର(?:ିନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))|ନ(?:୍ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?)|ଥ(?:ୀୟ(?:ଙ୍?କ)?|ୟ(?:ଙ୍?କ)?))))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:କର(?:ିନ୍ଥୀୟଙ୍କ\s*ପ୍ରତି\s*ଦ୍ୱିତୀୟ\s*ପତ୍|ନଥୟଙକ\s*ପରତ\s*ଦୱତୟ\s*ପତ)ର|2Cor))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:କର(?:ିନ(?:୍ଥ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))|ଥ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))))|ନ(?:୍ଥ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))|ଥ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))))|1Cor))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Gal"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଗ(?:ାଲ(?:ାତ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ତ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|ଲ(?:ାତ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ତ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))))|Gal))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eph"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଏଫ(?:ିସ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ସ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|Eph))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phil"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଫ(?:ିଲ(?:ିପ(?:୍ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|ପ(?:୍ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))))|ଲ(?:ିପ(?:୍ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|ପ(?:୍ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ପ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))))|Phil))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Col"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:କଲସ(?:ୀୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ୟଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|Col))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))|ରଥମ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))))|1(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))|ୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))))|ତ(?:ୀୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))|ୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))|ୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))))|ତ(?:ୀୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))|ୟ(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))))))|2(?:\.\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ))|\s*ଥ(?:େସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)|ସଲନ(?:ୀକୀ?ୟଙ|କୀ?ୟଙ)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଥ(?:େସଲନୀକୀୟଙ୍କ\s*ପ୍ରତି\s*ଦ୍ୱିତୀୟ\s*ପତ୍|ସଲନକୟଙକ\s*ପରତ\s*ଦୱତୟ\s*ପତ)ର|2Thess))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଥ(?:େସଲନ(?:ୀକ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))|କ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))))|ସଲନ(?:ୀକ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))|କ(?:ୀୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ୟଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))))|1Thess))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))|ରଥମ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))))|1(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))|ୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))))|ତ(?:ୀୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))|ୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))|ୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))))|ତ(?:ୀୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))|ୟ(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))))))|2(?:\.\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ))|\s*ତ(?:ୀମଥ(?:ିଙ୍?କ|ଙ୍?କ)|ମଥ(?:ିଙ୍?କ|ଙ୍?କ)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ତ(?:ୀମଥିଙ୍କ\s*ପ୍ରତି\s*ଦ୍ୱିତୀୟ\s*ପତ୍|ମଥଙକ\s*ପରତ\s*ଦୱତୟ\s*ପତ)ର|2Tim))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ତ(?:ୀମଥ(?:ିଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))))|ମଥ(?:ିଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))|ଙ(?:୍କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|କ\s*ପ(?:୍ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ରତ(?:ି\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))))))|1Tim))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Titus"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ତ(?:ୀତସଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ତସଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|Titus))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phlm"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଫ(?:ିଲ(?:ୀମ(?:ୋନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ମ(?:ୋନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)))|ଲ(?:ୀମ(?:ୋନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))|ମ(?:ୋନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?)|ନଙ(?:୍କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?|କ(?:\s*ପ(?:୍ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)|ରତ(?:ି\s*ପତ୍?ର|\s*ପତ୍?ର)))?))))|Phlm))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Heb"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଏବ(?:୍ରୀ?|ରୀ?)|Heb))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jas"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ାକ(?:ୁବଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ବଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?))|କ(?:ୁବଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ବଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)))|Jas))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:୍ରଥମ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)|ରଥମ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ))|1(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ଦ(?:୍ୱ(?:ିତ(?:ୀୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)|ୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ))|ତ(?:ୀୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)|ୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)))|ୱ(?:ିତ(?:ୀୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)|ୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ))|ତ(?:ୀୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)|ୟ(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ))))|2(?:\.\s*ପି?ତରଙ|\s*ପି?ତରଙ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:ିତରଙ(?:୍କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))|କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))))|ତରଙ(?:୍କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))|କ\s*ଦ(?:୍ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର))|ୱ(?:ିତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)|ତ(?:ୀୟ\s*ପତ୍?ର|ୟ\s*ପତ୍?ର)))))|2Pet))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ପ(?:ିତରଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର))|ତରଙ(?:୍କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)|କ\s*ପ(?:୍ରଥମ\s*ପତ୍?ର|ରଥମ\s*ପତ୍?ର)))|1Pet))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jude"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ଯ(?:ିହ(?:ୂଦ(?:ାଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?))|ଦ(?:ାଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)))|ହ(?:ୂଦ(?:ାଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?))|ଦ(?:ାଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?)|ଙ(?:୍କ(?:\s*ପତ୍?ର)?|କ(?:\s*ପତ୍?ର)?))))|Jude))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Tob"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Tob)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jdt"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Jdt)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Bar)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sus"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(Sus)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(2Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(3Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["4Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(4Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(1Macc)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          }
        ];
  }
};

var bcv_translations = class {
  constructor() {
    this.aliases = { current: { system: "current", osis: "" }, default: { system: "default", osis: "" } };
    this.current_system = "default";
    this.systems = {
          current: {},
          default: {
            order: {
              Gen: 1,
              Exod: 2,
              Lev: 3,
              Num: 4,
              Deut: 5,
              Josh: 6,
              Judg: 7,
              Ruth: 8,
              "1Sam": 9,
              "2Sam": 10,
              "1Kgs": 11,
              "2Kgs": 12,
              "1Chr": 13,
              "2Chr": 14,
              Ezra: 15,
              Neh: 16,
              Esth: 17,
              Job: 18,
              Ps: 19,
              Prov: 20,
              Eccl: 21,
              Song: 22,
              Isa: 23,
              Jer: 24,
              Lam: 25,
              Ezek: 26,
              Dan: 27,
              Hos: 28,
              Joel: 29,
              Amos: 30,
              Obad: 31,
              Jonah: 32,
              Mic: 33,
              Nah: 34,
              Hab: 35,
              Zeph: 36,
              Hag: 37,
              Zech: 38,
              Mal: 39,
              Matt: 40,
              Mark: 41,
              Luke: 42,
              John: 43,
              Acts: 44,
              Rom: 45,
              "1Cor": 46,
              "2Cor": 47,
              Gal: 48,
              Eph: 49,
              Phil: 50,
              Col: 51,
              "1Thess": 52,
              "2Thess": 53,
              "1Tim": 54,
              "2Tim": 55,
              Titus: 56,
              Phlm: 57,
              Heb: 58,
              Jas: 59,
              "1Pet": 60,
              "2Pet": 61,
              "1John": 62,
              "2John": 63,
              "3John": 64,
              Jude: 65,
              Rev: 66,
              Tob: 67,
              Jdt: 68,
              GkEsth: 69,
              Wis: 70,
              Sir: 71,
              Bar: 72,
              PrAzar: 73,
              Sus: 74,
              Bel: 75,
              SgThree: 76,
              EpJer: 77,
              "1Macc": 78,
              "2Macc": 79,
              "3Macc": 80,
              "4Macc": 81,
              "1Esd": 82,
              "2Esd": 83,
              PrMan: 84
            },
            chapters: {
              Gen: [31, 25, 24, 26, 32, 22, 24, 22, 29, 32, 32, 20, 18, 24, 21, 16, 27, 33, 38, 18, 34, 24, 20, 67, 34, 35, 46, 22, 35, 43, 55, 32, 20, 31, 29, 43, 36, 30, 23, 23, 57, 38, 34, 34, 28, 34, 31, 22, 33, 26],
              Exod: [22, 25, 22, 31, 23, 30, 25, 32, 35, 29, 10, 51, 22, 31, 27, 36, 16, 27, 25, 26, 36, 31, 33, 18, 40, 37, 21, 43, 46, 38, 18, 35, 23, 35, 35, 38, 29, 31, 43, 38],
              Lev: [17, 16, 17, 35, 19, 30, 38, 36, 24, 20, 47, 8, 59, 57, 33, 34, 16, 30, 37, 27, 24, 33, 44, 23, 55, 46, 34],
              Num: [54, 34, 51, 49, 31, 27, 89, 26, 23, 36, 35, 16, 33, 45, 41, 50, 13, 32, 22, 29, 35, 41, 30, 25, 18, 65, 23, 31, 40, 16, 54, 42, 56, 29, 34, 13],
              Deut: [46, 37, 29, 49, 33, 25, 26, 20, 29, 22, 32, 32, 18, 29, 23, 22, 20, 22, 21, 20, 23, 30, 25, 22, 19, 19, 26, 68, 29, 20, 30, 52, 29, 12],
              Josh: [18, 24, 17, 24, 15, 27, 26, 35, 27, 43, 23, 24, 33, 15, 63, 10, 18, 28, 51, 9, 45, 34, 16, 33],
              Judg: [36, 23, 31, 24, 31, 40, 25, 35, 57, 18, 40, 15, 25, 20, 20, 31, 13, 31, 30, 48, 25],
              Ruth: [22, 23, 18, 22],
              "1Sam": [28, 36, 21, 22, 12, 21, 17, 22, 27, 27, 15, 25, 23, 52, 35, 23, 58, 30, 24, 42, 15, 23, 29, 22, 44, 25, 12, 25, 11, 31, 13],
              "2Sam": [27, 32, 39, 12, 25, 23, 29, 18, 13, 19, 27, 31, 39, 33, 37, 23, 29, 33, 43, 26, 22, 51, 39, 25],
              "1Kgs": [53, 46, 28, 34, 18, 38, 51, 66, 28, 29, 43, 33, 34, 31, 34, 34, 24, 46, 21, 43, 29, 53],
              "2Kgs": [18, 25, 27, 44, 27, 33, 20, 29, 37, 36, 21, 21, 25, 29, 38, 20, 41, 37, 37, 21, 26, 20, 37, 20, 30],
              "1Chr": [54, 55, 24, 43, 26, 81, 40, 40, 44, 14, 47, 40, 14, 17, 29, 43, 27, 17, 19, 8, 30, 19, 32, 31, 31, 32, 34, 21, 30],
              "2Chr": [17, 18, 17, 22, 14, 42, 22, 18, 31, 19, 23, 16, 22, 15, 19, 14, 19, 34, 11, 37, 20, 12, 21, 27, 28, 23, 9, 27, 36, 27, 21, 33, 25, 33, 27, 23],
              Ezra: [11, 70, 13, 24, 17, 22, 28, 36, 15, 44],
              Neh: [11, 20, 32, 23, 19, 19, 73, 18, 38, 39, 36, 47, 31],
              Esth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 3],
              Job: [22, 13, 26, 21, 27, 30, 21, 22, 35, 22, 20, 25, 28, 22, 35, 22, 16, 21, 29, 29, 34, 30, 17, 25, 6, 14, 23, 28, 25, 31, 40, 22, 33, 37, 16, 33, 24, 41, 30, 24, 34, 17],
              Ps: [6, 12, 8, 8, 12, 10, 17, 9, 20, 18, 7, 8, 6, 7, 5, 11, 15, 50, 14, 9, 13, 31, 6, 10, 22, 12, 14, 9, 11, 12, 24, 11, 22, 22, 28, 12, 40, 22, 13, 17, 13, 11, 5, 26, 17, 11, 9, 14, 20, 23, 19, 9, 6, 7, 23, 13, 11, 11, 17, 12, 8, 12, 11, 10, 13, 20, 7, 35, 36, 5, 24, 20, 28, 23, 10, 12, 20, 72, 13, 19, 16, 8, 18, 12, 13, 17, 7, 18, 52, 17, 16, 15, 5, 23, 11, 13, 12, 9, 9, 5, 8, 28, 22, 35, 45, 48, 43, 13, 31, 7, 10, 10, 9, 8, 18, 19, 2, 29, 176, 7, 8, 9, 4, 8, 5, 6, 5, 6, 8, 8, 3, 18, 3, 3, 21, 26, 9, 8, 24, 13, 10, 7, 12, 15, 21, 10, 20, 14, 9, 6],
              Prov: [33, 22, 35, 27, 23, 35, 27, 36, 18, 32, 31, 28, 25, 35, 33, 33, 28, 24, 29, 30, 31, 29, 35, 34, 28, 28, 27, 28, 27, 33, 31],
              Eccl: [18, 26, 22, 16, 20, 12, 29, 17, 18, 20, 10, 14],
              Song: [17, 17, 11, 16, 16, 13, 13, 14],
              Isa: [31, 22, 26, 6, 30, 13, 25, 22, 21, 34, 16, 6, 22, 32, 9, 14, 14, 7, 25, 6, 17, 25, 18, 23, 12, 21, 13, 29, 24, 33, 9, 20, 24, 17, 10, 22, 38, 22, 8, 31, 29, 25, 28, 28, 25, 13, 15, 22, 26, 11, 23, 15, 12, 17, 13, 12, 21, 14, 21, 22, 11, 12, 19, 12, 25, 24],
              Jer: [19, 37, 25, 31, 31, 30, 34, 22, 26, 25, 23, 17, 27, 22, 21, 21, 27, 23, 15, 18, 14, 30, 40, 10, 38, 24, 22, 17, 32, 24, 40, 44, 26, 22, 19, 32, 21, 28, 18, 16, 18, 22, 13, 30, 5, 28, 7, 47, 39, 46, 64, 34],
              Lam: [22, 22, 66, 22, 22],
              Ezek: [28, 10, 27, 17, 17, 14, 27, 18, 11, 22, 25, 28, 23, 23, 8, 63, 24, 32, 14, 49, 32, 31, 49, 27, 17, 21, 36, 26, 21, 26, 18, 32, 33, 31, 15, 38, 28, 23, 29, 49, 26, 20, 27, 31, 25, 24, 23, 35],
              Dan: [21, 49, 30, 37, 31, 28, 28, 27, 27, 21, 45, 13],
              Hos: [11, 23, 5, 19, 15, 11, 16, 14, 17, 15, 12, 14, 16, 9],
              Joel: [20, 32, 21],
              Amos: [15, 16, 15, 13, 27, 14, 17, 14, 15],
              Obad: [21],
              Jonah: [17, 10, 10, 11],
              Mic: [16, 13, 12, 13, 15, 16, 20],
              Nah: [15, 13, 19],
              Hab: [17, 20, 19],
              Zeph: [18, 15, 20],
              Hag: [15, 23],
              Zech: [21, 13, 10, 14, 11, 15, 14, 23, 17, 12, 17, 14, 9, 21],
              Mal: [14, 17, 18, 6],
              Matt: [25, 23, 17, 25, 48, 34, 29, 34, 38, 42, 30, 50, 58, 36, 39, 28, 27, 35, 30, 34, 46, 46, 39, 51, 46, 75, 66, 20],
              Mark: [45, 28, 35, 41, 43, 56, 37, 38, 50, 52, 33, 44, 37, 72, 47, 20],
              Luke: [80, 52, 38, 44, 39, 49, 50, 56, 62, 42, 54, 59, 35, 35, 32, 31, 37, 43, 48, 47, 38, 71, 56, 53],
              John: [51, 25, 36, 54, 47, 71, 53, 59, 41, 42, 57, 50, 38, 31, 27, 33, 26, 40, 42, 31, 25],
              Acts: [26, 47, 26, 37, 42, 15, 60, 40, 43, 48, 30, 25, 52, 28, 41, 40, 34, 28, 41, 38, 40, 30, 35, 27, 27, 32, 44, 31],
              Rom: [32, 29, 31, 25, 21, 23, 25, 39, 33, 21, 36, 21, 14, 23, 33, 27],
              "1Cor": [31, 16, 23, 21, 13, 20, 40, 13, 27, 33, 34, 31, 13, 40, 58, 24],
              "2Cor": [24, 17, 18, 18, 21, 18, 16, 24, 15, 18, 33, 21, 14],
              Gal: [24, 21, 29, 31, 26, 18],
              Eph: [23, 22, 21, 32, 33, 24],
              Phil: [30, 30, 21, 23],
              Col: [29, 23, 25, 18],
              "1Thess": [10, 20, 13, 18, 28],
              "2Thess": [12, 17, 18],
              "1Tim": [20, 15, 16, 16, 25, 21],
              "2Tim": [18, 26, 17, 22],
              Titus: [16, 15, 15],
              Phlm: [25],
              Heb: [14, 18, 19, 16, 14, 20, 28, 13, 28, 39, 40, 29, 25],
              Jas: [27, 26, 18, 17, 20],
              "1Pet": [25, 25, 22, 19, 14],
              "2Pet": [21, 22, 18],
              "1John": [10, 29, 24, 21, 21],
              "2John": [13],
              "3John": [15],
              Jude: [25],
              Rev: [20, 29, 22, 11, 14, 17, 17, 13, 21, 11, 19, 17, 18, 20, 8, 21, 18, 24, 21, 15, 27, 21],
              Tob: [22, 14, 17, 21, 22, 18, 16, 21, 6, 13, 18, 22, 17, 15],
              Jdt: [16, 28, 10, 15, 24, 21, 32, 36, 14, 23, 23, 20, 20, 19, 14, 25],
              GkEsth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 13, 12, 6, 18, 19, 16, 24],
              Wis: [16, 24, 19, 20, 23, 25, 30, 21, 18, 21, 26, 27, 19, 31, 19, 29, 21, 25, 22],
              Sir: [30, 18, 31, 31, 15, 37, 36, 19, 18, 31, 34, 18, 26, 27, 20, 30, 32, 33, 30, 31, 28, 27, 27, 34, 26, 29, 30, 26, 28, 25, 31, 24, 33, 31, 26, 31, 31, 34, 35, 30, 22, 25, 33, 23, 26, 20, 25, 25, 16, 29, 30],
              Bar: [22, 35, 37, 37, 9],
              PrAzar: [68],
              Sus: [64],
              Bel: [42],
              SgThree: [39],
              EpJer: [73],
              "1Macc": [64, 70, 60, 61, 68, 63, 50, 32, 73, 89, 74, 53, 53, 49, 41, 24],
              "2Macc": [36, 32, 40, 50, 27, 31, 42, 36, 29, 38, 38, 45, 26, 46, 39],
              "3Macc": [29, 33, 30, 21, 51, 41, 23],
              "4Macc": [35, 24, 21, 26, 38, 35, 23, 29, 32, 21, 27, 19, 27, 20, 32, 25, 24, 24],
              "1Esd": [58, 30, 24, 63, 73, 34, 15, 96, 55],
              "2Esd": [40, 48, 36, 52, 56, 59, 70, 63, 47, 59, 46, 51, 58, 48, 63, 78],
              PrMan: [15],
              Ps151: [7]
            }
          }
        };
    this.systems.current = structuredClone(this.systems.default);
  }
};

var bcv_grammar_options_default = {
  ab: /^(?:ଖ)(?!\p{L})/iu,
  and: /^(?:(?:(?:and\.?\s*)|&))/i,
  c_explicit: /^[\s*]*(?:(?:chapter\.?\s*))[\s*]*/i,
  c_sep_eu: /^\x1f\x1f\x1f/i,
  c_sep_us: /^\x1f\x1f\x1f/i,
  cv_sep_weak: /^(?:[\s*]*["'][\s*]*|[\s*])+/i,
  cv_sep_eu: /^[\s*]*,+[\s*]*/i,
  cv_sep_us: /^[\s*]*(?::+|\.(?!\s*\.\s*\.))[\s*]*/i,
  ff: /^[\s*]*(?:(?:ff\.?\s*))(?![\p{L}\p{N}])(?:\.(?!\s*\.))?/iu,
  in_book_of: /^[\s*]*(?:from|of|in)[\s*]*(?:the[\s*]*book[\s*]*of[\s*]*)?/i,
  next: /^(?:\x1f\x1f\x1f)/i,
  ordinal: /^(?:th|st|nd|rd)/i,
  range: /^[\s*]*(?:[\-–—]|(?:ଠ(?:ାରୁ?|ରୁ?)\.?\s*))+[\s*]*/i,
  sequence_eu: /^(?:[;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  sequence_us: /^(?:[,;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:and\.?\s*))+/i,
  space: /^[\s*]+/,
  title: /^[\s*]*(?:(?:title\.?\s*))(?!\p{L})[\s*]*/iu,
  v_explicit: /^[\s*]*(?:(?:verse\.?\s*))[\s*]*(?!\p{L})/iu
};
var regexps = bcv_regexps;
var translations = bcv_translations;
var grammar_options = bcv_grammar_options_default;
export {
  grammar_options,
  regexps,
  translations
};